using System.Security.Cryptography;
using System;
using System.Collections;
using System.Collections.Generic;
using System.IO;
using TMPro;
using Unity.VisualScripting;
using UnityEngine;
using UnityEngine.UI;

public enum Language
{
    NONE = 0,
    EN = 1,
    KR = 2,
    TC = 3,
    SC = 4,
    JP = 5,
    FR,
    DE,
    RU,
    ES,
    IT,
    PT,
    VN,
    ID,
    TH,
    TR,
    HI,
}

public class LanguageManager : GameObjectSingleton<LanguageManager>
{
    public Language Language
    {
        get => this.lan;
    }

    public Language AudioLanguage
    {
        get => this.audioLan;
    }

    // public void UpdateLan()
    // {
    //     this.lan = (Language)Enum.Parse(typeof(Language), DataManager.Instance.UserData.lan);
    //     Preference.SavePreference(Pref.LANGUAGE, (int)this.lan);
    //
    //     this.audioLan = (Language)Enum.Parse(typeof(Language), DataManager.Instance.UserData.audioLan);
    //     Preference.SavePreference(Pref.AUDIO_LANGUAGE, (int)this.audioLan);
    // }

    public string GetAIName()
    {
        return BiniLab.Utils.RandomPick(this.names);
    }

    public bool CanUseWord(string word)
    {
        return !this.badNames.Exists(n => !string.IsNullOrEmpty(n) && (n.IndexOf(word) >= 0 || word.IndexOf(n) >= 0));
    }

    public Font GetFont()
    {
        switch (this.lan)
        {
            case Language.EN: return this.fontEN;
            case Language.KR: return this.fontKR;
            case Language.JP: return this.fontJP;
            case Language.TC: return this.fontCN_SC;
            case Language.SC: return this.fontCN_SC;
            case Language.TH: return this.fontTH;
            // case Language.RU: return this.fontRU;
        }

        return this.fontArial;
    }

    public TMP_FontAsset GetTextMeshProFont()
    {
        switch (this.lan)
        {
            case Language.EN: return this.fontEN_TxtMeshPro;
            case Language.KR: return this.fontKR_TxtMeshPro;
            case Language.JP: return this.fontJP_TxtMeshPro;
            case Language.TC: return this.fontCN_SC_TxtMeshPro;
            case Language.SC: return this.fontCN_SC_TxtMeshPro;
            case Language.TH: return this.fontTH_TxtMeshPro;
            // case Language.RU: return this.fontRU_TxtMeshPro;
        }

        return this.fontArial_TxtMeshPro;
    }

    public string GetLanguageNameText(Language lan)
    {
        switch (lan)
        {
            case Language.EN: return "ENGLISH";
            case Language.KR: return "한국어";
            case Language.JP: return "日本語";
            case Language.TC: return "繁體中文";
            case Language.SC: return "简体中文";
            case Language.FR: return "Français";
            case Language.DE: return "Deutsch";
            case Language.RU: return "Pусский";
            case Language.ES: return "Español";
            case Language.IT: return "Italiano";
            case Language.PT: return "Português";
            case Language.VN: return "Tiếng Việt";
            case Language.ID: return "bahasa Indonesia";
            case Language.TH: return "ไทย";
            case Language.TR: return "Türk";
            case Language.HI: return "हिन्दी";
        }

        return string.Empty;
    }

    public string GetLanguageAudioNameText(Language lan, Language audioLan)
    {
        switch (lan)
        {
            case Language.KR:
            {
                switch (audioLan)
                {
                    case Language.KR: return "한국어";
                    case Language.JP: return "일본어";
                }
            }
                break;
            case Language.TC:
                switch (audioLan)
                {
                    case Language.KR: return "韓國語";
                    case Language.JP: return "日語";
                }

                break;
            case Language.SC:
                switch (audioLan)
                {
                    case Language.KR: return "韩国语";
                    case Language.JP: return "日语";
                }

                break;
            case Language.TH:
                switch (audioLan)
                {
                    case Language.KR: return "เกาหลี";
                    case Language.JP: return "ญี่ปุ่น";
                }

                break;
            default:
                switch (audioLan)
                {
                    case Language.KR: return "Korean";
                    case Language.JP: return "Japanese";
                }

                break;
        }

        return string.Empty;
    }

    public string GetVersionText()
    {
        switch (lan)
        {
            case Language.EN: return "Version";
            case Language.KR: return "버전";
            case Language.JP: return "バージョン";
            case Language.TC: return "版本";
            case Language.SC: return "版本";
            case Language.TH: return "รุ่น";
            default: return "Version";
        }
    }

    public string GetTermOfServiceNameText()
    {
        switch (lan)
        {
            case Language.EN: return "Terms of service";
            case Language.KR: return "이용약관";
            case Language.TC: return "使用條款";
            case Language.SC: return "使用条款";
            case Language.TH: return "ข้อกำหนดการใช้งาน";
            case Language.JP: return "利用規約";
            default: return "Terms of service";
        }
    }

    public string GetPrivacyPolicyText()
    {
        switch (lan)
        {
            case Language.EN: return "Personal Information Protection Policy";
            case Language.KR: return "개인정보 보호정책";
            case Language.TC: return "隱私政策";
            case Language.SC: return "隐私政策";
            case Language.TH: return "นโยบายความเป็นส่วนตัว";
            case Language.JP: return "個人情報保護方針";
            default: return "Personal Information Protection Policy";
        }
    }

    public string GetTermOfServiceLinkText()
    {
        switch (lan)
        {
            case Language.EN: return "Log in if you agree to the <color=#D9B949>\"Terms of Use\"</color> and <color=#D9B949>\"Privacy Policy\"</color>";
            case Language.KR: return "<color=#D9B949>\"이용약관\"</color> 및 <color=#D9B949>\"개인정보 보호정책\"</color>에 동의시 로그인";
            case Language.TC: return "如果您同意<color=#D9B949>“使用條款”</color>和<color=#D9B949>“隱私政策”</color>，請登錄";
            case Language.SC: return "如果您同意<color=#D9B949>“使用条款”</color>和<color=#D9B949>“隐私政策”</color>，请登录";
            case Language.TH: return "<color=#D9B949>“ข้อกำหนดการใช้งาน”</color>和<color=#D9B949>“นโยบายความเป็นส่วนตัว”</color> ลงชื่อเข้าใช้หากคุณเห็นด้วย";
            case Language.JP: return "<color=#D9B949>\"利用規約\"</color>および<color=#D9B949>\"プライバシーポリシー\"</color>に同意するとログイン";
            default: return "Log in if you agree to the <color=#D9B949>\"Terms of Use\"</color> and <color=#D9B949>\"Privacy Policy\"</color>";
        }
    }

    public string GetTermOfServiceText(int index)
    {
        switch (lan)
        {
            case Language.KR:
                if (index == 0)
                    return
                        "쿡앱스 모바일 서비스 이용약관\n(광고성 정보 수신 동의 포함)\n \n\n제1조(목적)\n본 약관은 쿡앱스(주)(이하 “회사”라 합니다)가 모바일 기기를 통해 제공하는 모든 게임 서비스 및 이에 부수하는 네트워크, 웹사이트, 기타 서비스(이하 “서비스”라 합니다)이용에 대한 회사와 회원 간의 권리와 의무, 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.\n \n제2조(용어의 정의)\n\u2460 본 약관에서 사용하는 용어의 정의는 아래와 같습니다.\n1. “회원”이라 함은 이 약관에 따라 이용계약을 체결하고, 회사가 제공하는 서비스를 이용하는 자를 의미합니다.\n2. “임시회원”이란 계정정보를 외부계정과 연동 또는 인증을 하지 않거나 게스트 로그인 모드를 통해 서비스를 이용하는 회원을 의미합니다.\n3. “모바일 기기”란 네트워크를 통해 콘텐츠를 다운로드 받거나 설치하여 사용할 수 있는 기기로서, 휴대폰, 스마트폰, 휴대정보단말기(PDA), 태블릿 등을 의미합니다.\n4. “계정정보”란 회원의 회원번호와 외부계정정보, 기기정보, 별명, 프로필 사진, 친구목록 등 회원이 회사에 제공한 정보와 게임이용정보 (캐릭터 정보, 아이템, 레벨 등), 이용요금 결제 정보 등을 통칭합니다.\n5. “콘텐츠”란 모바일 기기로 이용할 수 있도록 회사가 서비스 제공과 관련하여 디지털 방식으로 제작한 유료 또는 무료의 내용물 일체(게임 및 네트워크 서비스, 애플리케이션, 게임 머니, 게임 아이템 등)를 의미합니다.\n6. “유료 결제”란 서비스 내 콘텐츠 등을 구매 또는 이용하기 위해 회사가 인정하는 결제업체를 통한 결제 행위를 의미합니다.\n7. “오픈마켓”이란 모바일 기기에서 애플리케이션을 설치하고 유료 결제를 할 수 있도록 구축된 전자상거래 환경을 의미합니다.\n8. “제휴 서비스”라 함은 회사가 카카오 등 타 모바일 플랫폼 서비스사와 제휴를 통하여 제공하는 서비스로서, 제휴 모바일 플랫폼의 가입 정보, 프로필 사진 등을 이용해 모바일 기기에서 서비스를 이용할 수 있도록 제공하는 개별 또는 일체의 서비스를 의미합니다.\n9. “결제업체”라 함은 신용카드, 휴대폰결제 등 오픈마켓에서 사용 가능한 전자지급수단을 제공하는 업체를 의미합니다.\n10. “애플리케이션”이란 회사가 제공하는 서비스를 이용하기 위하여 모바일기기를 통해 다운로드 받거나 설치하여 사용하는 프로그램 일체를 의미합니다.\n11. “게임서비스”라 함은 회사가 제공하는 서비스의 하나로서 회원이 모바일 기기에서 실행하는 게임 및 이에 부수하는 서비스를 의미합니다.\n\u2461 이 약관에서 사용하는 용어의 정의는 본 조 제1항에서 정하는 것을 제외하고는 관계법령 및 서비스별 정책에서 정하는 바에 의하며, 이에 정하지 아니한 것은 일반적인 상 관례에 따릅니다.\n \n제3조 (회사정보 등의 제공)\n회사는 다음 각 호의 사항을 회원이 알아보기 쉽도록 게임서비스 내에 표시합니다. 다만, 개인정보처리방침과 약관은 회원이 연결화면을 통하여 볼 수 있도록 할 수 있습니다\n1. 상호 및 대표자의 성명\n2. 영업소 소재지 주소(회원의 불만을 처리할 수 있는 곳의 주소를 포함합니다)\n3. 전화번호, 전자우편주소\n4. 사업자 등록번호\n5. 통신판매업신고번호\n6. 개인정보처리방침\n7. 서비스 이용약관\n \n제4조(약관의 효력 및 변경)\n\u2460 회사는 이 약관의 내용을 회원이 알 수 있도록 게임서비스 내 또는 그 연결 화면에 게시합니다. 이 경우 이 약관의 내용 중 서비스 중단, 청약철회, 환급, 계약 해제ㆍ해지, 회사의 면책사항 등과 같은 중요한 내용은 굵은 글씨, 색채, 부호 등으로 명확하게 표시하거나 별도의 연결 화면 등을 통하여 회원이 알아보기 쉽게 처리합니다.\n\u2461 회사가 약관을 개정할 경우에는 적용일자 및 개정내용, 개정사유 등을 명시하여 최소한 그 적용일 7일 이전부터 게임서비스 내 또는 그 연결 화면에 게시하여 회원에게 공지합니다. 다만, 변경된 내용이 회원에게 불리하거나 중대한 사항의 변경인 경우에는 그 적용일 30일 이전까지 본문과 같은 방법으로 공지하고 제28조 제1항의 방법으로 회원에게 통지합니다. 이 경우 개정 전 내용과 개정 후 내용을 명확하게 비교하여 회원이 알기 쉽도록 표시합니다.\n\u2462 회사가 약관을 개정할 경우 개정약관 공지 후 개정약관의 적용에 대한 회원의 동의 여부를 확인합니다. 회사는 제2항의 공지 또는 통지를 할 경우 회원이 개정약관에 대해 동의 또는 거부의 의사표시를 하지 않으면 동의한 것으로 볼 수 있다는 내용도 함께 공지 또는 통지를 하며, 회원이 이 약관 시행일까지 거부의 의사표시를 하지 않는다면 개정약관에 동의한 것으로 볼 수 있습니다. 회원이 개정약관에 대해 동의하지 않는 경우 회사 또는 회원은 서비스 이용계약을 해지할 수 있습니다.\n\u2463 회사는 회원이 회사와 이 약관의 내용에 관하여 질의 및 응답을 할 수 있도록 조치를 취합니다.\n\u2464 회사는 「전자상거래 등에서의 소비자보호에 관한 법률」, 「약관의 규제에 관한 법률」, 「게임산업진흥에 관한 법률」, 「정보통신망이용촉진 및 정보보호 등에 관한 법률」, 「콘텐츠산업진흥법」 등 관련 법령에 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.\n \n제5조(이용계약의 체결 및 적용)\n\u2460 이용계약은 회원이 되고자 하는 자(이하 “가입신청자”라 합니다)가 이 약관의 내용에 대하여 동의를 한 다음 서비스 이용 신청을 하고, 회사가 그 신청에 대해서 승낙함으로써 체결됩니다.\n\u2461 회사는 가입신청자의 신청에 대하여 승낙함을 원칙으로 합니다. 다만, 회사는 다음 각 호의 어느 하나에 해당하는 이용 신청에 대해서는 승낙을 거절할 수 있습니다.\n1. 이용신청서 내용을 허위로 기재하거나 이용신청 요건을 충족하지 못한 경우\n2. 회사가 서비스를 제공하지 않거나, 제공할 것으로 결정하지 않은 국가에서의 비정상적이거나 우회적인 방법을 통해 이용 신청하는 경우\n3. 「게임산업진흥에 관한 법률」등 현행 법령에서 금지하는 행위를 할 목적으로 이용신청 하는 경우\n4. 사회의 안녕과 질서 또는 미풍양속을 저해할 목적 또는 회사의 이익을 저해하려는 목적으로 신청하는 경우\n5. 부정한 용도로 서비스를 이용하고자 하는 경우\n6. 영리를 추구할 목적으로 서비스를 이용하고자 하는 경우\n7. 회사가 서비스 이용을 제한한 모바일 기기, 프로그램 등을 통해 이용신청을 하는 경우\n8. 그 밖에 각 호에 준하는 사유로서 승낙이 부적절하다고 판단되는 경우\n\u2462 회사는 다음 각 호의 어느 하나에 해당하는 경우 그 사유가 해소될 때까지 승낙을 유보할 수 있습니다.\n1. 회사의 설비에 여유가 없거나, 특정 모바일 기기의 지원이 어렵거나, 기술적 장애가 있는 경우\n2. 서비스 또는 결제 수단의 장애 등 기술상 지장이 있는 경우\n3. 그 밖의 위 각호에 준하는 사유로서 이용신청의 승낙이 어렵다고 판단되는 경우\n\u2463 회사는 회원이 약관 동의 절차 또는 서비스 이용에 필요한 정보의 입력을 완료하면, 승낙을 보류하거나 거부할 사항이 없는 경우 그 즉시 서비스를 이용할 수 있도록 합니다. 단, 사후에 제2항에 따른 사항이 확인되는 경우에는 본 약관의 규정에 따라 이용제한이나 계약해지를 할 수 있습니다.\n\u2464 회사는 이용자의 편의를 위하여 게임서비스에 대해 임시 회원 기능을 제공할 수 있습니다.  임시 회원 기능 이용 중 아래 각 호에 해당하는 경우 계정정보가 삭제되거나 기록을 확인할 수 없는 문제가 발생할 수 있으며, 임시회원 기능을 통해 이용하던 게임서비스의 계정정보는 이후 연계 또는 이전이 불가할 수 있습니다. 이 경우 회사는 계정정보의 복구를 보장하지 않으며, 이에 대한 보상 및 손해배상에 대한 책임을 지지 않습니다. 단, 회사의 고의 또는 중과실에 의한 경우에는 그러하지 아니합니다.\n1. 모바일 기기를 변경한 경우\n2. 모바일 기기를 개조하거나 초기화한 경우\n3. 모바일 기기에서 어플리케이션 등 콘텐츠의 전부 또는 일부를 삭제한 경우\n \n제6조(약관 외 준칙)\n이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 「전자상거래 등에서의 소비자보호에 관한 법률」, 「약관의 규제에 관한 법률」, 「게임산업진흥에 관한 법률」, 「정보통신망이용촉진 및 정보보호 등에 관한 법률」, 「콘텐츠산업진흥법」 등 관련 법령 또는 상 관례에 따릅니다.\n \n제7조(운영정책)\n\u2460 약관을 적용하기 위하여 필요한 사항과 약관에서 구체적 범위를 정하여 위임한 사항을 게임서비스 운영정책(이하 “운영정책”이라 합니다)으로 정할 수 있습니다.\n\u2461 회사는 운영정책의 내용을 회원이 알 수 있도록 게임서비스 내 또는 그 연결화면에 게시합니다.\n\u2462 운영정책을 개정하는 경우에는 제4조 제2항의 절차에 따릅니다. 다만, 개정 내용이 다음 각 호의 어느 하나에 해당하는 경우에는 제2항의 방법으로 사전에 공지합니다.\n 1. 약관에서 구체적으로 범위를 정하여 위임한 사항을 개정하는 경우\n 2. 회원의 권리·의무와 관련 없는 사항을 개정하는 경우\n 3. 운영정책의 내용이 약관에서 정한 내용과 근본적으로 다르지 않고 회원이 예측할 수 있는 범위 내에서 운영정책을 개정하는 경우\n \n제8조(개인정보의 보호 및 사용)\n\u2460 회사는 관련 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력하며, 개인정보의 보호 및 사용에 대해서는 관련 법령 및 회사의 개인정보처리방침에 따릅니다. 다만, 회사가 제공하는 서비스 이외의 링크된 서비스에서는 회사의 개인정보처리방침이 적용되지 않습니다.\n\u2461 서비스의 특성에 따라 회원의 개인정보와 관련이 없는 별명‧캐릭터 사진‧상태정보 등 자신을 소개하는 내용이 공개될 수 있습니다.\n\u2462 회사는 관계 법령에 의해 관련 국가기관 등의 요청이 있는 경우를 제외하고는 회원의 개인정보를 본인의 동의 없이 타인에게 제공하지 않습니다.\n\u2463 회사는 회원의 귀책사유로 유출된 회원의 개인정보 또는 계정정보 등으로 인해 발생한 피해에 대하여 책임을 지지 않습니다.\n \n제9조(회사의 의무)\n\u2460 회사는 관련법령 및 본 약관에서 정하는 권리의 행사 및 의무의 이행을 신의에 따라 성실하게 준수합니다.\n\u2461 회사는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보처리방침을 공시하고 준수합니다. 회사는 이 약관 및 개인정보처리방침에서 정한 경우를 제외하고는 회원의 개인정보가 제3자에게 공개 또는 제공되지 않도록 합니다\n\u2462 회사는 계속적이고 안정적인 서비스의 제공을 위한 개선작업 중 설비에 장애가 생기거나 데이터 등이 멸실ㆍ훼손된 때에는 천재지변, 비상사태, 현재의 기술로는 해결이 불가능한 장애나 결함 등 부득이한 사유가 없는 한 지체 없이 이를 수리 또는 복구하도록 최선의 노력을 다합니다.\n \n제10조(회원의 의무)\n\u2460 회원은 회사에서 제공하는 서비스의 이용과 관련하여 다음 각 호에 해당하는 행위 진행 시 회사 내부 규정에 따른 계정 조치를 실행할 수 있습니다.\n1. 이용신청 또는 회원정보 변경시 허위사실을 기재하거나, 타인의 정보를 사용하는 행위\n2. 회사가 제공하지 않는 서비스나 비정상적인 방법을 통해 게임 정보(ID, 캐릭터, 아이템, 게임머니 등)을 취득, 이용, 매매, 증여, 양도하거나 시도하는 것으로 의심되는 행위\n3. 회사의 직원이나 운영자를 가장하거나 타인의 명의를 도용하여 글을 게시하거나 메일을 발송하는 행위, 타인으로 가장하거나 타인과의 관계를 허위로 명시하는 행위\n4. 타인의 신용카드\u22c5유/무선 전화\u22c5은행 계좌 등을 도용하여 콘텐츠를 구매하는 행위, 다른 회원의 ID 및 비밀번호를 부정사용하는 행위\n5. 다른 회원의 개인정보를 무단으로 수집\u22c5저장\u22c5게시 또는 유포하는 행위\n6. 도박 등 사행행위를 하거나 유도하는 행위, 음란\u22c5저속한 정보를 교류\u22c5게재하거나 음란 사이트를 연결(링크)하는 행위, 수치심\u22c5혐오감 또는 공포심을 일으키는 말\u22c5소리\u22c5글\u22c5그림\u22c5사진 또는 영상을 타인에게 전송 또는 유포하는 행위 등 서비스를 불건전하게 이용하는 행위\n7. 서비스를 무단으로 영리, 영업, 광고, 홍보, 정치활동, 선거운동 등 본래의 용도 이외의 용도로 이용하는 행위\n8. 회사의 서비스를 이용하여 얻은 정보를 무단으로 복제, 유통, 조장하거나 상업적으로 이용하는 행위, 알려지거나 알려지지 않은 버그를 악용하여 서비스를 이용하는 행위\n9. 타인을 기망하여 이득을 취하는 행위, 회사의 서비스의 이용과 관련하여 타인에게 피해를 입히는 행위\n10. 회사나 타인의 지적재산권 또는 초상권을 침해하는 행위, 타인의 명예를 훼손하거나 손해를 가하는 행위\n11. 법령에 의하여 전송 또는 게시가 금지된 정보(컴퓨터 프로그램)나 컴퓨터 소프트웨어\u22c5하드웨어 또는 전기통신장비의 정상적인 작동을 방해\u22c5파괴할 목적으로 고안된 바이러스\u22c5컴퓨터 코드\u22c5파일\u22c5프로그램 등을 고의로 전송\u22c5게시\u22c5유포 또는 사용하는 행위\n12. 회사로부터 특별한 권리를 부여받지 않고 애플리케이션을 변경하거나, 애플리케이션에 다른 프로그램을 추가\u22c5삽입하거나, 서버를 해킹\u22c5역설계하거나, 소스 코드나 애플리케이션 데이터를 유출\u22c5변경하거나, 별도의 서버를 구축하거나, 웹사이트의 일부분을 임의로 변경\u22c5도용하여 회사를 사칭하는 행위\n13. 제11호내지 제12호에 해당되는 소프트웨어, 어플리케이션 등을 사용, 유포하거나 시도하는 행위\n14. 금전 등의 대가를 지불하고 타인에게 게임진행을 요청하는 등(대리 육성 등)의 행위\n15. 그 밖에 관련 법령에 위반되거나 선량한 풍속 기타 사회통념에 반하는 행위\n\u2461 회원의 계정 및 모바일 기기에 관한 관리 책임은 회원에게 있으며, 이를 타인이 이용하도록 하게 하여서는 안 됩니다. 모바일 기기의 관리 부실이나 타인에게 이용을 승낙함으로 인해 발생하는 손해에 대해서 회사는 책임을 지지 않습니다.\n\u2462 회원은 각 오픈마켓에서 부정한 결제가 이루어지지 아니하도록 결제 비밀번호 기능 등의 보안 수단을 설정하고 관리하여야 합니다. 회원의 부주의로 인하여 발생하는 손해에 대해 회사는 책임지지 않습니다.\n\u2463 회사는 다음 각 호의 행위의 구체적인 내용을 정할 수 있으며, 회원은 이를 따라야 합니다.\n1. 회원의 계정명, 캐릭터명, 길드명, 기타 게임 내에서 사용하는 명칭\n2. 채팅 내용과 방법\n3. 게시판 등 서비스 이용 방법\n4. 제휴서비스 정책 등 기타 필요한 사항";
                if (index == 1)
                    return
                        "\n\n제11조(서비스의 제공)\n\u2460 회사는 제5조의 규정에 따라 이용계약이 완료된 회원에게 그 즉시 서비스를 이용할 수 있도록 합니다. 다만, 일부 서비스의 경우 회사의 필요에 따라 지정된 일자부터 서비스를 개시할 수 있습니다.\n\u2461 회사는 회원에게 서비스를 제공함에 있어 본 약관에서 정하고 있는 서비스를 포함하여 기타 부가적인 서비스를 함께 제공할 수 있습니다.\n\u2462 회사는 회원의 등급을 구분하고 이용시간, 이용횟수, 제공서비스의 범위 등을 세분화하여 이용에 차등을 둘 수 있습니다.\n \n제12조(서비스 이용)\n\u2460 게임서비스는 회사의 영업방침에 따라 정해진 시간 동안 제공합니다. 회사는 서비스 제공시간을 게임서비스 내 또는 공지사항에 적절한 방법으로 안내합니다. 별도의 표시 또는 공지가 없는 경우는 24시간 제공을 기본으로 합니다.\n\u2461 제1항에도 불구하고 회사는 다음 각 호의 경우에는 서비스의 전부 또는 일부를 일시 정지할 수 있습니다. 이 경우 회사는 사전에 그 정지의 사유와 기간을 게임 애플리케이션 초기화면이나 게임서비스 내에 공지합니다. 다만, 사전에 공지할 수 없는 부득이한 사정이 있는 경우 사후에 공지할 수 있습니다.\n 1. 시스템 정기점검, 서버의 증설 및 교체, 네트워크의 불안정 등의 시스템 운영상 필요한 경우\n 2. 정전, 서비스 설비의 장애, 서비스 이용폭주, 기간통신사업자의 설비 보수 또는 점검 등으로 인하여 정상적인 서비스 제공이 불가능한 경우\n 3. 전시, 사변, 천재지변 또는 이에 준하는 국가비상사태 등 회사가 통제할 수 없는 상황이 발생한 경우\n\u2462 회사는 모바일 기기를 위한 전용 애플리케이션 또는 네트워크를 이용하여 서비스를 제공합니다. 회원은 애플리케이션을 다운로드하여 설치하거나 네트워크를 이용하여 무료 또는 유료로 서비스를 이용할 수 있습니다.\n\u2463 유료 콘텐츠의 경우에는 해당 서비스에 명시된 요금을 지급하여야 이용할 수 있습니다. 네트워크를 통해 애플리케이션을 다운로드하거나 서비스를 이용하는 경우에는 가입한 이동통신사에서 정한 별도의 요금이 발생할 수 있습니다.\n\u2464 다운로드하여 설치한 애플리케이션 또는 네트워크 서비스를 통해 이용하는 서비스의 경우 모바일 기기 또는 이동통신사의 특성에 맞도록 제공되며 모바일 기기의 변경, 번호 변경 또는 해외 로밍의 경우 게임서비스의 전부 또는 일부 기능 이용이 불가능할 수 있으며, 이 경우 회사는 책임을 지지 않습니다.\n\u2465 다운로드하여 설치한 애플리케이션 또는 네트워크를 통해 이용하는 서비스의 경우 에는 백그라운드 작업이 진행될 수 있습니다. 이 때, 모바일 기기 또는 이동통신사의 특성에 맞도록 추가요금이 발생할 수 있으며 이와 관련된 사항에 대해 회사는 책임을 지지 않습니다.\n\u2469 제1항에도 불구하고 관련 법령, 사업자단체 자율준수규약 등에서 특정 시간 또는 방법으로 서비스 제공을 금지하거나 제한하는 경우 서비스가 제공되지 않을 수 있으며, 이와 관련된 사항에 대해 회사는 책임을 지지 않습니다.\n \n제13조 (제휴 서비스)\n\u2460 제휴 서비스는 타 모바일 플랫폼(카카오 등)을 이용하는 다른 회원과 함께 이용할 수 있는 서비스입니다.\n\u2461 서비스 이용 전, 회원은 모바일 플랫폼의 개인 프로필을 포함하여 서비스 제공에 필요한 개인정보의 제공 및 이용에 동의하여야 합니다. 이에 동의하지 않으실 경우 서비스 이용에 제한이 있을 수 있습니다.\n\u2462 회사는 제휴 서비스를 통해 다수의 서비스를 제공할 수 있습니다. 여러 개의 서비스에 가입한 회원이 서비스 이용을 해지하고자 하는 경우 가입한 서비스 별로 해지(회원탈퇴)신청을 하여야 합니다.\n\u2463 제휴 서비스는 해당 서비스의 회원 정보를 이용하여 제공되는 서비스이므로, 회원이 각 제휴 서비스의 회원 자격을 상실하거나 탈퇴 시 정상적으로 서비스의 제공이 이루어지지 않을 수 있습니다.\n\u2464 설치된 애플리케이션을 삭제할 경우, 회원의 계정 정보가 삭제되는 경우가 있을 수 있으므로 사전에 확인 후 삭제하시기 바랍니다.\n \n제14조 (커뮤니티 서비스)\n\u2460 커뮤니티 서비스는 다수의 이용자가 자유롭게 의사를 교환하고 친목을 도모할 수 있도록 회사가 제공하는 게시판 등의 서비스를 말합니다.\n\u2461 회원은 제휴 서비스 계정을 연동하거나, 기타 회사에서 제공하는 방법 등을 통해 커뮤니티 서비스를 이용할 수 있습니다.\n\u2462 회원이 커뮤니티 서비스 이용 가입시, 원활한 서비스 운영을 위하여 회원의 정보가 운영진에게 공개될 수 있습니다.\n\u2463 커뮤니티 서비스가 제휴 서비스 와 연동되어 제공되는 경우에는, 회원이 각 제휴 서비스의 회원 자격을 상실하거나 탈퇴 시 정상적으로 커뮤니티 서비스의 제공이 이루어지지 않을 수 있습니다.\n\u2464 회사는 회원의 권익 보호와 건전한 커뮤니티 서비스 제공을 위하여 필요한 사항을 운영정책 내 포함하거나 별도의 정책으로 정할 수 있으며, 회원은 이를 준수할 의무가 있습니다. 회사는 운영정책 또는 별도 정책의 내용을 회원이 알 수 있도록 서비스 또는 커뮤니티 서비스 내 게시하거나 연결화면을 제공하는 방법으로 회원에게 공지합니다.\n \n제15조(서비스의 변경 및 중지)\n\u2460 회사는 원활한 서비스 제공을 위한 운영상 또는 기술상의 필요에 따라 서비스를 변경할 수 있으며, 변경 전에 해당 내용을 서비스 내에 공지합니다. 다만, 버그\u2219오류 등의 수정이나 긴급업데이트 등 부득이하게 변경할 필요가 있는 경우 또는 중대한 변경에 해당하지 않는 경우에는 사후에 공지할 수 있습니다.\n\u2461 회사는 영업양도, 분할ㆍ합병 등에 따른 영업의 폐지, 게임제공계약의 만료, 서비스의 현저한 수익 악화 등 경영상 중대한 사유로 인해 서비스를 지속하기 어려운 경우에는 서비스 전부를 중단할 수 있습니다. 이 경우 중단일자 30일 이전까지 중단일자ㆍ중단사유ㆍ보상조건 등을 게임서비스 초기화면 또는 그 연결화면을 통해 공지하고 제28조 제1항의 방법으로 회원에게 통지합니다.\n\n제16조(정보의 수집 등)\n\u2460 회사는 회원간에 이루어지는 채팅 등(서비스내에서 이용자간 진행되는 쪽지, 귓속말 등과 같은 통신내용을 포함합니다)의 내용을 저장ㆍ보관할 수 있으며 이 정보는 회사만이 보유합니다. 회사는 회원간의 분쟁 조정, 민원 처리 또는 게임 질서의 유지를 위한 경우에 한하여, 제3자는 법령에 따라 권한이 부여된 경우에 한하여 이 정보를 열람할 수 있습니다.\n\u2461 회사 또는 제3자가 제1항에 따라 채팅 등의 정보를 열람할 경우 회사는 사전에 열람의 사유 및 범위를 해당 회원에게 고지합니다. 다만, 제10조 제1항에 따른 금지행위의 조사ㆍ처리ㆍ확인 또는 그 행위로 인한 피해 구제와 관련하여 이 정보를 열람해야 할 경우에는 사후에 고지할 수 있습니다.\n\u2462 회사는 서비스의 원활하고 안정적인 운영 및 품질 개선을 위하여 회원의 개인정보를 제외한 회원의 모바일 기기 정보(설정, 사양, 운영체제 버전, 가입 통신사 정보 등)를 수집 ‧ 활용할 수 있습니다.\n\u2463 회사는 서비스 개선 및 회원 대상 서비스 소개 등을 위한 목적으로 회원에게 추가정보를 요청할 수 있습니다. 이 요청에 대해 회원은 승낙하거나 거절할 수 있으며, 회사가 이 요청을 할 경우에는 회원이 이 요청을 거절할 수 있다는 뜻을 함께 고지합니다.\n \n제17조(광고의 제공)\n\u2460 회사는 서비스의 운영과 관련하여 서비스 내에 광고를 게재할 수 있습니다. 또한 수신에 동의한 회원에 한하여 전자우편, 문자서비스(LMS/SMS), 푸시메시지(Push Notification) 등의 방법으로 광고성 정보를 전송할 수 있습니다. 이 경우 회원은 언제든지 수신을 거절할 수 있으며, 회사는 회원의 수신 거절 시 광고성 정보를 발송하지 아니합니다.\n\u2461 회사가 제공하는 서비스 내의 배너 또는 링크 등을 통해 타인이 제공하는 광고나 서비스에 연결될 수 있습니다.\n\u2462 제2항에 따라 타인이 제공하는 광고나 서비스에 연결될 경우 해당 영역에서 제공하는 서비스는 회사의 서비스 영역이 아니므로 회사가 신뢰성, 안정성 등을 보장하지 않으며, 그로 인한 회원의 손해에 대하여도 회사는 책임을 지지 않습니다. 다만, 회사가 고의 또는 중과실로 손해의 발생을 용이하게 하거나 손해 방지를 위한 조치를 취하지 아니한 경우에는 그러하지 아니합니다.\n \n제18조(저작권)\n\u2460 회사가 제작한 서비스 내 모든 콘텐츠에 대한 저작권과 기타 지적재산권은 회사에 귀속합니다.\n\u2461 회원은 회사가 제공하는 서비스를 이용하여 얻은 정보 중에서 회사 또는 제공업체에 지적재산권이 귀속된 정보를 회사 또는 제공업체의 사전동의 없이 복제\u22c5전송 등의 방법(편집, 공표, 공연, 배포, 방송, 2차적 저작물 작성 등을 포함합니다. 이하 같습니다)에 의하여 영리목적으로 이용하거나 타인에게 이용하게 하여서는 안 됩니다.\n\u2462 회원은 서비스 내 콘텐츠(캐릭터, 이미지, 음원 등의 직접적인 내용과 서비스 관련정보와 같은 간접적인 내용을 포함합니다.)와 관련되어 회원 또는 다른 이용자가 서비스를 통하여 업로드 또는 전송하는 대화 텍스트를 포함한 커뮤니케이션, 이미지, 사운드 및 모든 자료 및 정보(이하 \"이용자 콘텐츠\"라 합니다)에 대하여 회사가 다음과 같은 방법과 조건으로 이용하는 것을 허락합니다.\n1. 해당 이용자 콘텐츠를 이용, 편집 형식의 변경 및 기타 변형하는 것(공표, 복제, 공연, 전송, 배포, 방송, 2차적 저작물 작성 등 어떠한 형태로든 이용 가능하며, 이용기간과 지역에는 제한이 없음)\n2. 이용자 콘텐츠를 제작한 이용자의 사전 동의 없이 거래를 목적으로 이용자 콘텐츠를 판매, 대여, 양도 행위를 하지 않음\n\u2463 서비스 내에서 표현되지 않는 내용이거나, 서비스와 관련성 없는 이용자 콘텐츠(일반 게시판 등에서의 게시글 등 실질적으로 게임내 콘텐츠와 연관성이 없는 게시물을 말합니다.)에 대하여 회사는 회원의 명시적인 동의 없이 이용하지 않으며, 회원은 언제든지 이러한 이용자 콘텐츠를 삭제할 수 있으며, 저작물에 대한 권리와 책임은 회원본인에게 있습니다.\n\u2464 회사는 회원이 게시하거나 등록하는 서비스내의 게시물에 대해 제10조 제1항에 따른 금지행위에 해당된다고 판단되는 경우에는 사전통지 없이 이를 삭제 또는 이동하거나 그 등록을 거절할 수 있습니다.\n\u2465 회사가 운영하는 게시판 등에 게시된 정보로 인하여 법률상 이익이 침해된 회원은 회사에 해당 정보의 삭제 또는 반박 내용의 게재를 요청할 수 있습니다. 이 경우 회사는 신속하게 필요한 조치를 취하고, 이를 신청인에게 통지합니다.\n\u2466 이 조는 회사가 서비스를 운영하는 동안 유효하며 회원탈퇴 후에도 지속적으로 적용됩니다.\n \n제19조(콘텐츠의 이용)\n\u2460 서비스 내에서 유료 결제를 통해 지급된 콘텐츠는 회원의 계정 정보에 귀속되어 해당 계정으로 로그인한 모바일 기기에서 사용할 수 있습니다. 다만, 임시 회원의 경우 애플리케이션을 다운로드 받거나 설치한 디바이스에서만 이용할 수 있습니다.\n\u2461 유료 결제를 통해 제공된 콘텐츠의 사용기간은 구매 시 별도로 명시된 경우 해당 사용기간을 따릅니다. 다만, 제15조 제2항에 따라 서비스 중단이 이루어지는 경우 기간의 정함이 없는 콘텐츠의 사용 기간은 서비스 중단 공지 시 공지된 서비스의 중단일까지 합니다.\n\u2462 서비스 내 다른 콘텐츠로의 교환이나, 콘텐츠 이용 시 소모되는 콘텐츠(이하 ‘게임 재화’ 라 합니다.)의 경우 유료 결제를 통해 제공되거나, 서비스 이용에 따라 무상으로 제공될 수 있습니다. 게임 재화는 사용시 유료 결제를 통해 제공된 것이 우선적으로 사용됩니다. 다만, 서비스에서 별도의 사용 우선순위를 지정한 경우에는 그러하지 아니합니다.\n \n제20조(서비스 이용제한)\n\u2460 회원은 제10조에 따른 회원의 의무를 위반하는 행위를 하여서는 안 되며, 해당 행위를 하는 경우에 회사는 다음 각 호의 구분에 따른 회원의 서비스 이용제한, 관련 정보(글, 사진, 영상 등) 삭제 및 기타의 조치를 포함한 이용제한 조치를 할 수 있습니다. 이용제한 조치가 이루어지는 회원의 구체적 의무위반 사유 및 절차는 제21조 제1항에 따라 개별 게임의 운영정책에서 정합니다.\n1. 일부 권한 제한: 일정기간 채팅제한, 게임정보 초기화 등 일정 권한을 제한\n2. 캐릭터 이용 제한: 일정기간 또는 영구히 회원 캐릭터의 이용을 제한\n3. 계정 이용 제한: 일정기간 또는 영구히 회원 계정의 이용을 제한\n4. 회원 이용 제한: 일정기간 또는 영구히 회원의 게임서비스 이용을 제한\n\u2461 제1항의 이용제한이 정당한 경우에 회사는 이용제한으로 인하여 회원이 입은 손해를 배상하지 않습니다.\n\u2462 회사는 다음 각 호에 해당하는 문제에 대한 조사가 완료될 때까지 해당 계정의 서비스 이용을 정지할 수 있습니다.\n1. 계정이 해킹 또는 도용 당했다는 정당한 신고가 접수된 경우\n2. 불법프로그램 사용자, 작업장 등 위법행위자로 의심되는 경우\n3. 반복되는 환불, 상품 미지급건 문제로 결제 어뷰징이 의심되는 경우\n4. 그 밖에 위 각호에 준하는 사유로 서비스 이용의 잠정조치가 필요한 경우\n\u2463 제3항의 조사가 완료된 후, 유료 결제를 통해 제공된 콘텐츠의 경우 정지된 시간만큼 회원의 이용시간을 연장하거나 그에 상당한 콘텐츠 등으로 보상합니다. 다만, 회원이 제3항 각 호의 사유에 해당하는 경우에는 그러하지 아니합니다.\n \n제21조(이용제한 및 이의제기에 대한 사유 및 절차)\n\u2460 회사는 제20조 제1항에 따른 이용제한 조치가 이루어지는 구체적인 사유 및 절차를 위반행위 내용, 정도, 횟수, 결과 등 제반사정을 고려하여 운영정책으로 정합니다.\n\u2461 회사가 제20조 제1항에 따른 이용제한 조치를 하는 경우에는 다음 각 호의 사항을 회원에게 사전 통지하고 서비스 내에 공지합니다. 다만, 부득이한 경우에는 사후에 통지할 수 있습니다.\n1. 이용제한 사유\n2. 이용제한 유형 및 기간\n3. 이용제한에 대한 이의신청 방법\n\u2462 회원이 회사의 이용제한 조치에 불복하고자 할 때에는 통보가 있은 날로부터 15일 이내에 회사의 이용제한에 불복하는 이유를 기재한 이의신청서를 서면, 전자문서 등의 방법으로 회사에 제출하여야 합니다.\n\u2463 회사는 제3항에 따른 이의신청을 접수한 날로부터 15일 이내에 회원의 불복 이유에 대하여 서면 또는 전자문서 등의 방법으로 답변하고, 그에 따른 조치를 취합니다. 다만, 회사는 15일 이내에 답변이 곤란한 경우 회원에게 그 사유와 처리일정을 통보합니다.";
                if (index == 2)
                    return
                        "\n\n제22조 (대금결제)\n\u2460 콘텐츠에 대한 구매 대금의 부과와 납부는 원칙적으로 이동통신사나 오픈마켓 사업자 등에서 정하는 정책이나 방법에 따릅니다. 또한 각 결제수단별 한도는 회사, 오픈마켓 사업자, 결제업체가 정하는 정책 또는 정부의 방침에 따라 부여되거나 조정될 수 있습니다.\n\u2461 콘텐츠의 구매대금을 외화로 결제하는 경우에는 환율‧수수료 등으로 인하여 실제 청구금액이 서비스의 상점 등에서 표시된 가격과 달라질 수 있습니다.\n \n제23조(청약철회)\n\u2460 회사와 콘텐츠의 구매에 관한 계약을 체결한 회원은 구매계약일과 콘텐츠 이용 가능일 중 늦은 날부터 7일 이내에 별도의 수수료‧위약금 등의 부담 없이 청약철회를 할 수 있습니다.\n\u2461 회원은 다음 각 호에 해당하는 경우에는 회사의 의사에 반하여 제1항에 따른 청약철회를 할 수 없습니다. 다만, 가분적 콘텐츠로 구성된 구매계약의 경우에는 가분적 콘텐츠 중 다음 각 호에 해당하지 아니하는 나머지 부분에 대하여는 그러하지 아니합니다.\n 1. 구매 즉시 사용되거나 적용되는 콘텐츠\n 2. 추가혜택이 제공되는 경우에 그 추가 혜택이 사용된 콘텐츠\n 3. 개봉 행위를 사용으로 볼 수 있거나 개봉 시 효용이 결정되는 콘텐츠의 개봉 행위가 있는 경우\n\u2462 회사는 제2항 각 호의 규정에 따라 청약철회가 불가능한 콘텐츠의 경우에는 그 사실을 회원이 쉽게 알 수 있는 곳에 명확하게 표시하고, 해당 콘텐츠의 시험사용 상품을 제공(한시적 이용의 허용, 체험용 제공 등)하거나 이에 대한 제공이 곤란한 경우에는 콘텐츠에 관한 정보를 제공함으로써 회원의 청약철회의 권리행사가 방해되지 아니하도록 조치합니다. 만약 회사가 이러한 조치를 하지 아니한 경우에는 제2항 각 호의 청약철회 제한사유에도 불구하고 회원은 청약철회를 할 수 있습니다.\n\u2463 제1항과 제2항에도 불구하고 회원이 구매한 유료 콘텐츠의 내용이 표시ㆍ광고의 내용과 다르거나 계약내용과 다르게 이행된 경우에 회원은 해당 콘텐츠의 구매일 또는 이용가능일부터 3개월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 청약철회를 할 수 있습니다.\n\u2464 회원이 청약철회를 할 경우 회사는 오픈마켓 사업자를 통해 구매내역을 확인할 수 있습니다. 또한 회사는 회원의 정당한 철회 사유를 확인하기 위해 회원에게서 제공받은 정보를 통해 회원에게 연락할 수 있으며, 추가적인 증빙을 요구할 수 있습니다.\n\u2465 제1항부터 제4항까지의 규정에 따라 청약철회가 이루어질 경우 회사는 지체 없이 회원의 유료 콘텐츠를 회수하고 3영업일 이내에 대금을 환급합니다. 이 경우 회사가 환급을 지연한 때에는 그 지연기간에 대하여 「전자상거래 등에서의 소비자보호에 관한 법률」 및 같은 법 시행령 제21조의3에서 정하는 이율을 곱하여 산정한 지연이자를 지급합니다.\n\u2466 미성년자가 모바일 기기에서 콘텐츠 구매계약을 체결하는 경우, 회사는 법정대리인의 동의가 없으면 미성년자 본인 또는 법정대리인이 그 계약을 취소할 수 있다는 내용을 고지하며, 미성년자가 법정대리인의 동의 없이 구매계약을 체결한 때에는 미성년자 본인 또는 법정대리인은 회사에 그 계약을 취소할 수 있습니다. 다만, 미성년자가 법정대리인이 범위를 정하여 처분을 허락한 재산으로 콘텐츠를 구매한 경우 또는 미성년자가 속임수로써 자기를 성년자로 믿게 하거나 법정대리인의 동의가 있는 것으로 믿게 한 경우에는 취소할 수 없습니다.\n\u2467 콘텐츠 구매계약의 당사자가 미성년자인지 여부는 결제가 진행된 모바일 기기, 결제 실행자 정보, 결제 수단 명의자 등을 근거로 판단합니다. 또한 회사는 정당한 취소인지를 확인하기 위해 미성년자 및 법정대리인임을 증명할 수 있는 서류의 제출을 요청할 수 있습니다.\n \n제24조(과오납금의 환급)\n\u2460 회사는 과오납금이 발생하는 경우 과오납금을 회원에게 환급합니다. 다만, 과오납금이 회사의 고의 또는 과실 없이 회원의 과실로 인하여 발생한 경우에는 그 환급에 소요되는 실제 비용은 회원이 부담합니다.\n\u2461 유료 결제는 오픈마켓사업자가 제공하는 결제방식에 따르며, 결제 과정에서 과오금이 발생하는 경우 회사 또는 오픈마켓사업자에게 환급을 요청하여야 합니다. 다만, 오픈마켓 사업자의 정책, 시스템에 따라 회사가 오픈마켓 사업자에게 필요한 환급 절차의 이행을 요청할 수도 있습니다.\n\u2462 애플리케이션의 다운로드 또는 네트워크 서비스의 이용으로 인해 발생한 통신요금(통화료, 데이터 통화료 등)은 환급 대상에서 제외될 수 있습니다.\n\u2463 환급은 서비스를 이용하고 있는 모바일 기기의 운영체제 종류에 따라 오픈마켓사업자 또는 회사의 환급정책에 따라 진행됩니다.\n\u2464 회원이 유료 결제를 통하지 않고 서비스 이용중 무상으로 취득하거나, 회사가 내부 혹은 외부 제휴 이벤트 등을 통하여 무상으로 제공한 콘텐츠는 환급대상에 제외됩니다.\n\u2465 회사는 과오납금의 환급을 처리하기 위해 회원에게서 제공받은 정보를 통해 회원에게 연락할 수 있으며, 필요한 정보의 제공을 요청할 수 있습니다.\n \n제25조(계약해지)\n\u2460 회원이 이용 계약을 해지하고자 하는 때에는 회원 본인이 서비스 내 메뉴를 이용 하거나 고객센터를 통해 회원 탈퇴 신청을 할 수 있으며, 탈퇴 완료 시 회원의 게임 정보(점수, 캐릭터, 아이템, 게임머니 등)는 모두 삭제되어 복구가 불가능합니다. 애플리케이션의 삭제 또는 제휴 서비스와의 연동 해지 등은 이용계약의 해지로 인정되지 않습니다\n\u2461 회사는 회원이 이 약관 및 그에 따른 운영정책 등 에서 금지하는 행위를 하는 등 본 계약을 유지할 수 없는 중대한 사유가 발생한 경우 상당한 기간 전에 최고하고, 기간을 정하여 서비스 이용을 중지하거나 이용계약을 해지할 수 있습니다.\n\u2462 제1항 및 제2항에 따른 환급 및 손해배상은 「콘텐츠이용자보호지침」에 따라 처리합니다.\n\u2463 회사는 최근의 서비스 이용일부터 연속하여 1년 동안 회사의 서비스를 이용하지 않은 회원(이하 “휴면계정”이라 합니다)의 개인정보를 보호하기 위해 이용계약을 해지하고 회원의 개인정보 파기 등의 조치를 취할 수 있습니다. 이 경우 조치일 30일 전까지 계약해지, 개인정보 파기 등의 조치가 취해진다는 사실 및 파기될 개인정보 등을 회원에게 통지합니다.\n \n제26조(손해배상)\n\u2460 회사 또는 회원은 본 약관을 위반하여 상대방에게 손해를 입힌 경우에는 그 손해를 배상할 책임이 있습니다. 다만, 고의 또는 과실이 없는 경우에는 그러하지 아니합니다\n\u2461 회사가 개별서비스 제공자와 제휴 계약을 맺고 회원에게 개별서비스를 제공함에 있어 회원이 개별서비스 이용약관에 동의를 한 뒤 개별서비스 제공자의 귀책 사유로 인해 손해가 발생할 경우 관련 손해에 대해서는 개별서비스 제공자가 책임을 집니다.\n \n제27조(회사의 면책)\n\u2460 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관하여 책임을 지지 않습니다.\n\u2461 회사는 서비스용 설비의 보수, 교체, 정기점검, 공사 등 기타 이에 준하는 사유로 발생한 손해에 대하여 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.\n\u2462 회사는 회원의 고의 또는 과실로 인한 서비스 이용의 장애에 대하여는 책임을 지지 않습니다. 다만, 회원에게 부득이하거나 정당한 사유가 있는 경우에는 그러하지 아니합니다.\n\u2463 회원이 서비스와 관련하여 게재한 정보나 자료 등의 신뢰상, 정확성 등에 대하여 회사는 고의 또는 중대한 과실이 없는 한 책임을 지지 않습니다.\n\u2464 회사는 회원이 다른 회원또는 타인과 서비스를 매개로 발생한 거래나 분쟁에 대해 개입할 의무가 없으며, 이로 인한 손해에 대해 책임을 지지 않습니다.\n\u2465 회사는 무료로 제공되는 서비스 이용과 관련하여 회원에게 발생한 손해에 대해서는 책임을 지지 않습니다. 다만, 회사의 고의 또는 중과실에 의한 경우에는 그러하지 아니합니다.\n\u2466 회사는 회원이 서비스를 이용하여 기대하는 이익을 얻지 못하거나 상실한 것에 대하여 책임을 지지 않습니다.\n\u2467 회사는 회원의 게임정보 (경험치, 등급, 아이템, 게임머니 등)의 손실에 대하여 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.\n\u2468 회원은 모바일 기기의 비밀번호 설정 기능, 오픈마켓이 제공하는 비밀번호 설정 기능 등을 관리하지 않아 발생하는 제3자 결제에 대해 책임지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.\n\u2469 모바일 기기의 변경, 휴대전화번호 변경, 운영체제(OS)의 업그레이드 및 변경, 해외 로밍, 통신사 변경 등으로 인해 콘텐츠의 전부 또는 일부 기능을 이용할 수 없는 경우 회사는 이에 대해 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.\n\u246a 회원이 회사에서 제공하는 콘텐츠 또는 계정정보를 삭제한 경우 회사는 이에 대해 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.\n\u246b 회사는 임시회원이 서비스 이용으로 발생한 손해에 대해서는 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.\n \n제28조 (회원에 대한 통지)\n\u2460 회사가 회원에게 통지를 하는 경우 회원의 전자우편주소, 전자메모, 서비스 내 쪽지, LMS/SMS 등으로 할 수 있습니다.\n\u2461 회사는 회원 전체에게 통지를 하는 경우 7일 이상 게임서비스 내 게시하거나 팝업화면 등을 제시함으로써 제1항의 통지에 갈음할 수 있습니다.\n \n제29조 재판권 및 준거법\n\u2460 이 약관은 대한민국 법률에 따라 규율되고 해석됩니다. 회사와 회원 간에 발생한 분쟁으로 소송이 제기되는 경우에는 법령에 정한 절차에 따른 법원을 관할 법원으로 합니다.\n \n제30조 (회원의 고충처리 및 분쟁해결)\n\u2460 회사는 회원의 편의를 고려하여 회원의 의견이나 불만을 제시하는 방법을 게임서비스 내 또는 그 연결화면에 안내합니다. 회사는 이러한 회원의 의견이나 불만을 처리하기 위한 전담인력을 운영합니다.\n\u2461 회사는 회원으로부터 제기되는 의견이나 불만이 정당하다고 객관적으로 인정될 경우에는 합리적인 기간 내에 이를 신속하게 처리합니다. 다만, 처리에 장기간이 소요되는 경우에는 회원에게 장기간이 소요되는 사유와 처리일정을 게임서비스 내 공지하거나 제28조 제1항에 따라 통지합니다.\n\u2462 회사와 회원 간에 분쟁이 발생하여 제3의 분쟁조정기관이 조정할 경우 회사는 이용제한 등 회원에게 조치한 사항을 성실히 증명하고, 조정기관의 조정에 따를 수 있습니다.\n";
                break;

            case Language.JP:
                if (index == 0)
                    return
                        "CookAppsモバイルサービスの利用規約\n(広告情報の受信同意も含む)\n \n\n第1条(目的)\nこの規約は、CookApps(株)(以後「企業」とします)が、モバイル機器により提供する全てのゲームサービス及びこれらに関連したネットワーク、ウェブサイト、その他サービス(以後「サービス」とします)の利用に関する企業と会員の権利や義務、責任項目、その他必要な項目を規定することを目的とします。\n \n第2条(用語の定義)\n\u2460本規約で使用される用語の定義は以下となります。\n1.「会員」とは、この規約に基づき利用契約に同意し、企業から提供されるサービスを利用する者を示します。\n2.「臨時会員」とは、アカウント情報を外部のアカウントと連携もしくは未認証やゲストとしてログインし、サービスを利用する会員のことを示します。\n3.「モバイル機器」とは、ネットワークを通じてコンテンツをダウンロードやアクセス可能な機器であり、携帯電話、スマートフォン、携帯情報端末機種(PDA)、タブレットPCなどを示します。\n4.「アカウント情報」とは、会員の会員番号や外部アカウントの情報、機種情報、ニックネーム、プロフィール写真、フレンドリストなど、会員が企業に提供した情報やゲーム利用情報(キャラクター情報、アイテム、レベルなど)、利用料金の決済情報などを示します。\n5.「コンテンツ」とは、モバイル機器で利用できるよう、企業がサービス提供と関連してデジタル式に製作した、有料又は無料のもの全て(ゲーム及びネットワークサービス、アプリケーション、ゲームの貨幣、ゲームアイテムなど)を示します。\n6.「有料決済」とは、サービス内で提供されるコンテンツなどを購入又は利用するために、会社が指定した決済企業を利用して決済することを示します。\n7.「オープンマーケット」とは、モバイル機器にアプリケーションをインストールして有料決済ができるように構築された、電子商取引の環境を示します。\n8.「連携サービス」とは、企業がKAKAOやその他のモバイルプラットフォームサービスとの連携によって提供するサービスのことを示します。また連携したモバイルプラットフォームへの加入情報及びプロフィール写真などを利用して、モバイル機器でサービスを利用できるよう提供する個別もしくは関連した全てのサービスを示します。\n9.「決済企業」とは、クレジットカードや携帯決済など、オープンマーケットで使用可能な電子上での決済手段を提供する企業のことを示します。\n10.「アプリケーション」とは、企業が提供するサービスを利用するために、モバイル機器にダウンロード又はインストールして使用するプログラムのことを示します。\n11.「ゲームサービス」とは、企業が提供するサービスの一つとして、会員がモバイル機器でプレイするゲーム及びこれらに関するサービスを示します。\n\u2461この規約で使用される用語の定義は、この第1項で定めたもの以外は、関係法令及び各サービスの政策によって定められたものに基づくものとし、これらに定められてないものに関しては一般の電子商取引に基づきます。\n \n第3条(企業の情報などの提供)\n企業は、各項目の内容を会員が確認できるよう、ゲームサービス内に表示します。ただしプライバシーポリシーと規約は、会員が関連画面を通じて確認可能です。\n1.企業及び代表取締役の氏名\n2.企業の所在地(会員からの問い合わせに対応できる所在地を含みます)\n3.連絡先(電話番号・電子メール)\n4.事業者登録番号\n5.通信販売業申告番号\n6.プライバシーポリシー\n7.サービス利用規約\n \n第4条(規約の効力及び変更)\n\u2460企業は、この規約の内容を会員が確認できるよう、ゲームサービス内又は関連画面に掲示します。この場合、本規約の内容のうちサービスの中止、契約申し込みの撤回、返金、契約の解除、企業の免責事項などのように重要な項目に関しては、太字、色塗り、特殊記号などにより明確に表示するか、もしくは別途の画面に表示できるようにして、会員が簡単に確認できるようにします。\n\u2461企業が規約を改定する場合には、規約が適用される日付及び改定内容、改定理由などを明確に示します。また最低7日前から、ゲームサービス内及び関連画面に掲示することで、会員に告知します。ただし変更される内容が、会員にとって不利ものであった場合や重大な項目の変更であった場合、30日前から同一の方法によって告知し、第28条第1項の方法によって会員に通知します。その場合は、改定前の内容と改定後の内容を明確に比較し、会員に分かりやすく表示します。\n\u2462企業が規約を改定する場合、改定規約を告知後に、改定規約の適用に関する会員の同意を確認します。企業は、第2項の告知又は通知をする場合に、会員が改定規約に関して同意もしくは拒否を表明しない限り、同意したものとみなすという内容も含めて告知又は通知し、会員が該当規約の施行日までに拒否を表明しなかった場合、改定規約に同意したものとみなします。会員が改定規約に同意しない場合、企業もしくは会員は、サービスの利用契約を解除することができます。\n\u2463企業は、会員が企業やこの規約の内容に関して質疑・応答ができるように対処します。\n\u2464企業は、「電子商取引などでの消費者保護に関する法律」、「規約の規制に関する法律」、「ゲーム産業振興に関する法律」、「情報通信網利用促進及び情報保護などに関する法律」、「コンテンツ作業振興法」などにの関連法令に反しない範囲で、本規約を改定することができます。\n \n第5条(利用契約の締結及び適用)\n\u2460利用契約は、会員になる者(以後「加入申請者」といいます)が本規約の内容に同意して以下のサービスの利用を申請し、企業がそれに承諾することで締結されます｡\n\u2461企業は､加入申請者の申請を、承認することを原則とします｡ただし企業は､以下の項目に一つでも該当する利用申請に関しては､承認を拒否することができます｡\n1.利用申請書の内容を偽造、もしくは利用申請の条件を満たしていない場合\n2.企業がサービスを提供しない､もしくは提供すると定めていない国家で、正常ではないか迂回する方法により利用を申請した場合\n3.｢ゲーム産業振興に関する法律｣など､現法令により禁止されている行為が目的で利用を申請した場合\n4.社会の安寧や秩序又は公序良俗に反する目的、もしくは企業の利益に害をなす目的で申請した場合\n5.不正な目的でサービスを利用しようとした場合\n6.営利目的でサービスを利用しようとした場合\n7.企業がサービスの利用を制限したモバイル機器やプログラムなどを使用して、利用を申請した場合\n8.その他、項目に準ずる理由として承認するには不適切だと判断された場合\n\u2462企業は、以下の項目に一つでも該当する場合、その項目が解消されるまで承認を保留することができます。\n1.企業の設備に余裕がない、又は特定のモバイル機器のサポートが難しい、または技術的に障害がある場合\n2.サービスもしくは決済手段の障害など、技術的な支障がある場合\n3.その他、各項目に準ずる理由として、利用の申請における承認が難しいと判断された場合\n\u2463企業は、会員が規約同意の手続き、もしくはサービス利用に必要な情報の入力を完了時に、承認を保留するか拒否する意思を明確にしない限り、即時にサービスを利用できるようにします。ただし後日に第2項に基づく項目が確認された場合、本規約の定めに従って利用制限や契約の解除を行うことができます。\n\u2464企業は利用者の便宜のために、ゲームサービスにおいて、臨時会員の機能を提供することができます。臨時会員の機能を利用するにあたり、以下の項目に該当する場合に、アカウント情報の削除や記録が確認できない問題が発生する場合があり、臨時会員の機能によって利用していたゲームサービスのアカウント情報は、以後連携もしくは移転が不可となる場合があります。この場合、企業はアカウント情報の復旧を保証せず、これに関する報酬及び損害賠償の責任を負いません。ただし、企業の故意又は重過失による場合は対象外とします。\n1.モバイル機器を変更した場合\n2.モバイル機器を改造もしくは初期化した場合\n3.モバイル機器から、アプリケーションなど、コンテンツの全てもしくは一部を削除した場合\n \n第6条(規約外の準則)\n本規約で定めらていない項目と本規定の解釈に関しては、「電子商取引などでの消費者保護に関する法律」、「規約の規制に関する法律」、「ゲーム産業振興に関する法律」、「情報通信網利用促進及び情報保護などに関する法律」、「コンテンツ作業振興法」などに関する法令もしくは電子商取引の慣例に従います。\n \n第7条(運営政策)\n\u2460規約を適用するために必要な項目や規約によって具体的範囲を指定し、委任した項目をゲームサービスの運営政策(以後「運営政策」といいます)によって決定することができます。\n\u2461企業は運営政策の内容を会員が確認できるよう、ゲームサービス内又は関連画面に掲示します。\n\u2462運営政策を改定する場合、第4条第2項に基づきます。ただし改定内容が以下の項目に一つでも該当する場合、第2項に基づき事前に告知します。\n 1.規約により、具体的に範囲を決定して委任した項目を改定する場合\n 2.会員の権利魏有無と関係のない項目を改定する場合\n 3.運営政策の内容が、規約により定められた内容と根本的に変わらず、会員が予測可能な範囲内で運営政策を改定する場合\n \n第8条(個人情報の保護及び使用)\n\u2460企業は関連法令の規定に基づき、会員の個人情報を保護するために努力し、個人情報の保護及び仕様に関しては、関連の法令及び企業のプライバシーポリシーに基づきます。ただし企業が提供するサービス以外の関連したサービスでは、企業のプライバシーポリシーが適用されません。\n\u2461サービスの特性に基づき、会員の個人情報とは関係のない範囲で、ニックネーム・キャラクターの画像・状態の情報など、自身と関連した内容が公開されることがあります。\n\u2462企業は、関係法令に基づく関連国家機関からの要請があった場合を除き、会員の個人情報を、本人の同意なしで他人に提供しません。\n\u2463企業は、企業の帰責事由により流出した会員の個人情報、もしくはアカウント情報などにより発生した被害について責任を負いません。\n \n第9条(企業の義務)\n\u2460企業は、関連法令及び本規約で定められた権利の行使や義務の履行を、誠実に遵守します。\n\u2461企業は会員が安全にサービスを利用できるよう、個人情報(信用情報を含む)保護のためにセキュリティシステムを整え、プライバシーポリシーを告知して遵守します。企業は、この規約及びプライバシーポリシーに基づいた場合を除き、会員の個人情報が第三者に公開又は提供されないようにします。\n\u2462企業は、持続的に安定してサービスを提供するための改善作業において、設備に障害が発生したり、データの損害・消失したりした場合、天地災害、非常事態、現在の技術では解決不可能な障害や欠陥などやむを得ない理由でない限り、余儀なくこれらを修理もしくは復旧するよう最善の努力を尽くすことにします。\n \n第10条(会員の義務)\n\u2460会員は、企業がら提供されるサービスの利用に関して、以下の項目に該当する行為を成す場合、企業の規定に基づいたアカウントの措置を取ることができます。\n1.利用申請又は会員情報の変更の際に、偽造内容の記載もしくは他人の情報を使用する行為\n2.企業が提供しないサービスや正常ではない方法により、ゲームの情報(ID、キャラクター、アイテム、ゲームマネーなど)を取得・利用・売買・贈与・譲渡もしくはそれらを試みると思しき行為\n3.企業の職員や運営を偽装し、他人の名義で情報を提示もしくはメールを送る行為、他人に偽造し、他人との関係を虚偽して提示する行為\n4.他人のクレジットカードや連絡先(電話番号)、銀行口座などを盗用してコンテンツを購入する行為、他の会員のIDやパスワードを不正利用する行為\n5.他の会員の個人情報を、無断で収集・保存・掲示もしくは配布する行為\n6.賭博など射幸心を煽ったり、もしくは誘導する行為、不適切な成人向けの情報の交換・掲示、又は成人向けのウェブサイトのURLの貼り付けなど、羞恥心・嫌悪感又は恐怖心を与える言葉・音声・テキスト・画像・写真もしくは映像を、他人に送信又は配布する行為など、サービスを不健全に利用する行為\n7.サービスを無断で、営利、営業、広告、宣伝、政治的活動、選挙の活動など、本来の目的以外の目的で利用する行為\n8.企業のサービスを利用することで得た情報を、無断で複写、流通、扇動もしくは商業的に利用する行為、あるいは告知されている、されていないに関わらず、不具合を悪用してサービスを利用する行為\n9.他人を欺いて利益を得る行為、企業のサービス利用と関連して他人に被害を与える行為\n10.企業や他人の知的財産権もしくは肖像権を侵害する行為、他人の名誉を棄損又は損害を与えるような行為\n11.法令に基づき、転送もしくは掲示が禁止された情報(コンピュータープログラム)やコンピューターのソフトウェア・ハードウェアまたは電気通信装備の正常な起動を妨害・破壊する目的で制作されたウイルス・コンピューターのコード・ファイル・プログラムなどを、故意に送信・掲示・配布又は使用する行為\n12.企業から特別な権利を与えられていない状態で、アプリケーションを変更もしくはアプリケーションに他のプログラムを追加・挿入する行為、サーバーをハッキング・逆設計したりソースコードやアプリケーションのデータを流出・変更し別途のサーバーを構築する行為、ウェブサイトの一部を任意に変更・盗用し企業を偽称する行為\n13.第11項もしくは第12項に該当するソフトウェアやアプリケーションなどを、使用・流布もしくはそれらを試す行為\n14.金銭などの対価を支払い、他人にゲームのプレイを要請するなど(代理で育成など)の行為\n15.その他、関連法令に違反もしくは善良の風俗、その他社会の通念に反する行為\n\u2461会員のアカウント及びモバイル機器に関する管理の責任は会員にあり、これらをみだりに他人に利用させてはなりません。モバイル機器の管理における不備や、他人の利用を承諾したことにより発生した損害に関し、企業は一切の責任を負いません。\n\u2462会員は、各オープンマーケットで不正な決済が行われないよう、決済パスワードなどのセキュリティ手段を設定し、管理しなければなりません。会員の不注意により発生した損害に対し、企業は一切の責任を負いません。\n\u2463企業は、以下の項目における行為の具体的な内容を定めることができ、会員はこれらに従わなければなりません。\n1.会員のアカウント名、キャラクター名、ギルド名、その他ゲームで使用する名称\n2.チャットの内容と方法\n3.掲示板などサービスの利用方法\n4.連携サービスの政策など、その他必要な項目";
                if (index == 1)
                    return
                        "\n\n第11条(サービスの提供)\n\u2460企業は第5条の規定に基づき、利用契約が完了した会員に、即時サービスを利用できるようにします。ただし一部サービスに於いては、企業の必要に応じ、指定された日時からサービスを開始することができます。\n\u2461企業は会員へのサービスの提供に於いて、本規約で定めているサービスを含め、その他のサービスを併せて提供することができます。\n\u2462企業は会員のランクを区分し、利用時間、利用回数、提供サービスの範囲などを詳細に分類することで利用に差を置くことができます。\n \n第12条(サービスの利用)\n\u2460ゲームサービスは、企業の営業方針に基づき規定時間内で提供されます。\u3000企業はサービスの提供時間を、ゲームサービス内又は告知に適切な方法によって案内します。別途の表示もしくは告知がない場合は、24時間の提供を基本とします。\n\u2461第1項にも関わらず、企業は以下の項目に該当する場合に、サービスの全て又は一部を中断することができます。この場合に企業は、事前に停止理由と期間を、ゲームアプリの最初の画面やゲームサービス内にて告知します。ただし、やむを得ず事前に告知ができない事情があった場合、後日に告知することもあります。\n 1.システムのメンテナンス、サーバーの増設及び交換、ネットワークの不安定など、システム運営上必要な場合\n 2.停電、サービス設備の障害、サービス利用の激増、基幹通信事業者の設備修理もしくはメンテナンスなどにより、サービスの利用が正常にできない場合\n 3.戦争、事変、災害、もしくはこれらに準ずる国家の非常事態など、企業が統制できなくなる状況が発生した場合\n\u2462企業は、モバイル機器のための専用のアプリケーション又はネットワークを利用してサービスを提供します。会員はアプリケーションをダウンロードし、インストールもしくはネットワークを利用して、無料又は有料でサービスを利用することができます。\n\u2463有料コンテンツの場合、該当サービスに提示された料金を支払うことで利用することができます。ネットワークを通じてアプリケーションをダウンロードしたりサービスを利用したりする場合、加入した通信キャリアが定めた別途の料金が発生する場合があります。\n\u2464ダウンロードすることでインストールしたアプリケーション、又はネットワークサービスを通して利用するサービスの場合、モバイル機器又は通信キャリアの特性に合わせて提供され、モバイル機器の変更・番号の変更又は海外ローミングを実行した場合に、ゲームサービスの全てもしくは一部機能が利用できなくなることがあります。この場合、企業は一切の責任を負いません。\n\u2465ダウンロード及びインストールしたアプリケーション、又はネットワークで利用するサービスの場合、バックグラウンド作業が行われる場合があります。その際、モバイル機器又は通信キャリアの特性に応じて追加料金が発生することもあり、これらに関連した項目に対して、企業は一切の責任を負いません。\n\u2469第1項にも関わらず、関連法令、事業者団体の自主的な遵守規約などにより、特定の時間又は方法によってサービスの提供が禁止・制限される場合にサービスが提供が中断される場合もあり、これらに関連した項目に対して、企業は一切の責任を負いません。\n \n第13条(連携サービス)\n\u2460連携サービスは、他のモバイルプラットフォーム(KAKAOなど)を利用する他の会員も利用可能なサービスです。\n\u2461サービス利用前に、会員はモバイルプラットフォームの個人プロフィールを含め、サービス提供に必要な個人情報の提供及び利用に同意する必要があります。これらに同意しない場合、サービスの利用に制限がかかる場合があります。\n\u2462企業は、連携サービスを通じて多数のサービスを提供することができます。複数のサービスに加入した会員がサービスを解約する場合、加入したサービス毎に契約の解除(会員脱会)の手続きを申請する必要があります。\n\u2463連携サービスは、該当サービスの会員情報を利用して提供されるサービスであるため、会員が各連携サービスの会員資格を喪失もしくは脱会した場合、サービスの提供が正常に行われなくなる場合があります。\n\u2464インストールされたアプリケーションを削除した場合、会員のアカウント情報が削除される場合がありますので、事前に確認を行ってから削除を実行してください。\n \n第14条(コミュニティサービス)\n\u2460コミュニティサービスとは、多数の利用者が自由にコミュニケーションができるよう、企業が提供する掲示板などのサービスを示します。\n\u2461会員は、対象のサービスのアカウントを連携、もしくはその他企業から提供される方法などを用いて、コミュニティサービスを利用することができます。\n\u2462会員がコミュニティサービスを利用又は加入時、円滑なサービス運営のために、会員情報が運営に公開される場合があります。\n\u2463コミュニティサービスが連携サービスと連携して提供されている場合に、会員が各連携サービスの会員資格を喪失もしくは脱会時に、コミュニティサービスの提供が正常に行われなくなる可能性があります。\n\u2464企業は、会員の権利や利益の保護、又は健全なコミュニティサービスを提供するため、必要な項目を運営政策に含めたり、別途の政策として定めたりすることができ、会員はこれらを遵守する必要があります。企業は、運営政策もしくは別途の政策の内容が会員に確認できるよう、サービス又はコミュニティサービス内での掲示や関連画面の提供などの手段によって会員に告知します。\n \n第15条(サービスの変更及び中止)\n\u2460企業は、円滑なサービス提供のために運営もしくは技術上の必要に応じて、サービスを変更することができます。また、変更前に変更の理由をサービス内にて告知します。ただし不具合などの修正や緊急メンテナンスなど、急遽変更する必要があった場合や重大な変更ではない場合は、後日に告知することもあります。\n\u2461企業は、営業の譲渡、分割・合併などにおける営業の廃止、ゲーム提供契約の期限切れ、サービスにおける利益の低下など、経営において重大な理由によりサービスを持続することが困難な場合、サービスを全て中止することができます。この場合、中止予定日から30日前までに、中止する日付・中止する理由・補償条件などをゲームの最初の画面に告知もしくは関係画面にて告知し、第28条第1項の方法で会員に通知します。\n\n第16条(情報の収集など)\n\u2460企業は、会員の間で行われるチャットなど(サービス内にて利用者の間で行われたメッセージ、囁きなどの通信内容を含みます)の内容を保存・保管することができ、これらの情報は企業のみが保有します。企業は、会員の間で発生した問題の調整・問い合わせへの対応や、ゲームの秩序の維持のための場合に限り、第三者は法令に基づいて権限が付与された場合にのみ、本情報を閲覧することができます。\n\u2461企業もしくは第三者が第1項に基づきチャットの内容を閲覧する場合、企業は事前に閲覧の理由及び範囲を対象の会員に告知します。ただし第10条第1項に基づいた禁止行為の調査・処理・確認もしくはそれらの行為による被害の対応と関連し、本情報を閲覧する必要がある場合には、後日告知することができます。\n\u2462企業はサービスの円滑で安定した運営及び品質改善のために、会員の個人情報を除いた会員のモバイル機器の情報(設定、仕様、端末機種のOSバージョン、加入している通信キャリアの情報など)を収集し、活用することができます。\n\u2463企業は、サービスの改善及び会員対象サービスの紹介などを目的として、会員に追加情報を要請することができます。この要請に関し、会員は承諾もしくは拒否することができます。また、企業がこの要請をする場合、会員はこれらを拒否することができるという点も併せて告知します。\n \n第17条(広告の提供)\n\u2460企業はサービスの運営に関し、サービス内に広告を掲示することができます。また、受信に同意した会員にのみ、電子メール、メッセージ(LMS/SMS)、プッシュ通知(Push Notification)などの手段によって、広告情報を送信することができます。この場合、会員はいつでも受信を拒否することができます。また、企業は会員が受信を拒否した場合は、広告情報を送信することはありません。\n\u2461企業が提供するサービス内のバナーやURLなどにより、他人が提供する広告やサービスにアクセスすることができます。\n\u2462第2項に基づき、他人が提供する広告やサービスにアクセスする場合に、該当の領域で提供されるサービスは企業のサービス領域ではないため、企業は信頼性や安全性などを保証しません。また、これらによる会員の損害に対しても、企業は一切の責任を負いません。ただし企業の故意又は重過失により損害の発生を容易にしたり､もしくは損害防止のための措置を取らなかったりした場合には対象外となります。\n \n第18条(著作権)\n\u2460企業が制作したサービス内の全てのコンテンツに関する著作権やその他の知的財産権は、企業に帰属します。\n\u2461会員は、企業が提供するサービスを利用して得た情報の中で、企業又は提供企業に知的財産権が帰属された情報を、企業又は提供企業の事前の同意なく複製・送信などの方法(編集、公表、公演、配布、番組配信、2次創作の作成などを含みます)により、営利を目的として自分や他人に利用させることはできません。\n\u2462会員は、サービス内のコンテンツ(キャラクター、画像、音源など直接的な内容やサービス関連情報のような間接的な内容を含みます)と関連し、会員もしくは他の利用者がサービスを通じてアップロードや送信した会話のテキストを含むコミュニケーション、画像、サウンド及び全ての資料や情報(以後「利用者コンテンツ」といいます)について、企業が以下の方法と条件によって利用することを許可するものとします。\n1.該当利用者のコンテンツを利用・編集などに変更及びその他変形したもの(公表、複製、公演、送信、配布、番組配信、2次創作の作成など、形式にかかわらず自由に利用することができ、利用期間や地域に制限はありません)\n2.利用者のコンテンツを、制作した当事者の事前同意なしに、取り引きを目的として販売、貸出、譲渡などの行為を行いません。\n\u2463サービス内で表現されない内容や、サービスとは関係のない利用者のコンテンツ(一般の掲示板などでの掲示物など、実質ゲーム内コンテンツとは関係のない掲示物を示します)に関し、企業は会員の明確な同意なしに利用せず、会員はいつでもこのような利用者のコンテンツを削除することができます。また、著作物に関する権利や責任は、会員本人にあります。\n\u2464企業は、会員が掲示や登録するサービス内の掲示物に対し、第10条第1項に基づく禁止行為に該当すると判断された場合には、事前通知なしでこれらを削除もしくは移動、もしくはこれらの登録を拒否することができます。\n\u2465企業が運営する掲示板などに掲示された情報により、法律上の利益が侵害された会員は、企業に該当情報の削除もしくは反論内容の掲載を要請することができます。この場合、企業は迅速に必要な措置を取り、それを申請人に通知します。\n\u2466この条は、企業がサービスを運営する期間は有効で、会員の脱会後にも持続して適用されます。\n \n第19条(コンテンツの利用)\n\u2460サービス内での有料決済により配付されたコンテンツは、会員のアカウント情報に帰属され、該当アカウントでログインしたモバイル機器にて使用することができます。ただし臨時会員の場合は、アプリケーションをダウンロード、もしくはインストールしたデバイスでのみ使用可能となります。\n\u2461有料決済により提供されたコンテンツの使用期間は、購入時に別途告知された場合、その使用期間に基づきます。ただし第15条第2項に基づいてサービスが中止される場合、無期限のコンテンツの使用期間は、サービス中止の告知に記された日時までとなります。\n\u2462サービス内の他のコンテンツへの交換、コンテンツを利用時に消費されるコンテンツ(以後「ゲームの財貨」といいます)の場合、有料決済により提供され、サービス利用によっては無償でも提供されます。ゲームの財貨を使用すると、有料決済にて提供されたものから優先的に使用されます。ただし、サービスにて別途の使用優先順位を指定した場合は対象外となります。\n \n第20条(サービスの利用制限)\n\u2460会員は第10条に基づき、会員の義務を違反する行為をしてはなりません。もしも該当行為をした場合、企業は以下の項目に基づいた会員のサービス利用制限、関連情報(テキスト、画像、映像など)の削除及びその他の措置を含めた利用制限を行うことができます。利用制限の措置が行われる会員の具体的義務違反の理由及び手続きは、第21条第1項に基づいて個別にゲームの運営政策にて定めます。\n1.一部の権限を制限：一定期間、チャットやゲーム情報の初期化など一定の権限を制限\n2.キャラクターの利用制限：一定期間もしくは永久に、会員のキャラクターの利用を制限\n3.アカウントの利用制限：一定期間もしくは永久に、会員のアカウントの利用を制限\n4.会員への利用制限：一定期間もしくは永久に、会員のゲームサービスの利用を制限\n\u2461第1項の利用制限が正当なものである場合、企業は利用制限による会員の損害を賠償しません。\n\u2462企業は、以下の項目に該当する問題に関する調査が完了するまで、アカウントのサービス利用を停止することができます。\n1.アカウントがハッキングもしくは盗用されたという報告を受けた場合\n2.違法プログラムの使用者や違法行為が疑われる場合\n3.返金の繰り返しや商品の未配布問題など、決済における不当な利益行為が疑われる場合\n4.その他、上記の項目に準ずる理由により、サービス利用の暫定措置が必要な場合\n\u2463第3項の調査の完了後、有料決済により提供されたコンテンツの場合、停止されていた期間分相当の利用時間を延長もしくはコンテンツなどによって補償します。ただし、会員が第3項目の各項目の理由に該当する場合は対象外となります。\n \n第21条(利用制限及び意見の提示関する理由及び手続き)\n\u2460企業は第20条第1項に基づき、利用制限が行われる具体的な理由及び手続きを、違反行為の内容、頻度、回数、結果などの諸事情を考慮し、運営政策として定めます。\n\u2461企業が第20条第1項に基づいて利用制限の措置を取る場合、以下の項目を会員に事前に通知してサービス内でも告知します。ただし、やむを得ない場合には後日に通知することがあります。\n1.利用制限の理由\n2.利用制限の方針及び期間\n3.利用制限に関する異議申請の方法\n\u2462会員が、企業の利用制限措置に対して異議がある場合、通知があった日から15日以内に企業の利用制限に対して異議を唱える理由を記載した意見申請書を、書面や電子文書などの手段を用いて企業に提出しなければなりません。\n\u2463企業は第3項に基づき、意見申請を受け取った日から15日以内に会員の異議に対して書面や電子文書などの手段によって返答し、それに応じた措置を執ります。ただし企業が15日以内に返答することが難しい場合、会員にその理由と対応日程を通知します。";
                if (index == 2)
                    return
                        "\n\n第22条(代金の決済)\n\u2460コンテンツに関する購入代金の発生及び支払いは、原則として通信キャリアやオープンマーケット事業者などにより定められた政策や方法に従います。また、各決済手段の限度は、企業、オープンマーケット事業者、決済企業が定める規約又は政府の方針に従い、付加もしくは調整されることがあります。\n\u2461コンテンツの購入代金を外貨で決済する場合、為替レートや手数料などにより、実際の請求額がサービスショップなどに表示される価格と異なる場合があります。\n \n第23条(契約申し込みの撤回)\n\u2460企業とコンテンツの購入に関する契約を締結した会員は、購入契約日とコンテンツ利用可能日のうちもっとも遅い日から7日以内に、別途の手数料・違約金などの負担なしで契約申し込みの撤回を行うことができます。\n\u2461会員は以下の項目に該当する場合は、企業の意思に反して第1項に基づき契約申し込みの撤回を行うことができません。ただし数回に渡って配付されるコンテンツの購入契約の場合、そのコンテンツが以下の項目に該当しない部分に関しては対象外とします。\n 1.購入後、すぐに使用又は適用されるコンテンツ\n 2.追加の特典が提供される場合、その特典が使用されたコンテンツ\n 3.開封を使用としてみなされる、もしくは開封時に効力が決定するコンテンツを開封した場合\n\u2462企業は第2項の各項目の規定に基づき、契約申し込みの撤回が不可能なコンテンツの場合、その事実を会員が簡単に確認できるような場所に表示し、これらのコンテンツのテスト使用が可能な商品を提供(一時的な利用の許可、体験用サンプルの提供など)する。ただし、これらの提供が難しい場合には、コンテンツに関する情報を提供することで、会員の撤回の権利行使の妨害にならないように措置を執ります。もしも企業がこのような措置を取らなかった場合は、第2項の各項目における申し込みの撤回の制限理由に関係なく、会員は撤回を申請することができます。\n\u2463第1項と第2項にも関わらず、会員が購入した有料コンテンツの内容が、表示された内容や広告の内容と異なる場合、もしくは契約内容と移行内容が一致しない場合、会員はそのコンテンツの購入日又は利用可能日から3か月以内、その事実を知った日、もしくは知ることができた日から30日以内に、契約申し込みを撤回することができます。\n\u2464会員が契約申し込みを撤回する場合、企業はオープンマーケット事業者から購入内訳を確認することができます。また、企業は会員の撤回理由を確認するため、会員から提供された情報を用いて会員に連絡することができ、追加の証文を要求することができます。\n\u2465第1項から第4項までの規定に基づき、契約申し込みの撤回が行われる場合、企業は会員の有料コンテンツを即時回収し、3営業日以内に返金します。もしも企業が返金を遅延した場合、遅延期間に対して「電子商取引などでの消費者保護に関する法律」及び同法律の施行令第21条の3で定められた利率によって算出された遅延利息を支給します。\n\u2466未成年者がモバイル機器からコンテンツの購入契約を締結した場合、企業は法定代理人の同意がないと未成年者本人もしくは法定代理人が本契約を撤回することもできるという内容を告知します。また、未成年者が法定代理人の同意なしで購入契約を締結した場合、未成年者本人又は法定代理人は、企業に対して該当の契約を撤回することができます。ただし未成年者が、法定代理人が範囲を定め処分を許可した財産でコンテンツを購入した場合、又は未成年者が自身を成人として偽称したり、法定代理人の同意があるかのように偽造した場合には、契約を撤回することはできません。\n\u2467コンテンツの購入契約を行った本人が未成年者であるかに関しては、決済が行われたモバイル機器、決済を行った人物の情報、決済手段の名義者などを根拠に判断されます。また、企業は撤回が正しいかを確認するため、未成年者及び法定代理人であることを証明できる書類の提出を要請することができます。\n \n第24条(過誤納金の返金)\n\u2460企業は過誤納金が発生した場合に、過誤納金を会員に返金します。ただし過誤納金が企業の故意又は過失ではなく、会員の過失により発生した場合には、返金の際に発生する実費は会員の負担となります。\n\u2461有料決済は、オープンマーケット事業者が提供する決済方法に基づきます。また、決済の際に過誤納金が発生した場合、企業又はオープンマーケット事業者に返金を要請する必要があります。ただしオープンマーケット事業者の規約やシステムに応じて、企業がオープンマーケット事業者に、必要な返金手続きの履行を要請することもできます。\n\u2462アプリケーションのダウンロード又はネットワークサービスの利用により発生した通信料金(通話料、データ通信料など)は、返金対象外となる場合があります。\n\u2463返金は、サービスを利用しているモバイル機器のOSのオープンマーケット事業者又は企業の返金規約に基づいて行われます。\n\u2464会員が有料決済をせず、サービス利用中に無償で取得、もしくは企業が内部又は外部との連携イベントなどにより無償で提供したコンテンツは、返金対象外となります。\n\u2465企業は過誤納金の返金を対応するために、会員から提供された情報を用いて会員に連絡することができ、必要な情報の提供を要求することができます。\n \n第25条(契約の解除)\n\u2460会員が利用契約を解除しようとする場合、会員が直接サービス内のメニューもしくはお問い合わせを通して、脱会を申請することができます。脱会が完了すると、会員のゲーム情報(スコア、キャラクター、アイテム、ゲームマネーなど)は全て削除され、復旧ができなくなります。アプリケーションの削除又は連携サービスの解除などは、利用契約の解除として認められません。\n\u2461企業は、会員が本規約及びそれらに基づく運営方針で禁止されている行為をするなど、本契約を維持することができない重大な理由が発生した場合に、相当の期間をおいて催告したうえで、期間を定めてサービス利用を中止もしくは利用契約を解除することができます。\n\u2462第1項及び第2項に基づく返金及び損害賠償は、「コンテンツ利用者保護指針」に基づき処理されます。\n\u2463企業は、サービスを利用した最新の日時から1年間、企業のサービスを利用していない会員(以後「休眠アカウント」と呼びます)の個人情報を保護するため、利用契約を解除し、会員の個人情報破棄などの措置を執ることができます。この場合、措置が執られる日の30日前までに、契約の解約や個人情報の破棄及び破棄される個人情報などについて会員に通知します。\n \n第26条(損害賠償)\n\u2460企業又は会員には、当規約に違反して相手に損害を与えた場合に、それに対して賠償する責任があります。ただし、故意又は重過失などが絡まない場合は対象外とします。\n\u2461企業が個別のサービス提供者と連携契約を締結し、会員へ個別サービスを提供する際に、会員が個別サービスの利用規約に同意したうえで、個別サービスの提供者の帰責事由により損害が発生した場合、それらの損害に対しては、個別サービスの提供者が責任を負うものとします。\n \n第27条(企業の免責)\n\u2460企業は、災害もしくはそれに準ずる不可抗力によりサービスが提供できない場合、サービス提供に関して一切の責任を負いません。\n\u2461企業は、サービス用の設備修理、交換、定期メンテナンス、工事、その他これらに準ずる理由により発生した損害に対して、一切の責任を負いません。ただし、企業の故意又は過失による場合は対象外とします。\n\u2462企業は、会員の故意又は過失によるサービス利用への障害に対して、一切の責任を負いません。ただし、会員にやむを得ない理由がある場合には対象外とします。\n\u2463会員がサービスと関連して掲載した情報や資料などの信頼性や正確性などに対し、企業は故意又は重過失がない限り、一切の責任を負いません。\n\u2464企業は、会員が他の会員や他人とサービスを媒介にして発生した取り引きや問題に対して介入する義務がないため、これらにより発生した損害に対して一切の責任を負いません。\n\u2465企業は無料で提供されるサービス利用と関連し、会員に発生した損害に対して一切の責任を負いません。ただし、企業の故意又は重過失による場合は対象外とします。\n\u2466企業は、会員がサービスを利用して期待していた利益を得られなかった、又は利益を喪失したことに対して、一切の責任を負いません。\n\u2467企業は、会員のゲーム情報(経験値、ランク、アイテム、ゲームマネーなど)の損失に対して、一切の責任を負いません。ただし、企業の故意又は過失による場合は対象外とします。\n\u2468会員は、モバイル機器のパスワード設定機能、オープンマーケットが提供するパスワード設定機能などを管理しないことにより発生した第三者による決済に対して、一切の責任を負いません。ただし、企業の故意又は過失による場合は対象外とします。\n\u2468モバイル機器や電話番号の変更、OSのアップグレード及び変更、海外ローミング、通信会社の変更などにより、コンテンツの全てもしくは一部の機能を利用することができない場合、企業はこれらに対して一切の責任を負いません。ただし、企業の故意又は過失による場合は対象外とします。\n\u246a会員が、企業から提供されるコンテンツ又はアカウント情報を削除した場合、企業はこれらに対して一切の責任を負いません。ただし、企業の故意又は過失による場合は対象外とします。\n\u246b企業は、臨時会員がサービス利用により発生した損害に対して、一切の責任を負いません。ただし、企業の故意又は過失による場合は対象外とします。\n \n第28条(会員への通知)\n\u2460企業が会員に通知する場合、会員の電子メールアドレス、電子メモ、サービス内のメッセージ、LMS/SMSなどで行うことができます。\n\u2461企業が全会員に通知する場合、7日以上ゲームサービス内に掲示又は別途の画面などで提示することにより、第1項の通知と同じものとみなします。\n \n第29条(裁判権及び準拠法)\n\u2460本規約は、大韓民国の法律に基づいて定められ、解釈されます。企業と会員の間で発生した問題によって訴訟を発生した場合、法令により定められた手続きに基づいた裁判所を管轄の裁判所とします。\n \n第30条(会員の苦情の対応及び問題の解決)\n\u2460企業は会員の便意を考慮し、会員の意見や不満を提示できる手段を、ゲームサービス内もしくは関連画面にてご案内します。企業は、これらの会員の意見や不満に対応するための、専門の人員を構成及び運営します。\n\u2461企業は、会員から提示される意見や不満が正しいと客観的に認められた場合、合理的な期間内でこれらを迅速に対応します。ただし対応に長時間が予想される場合は、会員に長時間がかかる理由とそれに伴う対応の日程を、ゲームサービス内にて告知又は第28条第1項に基づいて通知します。\n\u2462企業と会員の間で問題が発生し、第3の紛争調整機関により調整を行う場合、企業は利用制限など会員への措置について誠実に証明し、調整機関の調整に従うことができます。";
                break;

            case Language.TC:
                if (index == 0)
                    return
                        "CookApps行動服務使用條款\n（包含同意接收廣告資訊在內）\n\n\n第1條（目的）\n本條款旨在規定使用CookApps（股）（下稱「本公司」）透過行動裝置提供的所有遊戲服務及其附帶的網路、網站、其他服務（下稱「服務」）相關之本公司和會員間的權利義務、責任事項、其他必要事項。\n\n第2條（用語的定義）\n\u2460 本條款中使用的用語定義如下：\n1.\t「會員」是指根據本條款簽訂使用契約並使用本公司提供的服務者。\n2.\t「臨時會員」是指未將帳號資訊和第三方帳號進行連動或驗證，或透過訪客身分登入來使用服務的會員。\n3.\t「行動裝置」是指行動電話、智慧型手機、掌上型電腦（PDA）、平板電腦等可透過網路下載或安裝遊戲內容並進行使用的裝置。\n4.\t「帳號資訊」是指會員的會員編號和第三方帳號資訊、裝置資訊、暱稱、頭像、會員向本公司提供的好友名單等資訊和遊戲使用資訊（角色資訊、道具、等級等）、使用費用付款資訊等的總稱。\n5.\t「遊戲內容」是指本公司所提供為了可用於行動裝置，以數位方式製作的一切付費或免費內容相關服務（遊戲與網路服務、應用程式、遊戲幣、遊戲道具等）。\n6.\t「付費付款」是指為了購買或使用服務內的遊戲內容等而透過本公司認可的付款商家來付款的行為。\n7.\t「應用程式商店」是指將應用程式安裝於行動裝置上，並可進行付費付款的電子商務交易環境。\n8.\t「合作服務」是指本公司透過和Kakao等其他行動裝置平台服務商合作所提供的服務，為了使服務能用於行動裝置中，而利用所合作的行動裝置平台的加入資訊、頭像等提供個別或所有的服務。\n9.\t「付款商家」是指於應用程式商店提供可用信用卡、行動電話付款等電子支付方式的商家。\n10.\t「應用程式」是指為了使用本公司所提供的服務，而透過行動裝置下載或安裝並進行使用的所有程式。\n11.\t「遊戲服務」是本公司提供的服務之一，指會員在行動裝置中執行的遊戲及其附帶的服務。\n\u2461 本條款中使用的用語的定義除了本條第1項規定的之外，需依據相關法令與各個服務政策，未規定的部分則依一般商業慣例而定。\n\n第3條（本公司資訊等的提供）\n本公司為易於會員識別而將下列各款的事項標示於遊戲服務內，惟會員可以透過載入畫面來查看個人資訊處理方針和條款。\n1.營業名稱與代表人的姓名\n2.營業場所的所在地址（包含可以處理會員客訴的場所地址在內）\n3.電話號碼、電子郵件\n4.營利事業登記證號\n5.通訊販賣業申報編號\n6.個人資料保護政策\n7.服務使用條款\n\n第4條（條款的效力與變更）\n\u2460\t本公司為易於會員了解，應將本條款的內容公布於遊戲服務內或該載入畫面中，此時為使會員便於識別，本條款內容內如服務中斷、取消購買、退款、契約終止／解除、本公司的免責事項等重要內容，將以粗體、顏色、符號等方式明確呈現，或透過其他的載入畫面等提供。\n\u2461\t若本公司有修正條款情形，將表明適用日期、修正內容與修正事由等，並於適用日至少7天前公布在遊戲服務內或該載入畫面向會員進行公告。惟若變更的內容有對會員不利，或有重大事項變更情形，則按照本文方式於該適用日的30天前公告，並依第28條第1項的方式向會員進行通知，此時為易於會員明白，將明確比較並標示出修正前和修正後的內容。\n\u2462\t若本公司有修正條款情形，將於公告後針對適用修正條款的會員確認同意與否，若本公司有進行第2項的公告或通知情形，亦將同時公告或通知會員未針對修正條款表示同意或拒絕的意向時，則視其為同意的內容，而會員若未於本條款實施日止表示拒絕的意向，則可視其同意修正條款。會員若針對修正條款有不同意情形，本公司或會員可解除服務使用契約。\n\u2463\t本公司應採取應對措施，使會員能向本公司針對本條款內容提出相關質疑。\n\u2464\t本公司可於不違反「電子商務交易等中的消費者保護有關法規」、「條款的限制有關法規」、「遊戲產業振興有關法規」、「促進資訊通訊網利用與資訊保護等有關法規」、「遊戲內容產業振興法」等相關法令的範圍內修正本條款。\n\n第5條（使用契約的簽訂與適用）\n\u2460\t使用契約是有意成為會員者（下稱「申請加入者」）於同意本條款的內容後申請以下服務，並於本公司核准該申請後簽訂而成。\n\u2461\t本公司原則上同意申請加入者的申請，惟本公司可能拒絕核准符合下列任一款使用申請。\n1.不實填寫使用申請書的內容或無法滿足使用申請條件時\n2.於本公司不提供或未決定提供服務的國家中，透過不正常或間接的手段提出使用申請時\n3.以「遊戲產業振興有關法規」等現行法令中禁止的行為為目的提出使用申請時\n4.欲提出以妨礙社會安寧和秩序或善良風俗為目的，或是欲以妨礙本公司利益為目的的申請時\n5.欲以不當用途來使用服務時\n6.欲以追求營利為目的來使用服務時\n7.透過本公司限制使用服務的行動裝置、程式等提出使用申請時\n8.其他相當於各款的事由而被判定為不適宜核准時\n\u2462\t本公司在有符合下列任一款情形，可延後核准至該事由解除為止\n1.本公司的設備不夠充裕或難以支援特定的行動裝置，或有技術上問題時\n2.服務或付款方式問題造成技術上的問題時\n3.其他相當於上述各款的事由而被判定難以核准使用申請時\n\u2463\t本公司於會員完成本條款的同意程序，或輸入完使用服務所需的資訊後，沒有出現延後核准或拒絕的事項情形，則可使其立刻使用服務。惟若有於事後查到根據第2項的事項時，則可根據本條款規定，採取限制使用或解除契約。\n\u2464\t本公司為求用戶的方便，可針對遊戲服務提供臨時會員的功能，若於使用臨時會員功能途中有符合下列各款情形，可能導致帳號資訊被刪除或無法查看記錄的問題，且透過臨時會員功能使用過的遊戲服務的帳號資訊也可能在之後無法連結或轉移，此時本公司不保證能復原帳號資訊，且概不負責與此相關的補償與損害賠償，惟由於本公司存在故意或重大過失情形時則不在此限。\n1.變更行動裝置時\n2.改造或初始化行動裝置時\n3.於行動裝置中刪除應用程式等全部或部分的遊戲內容時\n\n第6條（條款之外的準則）\n本條款中的未規定事項和有關本條款的解釋，需依據「電子商務交易等中的消費者保護有關法規」、「條款的限制有關法規」、「遊戲產業振興有關法規」、「促進資訊通訊網利用與資訊保護等有關法規」、「遊戲內容產業振興法」等相關法令或商業慣例。\n\n第7條（營運政策）\n\u2460\t於必要事項和條款中規定具體範圍後，可將委任事項制定為遊戲服務營運政策（下稱「營運政策」），以利適用本條款。\n\u2461\t本公司為確保會員能夠了解，需將營運政策的內容公布於遊戲服務內或該載入畫面中。\n\u2462\t若有修正營運政策情形，需根據第4條第2項的程序辦理，惟修正內容有符合下列任一款情形，則按照第2項的方法進行事前公告。\n 1.於條款中規定具體範圍條款後修正委任事項時\n 2.修正和會員的權利義務無關的事項時\n 3.營運政策的內容和條款中所規定的內容並無二致，且於會員可預測的範圍內修正營運政策時\n\n第8條（個人資訊的保護與使用）\n\u2460\t本公司基於相關法令規定，致力保護會員的個人資訊，針對個人資訊的保護與使用上根據相關法令與本公司的個人資訊處理方針。惟若使用了本公司提供服務以外的鏈接服務，則不適用本公司的個人資訊處理方針。\n\u2461\t本公司可依據服務的特性，公開無關會員個人資訊的暱稱／角色相片／狀態資訊等自我介紹內容。\n\u2462\t本公司根據相關法令，除非有關國家機關等提出要求，否則不得未經會員本人同意，將會員的個人資訊提供他人。\n\u2463\t因歸責於會員的事由而導致會員個人資訊洩露、或因帳號資訊等導致的損失，本公司概不負責。\n\n第9條（本公司的義務）\n\u2460\t本公司秉持誠信遵守相關法令與本條款中規定的權利行使與義務履行。\n\u2461\t本公司為使會員能安全地使用服務，應具備保護個人資訊（包含信用資訊在內）的資安系統，公告並遵守個人資訊處理方針，除非是本條款與個人資訊處理方針規定的情況，否則本公司不得向第三者公開或提供會員的個人資訊。\n\u2462\t若本公司為提供持續且穩定的服務而進行的改善作業當中，因設備發生問題或數據等消失／受損時，除非是自然災害、緊急狀態、目前技術無法解決的問題或缺失等不得已的事由，否則應立刻盡最大的努力進行修理或復原。\n\n第10條（會員的義務）\n\u2460\t若會員於使用本公司提供的服務中有做出符合下列各款的行為時，本公司可根據內部規定實施帳號措施。\n1.\t於使用申請或變更會員資訊時填寫虛偽事實或使用他人資訊的行為\n2.\t透過本公司未提供的服務或不正常手段取得、利用、買賣、贈與、讓渡遊戲資訊（ID、角色、道具、遊戲幣等），或使人懷疑其企圖的行為\n3.\t冒充本公司的職員或GM、盜用他人名義公布文章、或發送電子郵件的行為，冒充他人或表明和他人的偽造關係的行為\n4.\t盜用他人的信用卡、有／無線電話、銀行帳戶等購買遊戲內容的行為、不當使用其他會員的ID與密碼的行為\n5.\t無故收集／儲存／公布或散播其他會員的個人資訊的行為\n6.\t進行或誘導賭博等投機行為、交流或發表淫穢／低俗的資訊、連接（鏈接）淫穢網頁的行為、引發羞恥或令人厭惡或恐怖感的言語／聲音／句子／相片，或傳送／散播影像給予他人的行為等不健康地使用服務的行為\n7.\t無故將服務用於營利、營業、廣告、宣傳、政治活動、選舉運動等脫離原本用途的行為\n8.\t無故利用由本公司服務所取得的資訊進行複製、流通、儲存或用於商業的行為、濫用已得知或未被得知的Bug來使用服務的行為\n9.\t欺瞞他人而獲益的行為、使用本公司的服務讓他人遭受損失的行為\n10.\t侵害本公司或他人智慧財產權／肖像權的行為、毁損或令他人的名譽受損的行為\n11.\t傳送或公布法令禁止的資訊（電腦程式）或電腦軟硬體、或故意傳送／公布／散播或使用研發來妨礙／破壞電子通訊設備的正常運作為目的的病毒／電腦編碼／文件／程式等的行為\n12.\t未取得由本公司所賦予的特別權利而變更應用程式、或於應用程式中增加／嵌入其他程式、或駭入／反向分析伺服器、洩露／變更源代碼或應用程式數據、建立其他的伺服器、或任意變更或盜用部分網站假冒本公司的行為\n13.\t使用／散布符合第11款至第12款的軟體、應用程式等，或企圖使用／散布的行為\n14.\t支付金錢等代價要求他人進行遊戲等（代玩）的行為\n15.\t其他會違反相關法令或違背善良風俗與一般社會觀念的行為\n\u2461\t有關會員帳號與行動裝置的管理責任在於會員身上，不得讓他人使用，本公司概不負責因行動裝置的管理不確實或允許他人使用而導致的損害。\n\u2462\t會員應設定付款密碼功能等的安全方式並做好控管，以確保應用程式商店中不會出現非法付款，本公司概不負責因會員的疏忽而產生的損害。\n\u2463\t本公司可規定下列各款行為的具體內容，且會員應比照辦理。\n1.會員的帳號名稱、角色名稱、公會名稱、其他於遊戲內使用的名稱\n2.聊天內容和方式\n3.留言板等服務使用方式\n4.合作服務政策等其他必要事項";
                if (index == 1)
                    return
                        "\n\n第11條（服務的提供）\n\u2460\t本公司根據第5條規定，可立即向完成使用契約的會員提供服務，惟部分服務可能按照本公司的需求於指定日期起開始提供服務。\n\u2461\t本公司向會員提供服務時，可能同時提供包含本條款規定服務在內的其他附加服務。\n\u2462\t本公司會區別會員等級，並細分使用時間、使用次數、提供服務的範圍等提供不同等級的服務。\n\n第12條（服務使用）\n\u2460\t遊戲服務是根據本公司營業方針所規定的時間內進行提供，本公司會以適當的方式於遊戲服務內或公告事項中說明服務提供的時間，若無特別的標示或公告情況，基本則是提供24小時。\n\u2461\t即使有第1項規定，但本公司可於下列各款情形時暫時停止全部或部分的服務，此時本公司會於遊戲應用程式首頁或遊戲服務內，事前公告該停止的事由與期間。惟若有事前無法公告的不得已原因，則可於事後進行公告。\n1.\t由於系統定期維護、伺服器的增設與更換、網路不穩等系統營運上有必要時\n2.\t由於停電、服務設備問題、使用服務尖峰、通訊業者維修或維護設備等，導致無法正常提供服務時\n3.\t發生戰爭、動亂、自然災害或相當於國家緊急狀態等本公司無法控制的狀況時\n\u2462\t本公司使用行動裝置專屬的應用程式或網路提供服務，而會員可以下載應用程式進行安裝，或利用網路以免費／付費的方式使用服務。\n\u2463\t若為付費的遊戲內容，應支付該服務中所顯示的金額後才可進行使用，若為透過網路下載應用程式或使用服務的情況，則可能產生會員加入的行動電信業者規定之額外費用。\n\u2464\t若為下載並安裝的應用程式或透過網路服務來使用服務時，則會配合行動裝置或行動電信業者特性提供服務，若行動裝置有變更、更換號碼或國外漫遊時，可能無法使用全部或部分遊戲服務，此時本公司概不負相關責任。\n\u2465\t若為下載並安裝的應用程式或透過網路來使用服務時，則可能會發生後台處理工作，此時可能產生配合行動裝置或行動電信業者特性的額外費用，針對與此相關的事項本公司概不負責。\n\u2469 即使有第1項規定，但若於相關法令、企業團體自律遵守規章等當中，有禁止或限制於特定時間或方式提供服務的情況，則可能不會提供服務，針對與此相關的事項本公司概不負責。\n\n第13條（合作服務）\n\u2460\t合作服務是可以和利用他行動裝置平台（Kakao等）的其他會員共同使用的服務。\n\u2461\t於使用服務前，會員應同意提供包括行動裝置平台個人檔案在內的必要個人資訊於提供服務時運用，若不同意本內容時，可能造成使用服務受限。\n\u2462\t本公司可透過合作服務提供多數的服務，若有已加入幾個服務的會員欲解除使用服務情形，應另外申請解除已加入服務（會員註銷）。\n\u2463\t由於合作服務是利用該服務的會員資訊所提供的服務，因此當會員喪失或註銷了該合作服務的會員資格，可能造成無法正常完成服務的提供。\n\u2464\t若欲刪除已安裝的應用程式時，可能導致會員的帳號資訊被刪除，故請事先確認後再行刪除。\n\n第14條（社群服務）\n\u2460\t社群服務是指為求多數的用戶能夠自由交換意見並增進友誼，而由本公司提供的留言板等服務。\n\u2461\t會員可透過連動合作服務帳號或其他由本公司所提供的方法來利用社群服務。\n\u2462\t為求服務的順暢處理，當會員加入社群服務的使用後，會員的資訊可能會被公開給管理者。\n\u2463\t當社群服務是經由和合作服務連動而提供時，若會員喪失或註銷了該合作服務的會員資格，可能造成無法正常完成社群服務的提供。\n\u2464\t為保護會員的權益和提供健全的社群服務，本公司可將必要事項納入營運政策內或規定其他政策，且會員有遵守本內容的義務。本公司將於服務或社群服務內公布，或以載入畫面的方式向會員公告，讓會員得知營運政策或其他政策的內容。\n\n第15條（服務的變更與中止）\n\u2460\t為求提供流暢的服務，本公司可能根據營運上或技術上的需要而變更服務，並將於變更前於服務內公告相關內容，惟若出現因Bug、錯誤等的修改或緊急更新等不得已的必要變更，或不屬於重大變更的情形，則可於事後公告。\n\u2461\t若有因營業讓渡、分割／合併等營業的廢止、遊戲提供契約的期滿、服務出現顯著收益惡化等經營上的重大事由導致難以持續提供服務情形時，本公司可能中斷全部的服務，此時會於中斷日期30天前透過遊戲服務首頁或該載入畫面公告中斷日期、中斷事由、補償條件等，並按照第28條第1項的方式通知會員。\n\n第16條（資訊的收集等）\n\u2460\t本公司可儲存／保管會員之間進行的聊天等（包含用戶之間於服務內傳遞的訊息、悄悄話等通訊內容）的內容，該資訊限由本公司保存，並僅限於本公司於協調會員之間的糾紛、客訴處理或維持遊戲秩序的情況，第三方可由根據法令授予權限的情況下閱覽本資訊。\n\u2461\t若本公司或第三方欲根據第1項閱覽聊天等的資訊時，本公司將事前告知該會員有關閱覽的事由與範圍，惟若是因第10條第1項的禁止行為調查、處理、核實，或因該行為導致和受害救濟有關而需要閱覽本資訊時，則可於事後告知。\n\u2462\t本公司為求服務順暢、營運穩定與品質提升，可能收集／善加利用會員的個人資訊以外的會員行動裝置資訊（設定、規格、作業系統版本、電信公司資訊等）。\n\u2463\t本公司可藉由改善服務與介紹以會員為對象的服務為目的，要求會員提供額外的資訊，會員可接受或拒絕本要求，而本公司在提出本要求時將一併告知會員可以拒絕本要求。\n\n第17條（廣告的提供）\n\u2460\t本公司可針對服務的營運於服務內刊登廣告，且僅可向同意接收的會員以電子郵件、簡訊服務（LMS／SMS）、推播（Push Notification）等方式傳送廣告資訊，此時會員可隨時拒絕接收，而本公司於會員拒絕接收時，不得發送廣告資訊。\n\u2461\t可透過本公司提供服務內的橫幅廣告或連結等，連接到他人提供的廣告或服務中。\n\u2462\t若根據第2項連接到他人提供的廣告或服務時，由於該處所提供的服務非本公司的服務範圍，故本公司不保證可靠度和安全性，本公司亦不負責其所導致的會員損失，惟由於本公司存在故意或重大過失而導致損害輕易發生，或未採取防止損害發生的措施情形時則不在此限。\n\n第18條（著作權）\n\u2460\t本公司製作的服務內所有遊戲內容之相關著作權和其他智慧財產權歸屬本公司。\n\u2461\t會員不得於未經本公司或提供廠商的事前同意下，利用本公司提供的服務而獲取的資訊中歸屬本公司或提供廠商的智慧財產權資訊，藉由複製／傳送等方式（包含編輯、公開發表、表演、散布、廣播、二創作品等在內，下同）作為營利目的使用，或讓他人使用。\n\u2462\t會員允許本公司就服務內的遊戲內容（包含角色、圖像、音源等的直接內容和服務相關資訊之類的間接內容在內），以下列方式和條件利用包含會員或其他用戶透過服務上傳或傳送的對話文字在內的溝通、圖像、聲音與所有資料與資訊（下稱「用戶遊戲內容」）。\n1.\t利用該用戶遊戲內容，改變編輯格式與其他變形（公開發表、複製、表演、傳送、散布、廣播、二創作品等任何形態皆可能運用，且不限使用期間和地區）\n2.\t未經製作用戶遊戲內容的該用戶事前同意，本公司不會以交易為目的來販售、租借、讓渡用戶遊戲內容\n\u2463\t針對服務內未顯示的內容、或和服務沒有關聯的用戶遊戲內容（指一般於留言板上的發文等實際上和遊戲內的遊戲內容無關的發文），本公司不會在會員沒有明確同意的情況下進行使用，且會員可隨時刪除這些用戶遊戲內容，其作品的權利和責任在會員本人身上。\n\u2464\t若會員於服務內公布或登記的發文被本公司認定為屬於第10條第1項的禁止行為情形，則可不經由事前通知刪除、移動或拒絕該登記的發文。\n\u2465\t若有因本公司於營運的留言板等公布的資訊導致法律上的利益遭受侵害的會員，可向本公司要求刪除該資訊或要求刊登反駁的內容，此時本公司應迅速採取必要措施，並將該內容通知申請人。\n\u2466\t本條於本公司經營服務的期間有效，即使於會員註銷後亦持續適用。\n\n第19條（遊戲內容的運用）\n\u2460\t於服務內透過付費付款支付的遊戲內容屬於會員的帳號資訊，可藉由該帳號登入行動裝置中使用，惟臨時會員僅可於下載或安裝應用程式的設備中使用。\n\u2461\t若於購買時有另外明確表示透過付費付款所提供的遊戲內容使用期間時，則按照該使用期間辦理。惟若有根據第15條第2項造成服務中斷情形，則無限定期間的遊戲內容使用期間為直到服務中斷公告時所公告的服務中斷日止。\n\u2462\t於服務內藉由其他遊戲內容交換或使用遊戲內容時所消耗的遊戲內容（下稱「遊戲財產」），是可透過付費付款進行提供，或根據使用服務進行免費提供。遊戲財產會優先使用透過付費付款所提供的物件，惟若服務內有另外指定使用的優先順序時則不在此限。\n\n第20條（限制使用服務）\n\u2460\t會員不得做出違反第10條會員義務的行為，若有做出該行為時，本公司可根據下列各款的分類，進行限制會員使用服務、刪除相關資訊（文章、相片、影片等）與包含其他處置在內的限制使用措施，造成限制使用措施的會員具體違反義務事由與程序，則根據第21條第1項規定於各款遊戲的營運政策中。\n1.\t限制部分權限：於一定期間限制聊天、遊戲資訊初始化等固定權限\n2.\t角色使用限制：於一定期間或永久限制使用會員的角色\n3.\t帳號使用限制：於一定期間或永久限制使用會員的帳號\n4.\t會員使用限制：於一定期間或永久限制使用會員的遊戲服務\n\u2461\t當第1項的限制使用為正當的情況下，本公司不會賠償因限制使用導致會員蒙受的損害。\n\u2462\t在完成符合下列各款問題的調查前，本公司可停止該帳號的使用服務。\n1.\t於收到帳號被駭入或被盜用的正當申訴時\n2.\t被懷疑為非法程式使用者、工作室等違法行為者時\n3.\t反覆以退款、商品未發送為由而被懷疑濫用付款機制時\n4.\t其他相當於上述各款的事由而有必要針對使用服務做出暫時處置時\n\u2463\t於第3項的調查完成後，若有透過付費付款所提供的遊戲內容，則延長相當於停止時間的會員使用時間，或是補償等值的遊戲內容等。惟若會員有符合第3項各款的事由時則不在此限。\n\n第21條（針對限制使用與提出異議的事由與程序）\n\u2460\t本公司將斟酌違反內容、程度、次數、結果等各種情況後，根據第20條第1項造成限制使用措施的具體事由與程序制定營運政策。\n\u2461\t若本公司有進行第20條第1項的限制使用措施情形，則會事前向會員通知下列各款事項，並於服務內公告。惟若有不得已情形，可於事後通知。\n1.限制使用事由\n2.限制使用類型與期間\n3.針對限制使用的異議申請方法\n\u2462\t若會員不服本公司的限制使用措施時，應自通知日起15天內以書面、電子文件等方式，向本公司提交填寫不服本公司限制使用的理由之異議申請書。\n\u2463\t本公司於收到第3項的異議申請日起的15天內，需以書面、電子文件等方式針對會員的不服理由進行回覆，並採取相應措施。惟若本公司難以於15天內進行回覆時，將通知會員相關事由和處理時間。";
                if (index == 2)
                    return
                        "\n\n第22條（付款）\n\u2460\t針對遊戲內容購買價格的收取及繳納，原則上是依行動電信業者或應用程式商店業者等規定的政策及方式而定，此外，每種付款方式的限額可能根據本公司、應用程式商店業者、付款商家規定的政策或政府方針制定或受到調整。\n\u2461\t若以外幣支付遊戲內容的購買價格時，可能會因匯率、手續費等造成實際請款的金頶和服務商店中所標示的價格相異的情況。\n\n第23條（退款）\n\u2460\t和本公司簽訂遊戲內容購買相關契約的會員，可於購買契約日和遊戲內容可使用日中較晚之日起7天內，在不需負擔額外手續費／違約金的情況下申請退款。\n\u2461\t若會員有符合下列各款情形，則不得在違背本公司的意願下根據第1項申請退款，惟若是以可拆分的遊戲內容所組成的購買契約，且可拆分的遊戲內容中不符合下列各款時，其剩餘的部分則不在此限。\n 1.購買後可立刻使用或套用的遊戲內容\n 2.有提供額外優惠時而使用該額外優惠的遊戲內容\n 3.將拆封行為視為使用或對拆封時會決定效用的遊戲內容進行拆封行為時\n\u2462\t若有根據第2項各款的規定而無法申請退款的遊戲內容，本公司會將該事實明確標示於會員可輕易得知的地方，並提供該遊戲內容的試用商品（允許限時使用、提供體驗等），如在提供上有困難時，則給予遊戲內容相關資訊並採取措施，讓會員在申請退款的權利行使上不會受到妨礙。惟若本公司未採取這些措施時，即使有第2項各款的申請退款限制事由規定，會員仍可申請退款。\n\u2463\t即使有第1項和第2項規定，若會員購買之付費遊戲內容的內容物和標示、廣告的內容物不同，或和履行的契約內容有不同，則會員可於該遊戲內容的購買日或可使用日起的3個月內、該事實的得知日或從可得知日起的30天內申請退款。\n\u2464\t若會員欲申請退款時，本公司可透過應用程式商店業者查看購買明細，此外，本公司為查看會員的正當取消事由，可能會透過由會員處取得的資訊對會員進行聯絡，且可能要求提供額外的證明資料。\n\u2465\t若有根據第1項及至第4項的規定造成申請退款情形，本公司應立即回收會員的付費遊戲內容，並於三個工作天內退還款項，此時若有延遲退款時，本公司應核算該延遲期間乘以「電子商務交易等中的消費者保護有關法規」和同法施行細則第21條之3規定的利率來支付延遲利息。\n\u2466\t若未成年者有於行動裝置簽訂遊戲內容購買契約情形，本公司將向其告知若未經法定代理人同意，未成年者本人或其法定代理人可取消該契約的內容；若未成年者未經法定代理人的同意簽訂購買契約時，則未成年者本人或其法定代理人可向本公司取消該契約，惟若未成年者是以其法定代理人規定的範圍並允許其處分的財產來購買遊戲內容，或未成年者透過欺騙使人相信自己是成年人，或使人相信自己取得法定代理人的同意時，則不得取消。\n\u2467\t遊戲內容購買契約的當事者是否為未成年者，應根據付款的行動裝置、執行付款者的資訊、付款方式的登記人等進行判斷，此外，本公司為查明是否為正當取消，可要求提交能夠證明其為未成年者與法定代理人的文件。\n\n第24條（誤繳納金的退款）\n\u2460\t若有發生誤繳納金情形，本公司將退還誤繳納金予會員，惟誤繳納金並非由於本公司的故意或過失，而是由於會員的過失所導致時，則退款時所需的實際費用將由會員負擔。\n\u2461\t付費付款會根據應用程式商店業者提供的付款方式而定，若於付款過程中發生誤繳納金時，應向本公司或應用程式商店業者要求退款，惟本公司亦可能根據應用程式商店業者的政策、系統，要求應用程式商店業者履行必要的退款程序。\n\u2462\t因下載應用程式或使用網路服務而產生的通訊費用（通話費、數據費等），可能會被排除於退款對象之外。\n\u2463\t退款會按照使用服務的行動裝置的營運系統種類，根據應用程式商店業者或本公司的退款政策辦理。\n\u2464\t若是會員於使用服務時免費取得而未透過付費付款，或是本公司透過內部或對外合作活動等免費提供的遊戲內容，則排除於退款對象之外。\n\u2465\t本公司為處理誤繳納金的退款，可能會透過由會員處取得的資訊對會員進行聯絡，且可能要求提供必要的資訊。\n\n第25條（解除契約）\n\u2460\t若會員有意解除使用契約時，會員本人可使用服務內選單或透過客服中心申請會員註銷，註銷完成時，會員的遊戲資訊（分數、角色、道具、遊戲幣等）皆會被刪除且無法復原。刪除應用程式或解除和合作服務的連動等不被視為解除使用契約。\n\u2461\t若會員做出本條款和基於此的營運政策等禁止行為而發生無法維持本契約的重大事由時，本公司將於相應的期限前催告，並可於規定期限中止使用服務或解除使用契約。\n\u2462\t根據第1項與第2項的退款與損害賠償，按照「遊戲內容用戶保護方針」辦理。\n\u2463\t為保護離最近使用服務日連續1年內未使用本公司服務的會員（下稱「休眠帳號」）的個人資訊，本公司可解除使用契約並對會員的個人資訊採取銷毁等的措施，此時會於措施日的30天前為止通知會員本公司將採取解除契約、銷毁個人資訊等措施的事實與即將銷毁的個人資訊等。\n\n第26條（損害賠償）\n\u2460\t若本公司或會員有因違反本條款而令對方遭受損害情形，則有責任負起該損害的賠償，惟若無存在故意或過失的情形時則不在此限。\n\u2461\t本公司和個別服務供應者簽訂合作契約並針對會員提供個別服務，若會員在同意個別服務使用條款後，有因歸責個別服務供應商的事由而發生損害情形，則個別服務供應商應負相關損害責任。\n\n第27條（本公司的免責）\n\u2460\t若有因自然災害或相當於此的不可抗力因素導致無法提供服務情形，則本公司概不負提供服務的相關責任。\n\u2461\t針對因服務用的設備維修、更換、定期維護、工程等其他相當於此的事由導致的損害，本公司概不負相關責任，惟由於本公司存在故意或過失情形時則不在此限。\n\u2462\t針對因會員故意或過失導致使用服務問題，本公司概不負相關責任，惟若會員有不得已或正當事由時則不在此限。\n\u2463\t針對會員刊登和服務有關的資訊或資料等的可靠度、正確性等，除非存在故意或重大過失，否則本公司概不負責。\n\u2464\t針對會員因和其他會員或他人以服務為媒介發生的交易或糾紛，本公司沒有介入的義務，且概不負由此導致的損害責任。\n\u2465\t針對會員因使用免費提供的服務而對會員造成損害的部分，本公司概不負相關責任，惟由於本公司存在故意或重大過失情形時則不在此限。\n\u2466\t針對會員因使用服務未獲得預期的利益或有喪失的東西，本公司概不負相關責任。\n\u2467\t針對會員遊戲資訊（經驗值、等級、道具、遊戲幣等）的損失，本公司概不負相關責任，惟由於本公司存在故意或重大過失情形時則不在此限。\n\u2468\t針對因會員未控管行動裝置的密碼設定功能、應用程式商店提供的密碼設定功能等導致出現第三者付款，本公司概不負相關責任，惟由於本公司存在故意或過失情形時則不在此限。\n\u2469\t針對因變更行動裝置、更改手機電話號碼、升級與變更作業系統（OS）、國外漫遊、變更電信商等導致無法使用全部或部分遊戲內容的功能時，本公司概不負相關責任，惟由於本公司存在故意或過失情形時則不在此限。\n\u246a\t若會員刪除本公司提供的遊戲內容或帳號資訊時，本公司概不負相關責任，惟由於本公司存在故意或過失情形時則不在此限。\n\u246b\t針對臨時會員使用服務而導致的損害發生，本公司概不負相關責任，惟由於本公司存在故意或過失情形時則不在此限。\n\n第28條（會員通知）\n\u2460\t本公司在向會員進行通知時，可能透過會員的電子郵件、電子筆記本、服務內訊息、LMS／SMS等方式提供。\n\u2461\t本公司在向全體會員進行通知時，可能藉由於遊戲服務內公告7天以上，或以彈出式視窗來取代第1項的通知。\n\n第29條 審判權與準據法\n\u2460\t本條款是受到大韓民國法律的約束和解釋，若本公司和會員之間有因發生糾紛而提起訴訟情形，則依法令規定程序的法院作為管轄法院。\n\n第30條（會員的投訴處理與糾紛排除）\n\u2460\t考量到會員的便利性，本公司會於遊戲服務內或該載入畫面中向會員說明提出意見或客訴的方法，且本公司會配置處理這些會員意見或客訴的專屬人力。\n\u2461\t若本公司認為會員提出的意見或客訴是正當且客觀時，則會於合理的期間內做出迅速的處理，惟若有需要進行長時間的處理時，將於遊戲服務內公告或根據第28條第1項通知會員需要長時間處理的事由和處理時間。\n\u2462\t若本公司和會員之間發生糾紛而由第三方的糾紛調解機關進行協調時，本公司會如實舉證對會員做出的限制使用等措施事項，並接受調解機關的調解。";
                break;

            case Language.SC:
                if (index == 0)
                    return
                        "CookApps移动服务使用条款\n包括同意接收广告性信息\n \n\n第1条 目的\n本条款的目的在于，对与CookApps株以下称为“公司”通过移动设备提供的所有游戏服务及其附属的网络、网站、其他服务以下称为“服务”的使用相关的公司与会员间的权利和义务、责任事项以及其他所需事项作出规定。\n \n第2条 术语定义\n\u2460\t本条款中使用的术语定义如下。\n1.\t“会员”是指根据本条款签订使用合同，使用公司提供的服务的人员。\n2.\t“临时会员”是指账户信息未与外部账户绑定或未得到认证，通过访客登录模式使用服务的会员。\n3.\t“移动设备”是指可通过网络下载内容或进行安装使用的设备。例如手机、智能手机、便携式信息终端机PDA、平板等。\n4.\t“账户信息”是会员的会员号和外部账户信息、设备信息、昵称、头像、好友目录等会员向公司提供的信息以及游戏使用信息角色信息、道具、等级等、使用费用结算信息等的统称。\n5.\t“内容”是指公司以数字方式制作的供移动设备使用的与服务的提供相关的收费或免费的所有内容游戏及网络服务、应用程序、游戏币、游戏道具等。\n6.\t“收费结算”是指为购买或使用服务内的内容等，通过公司认可结算企业进行结算的行为。\n7.\t“公开市场”是指为支持在移动设备中安装应用程序并进行收费结算而建立的电子商务环境。\n8.\t“合作服务”是指公司通过与Kakao等其他移动平台服务公司的合作提供的服务，是为支持利用合作移动平台的入会信息、头像等在移动设备中使用服务而提供的个别或全部服务。\n9.\t“结算企业”是指提供信用卡、手机结算等可在公开市场中使用的电子支付方式的企业。\n10.\t“应用程序”是指为使用公司提供的服务而通过移动设备下载或安装使用的所有程序。\n11.\t“游戏服务”作为公司提供的服务之一，是指会员在移动设备中运行的游戏及其附属服务。\n\u2461\t关于本条款中使用的术语的定义，除本条 第1款规定的术语外，以相关法令及各服务政策的规定为准，未作规定的，以商业惯例为准。\n \n第3条 公司信息等的提供\n为便于会员了解，公司将以下事项标示于游戏服务内。但是，对于个人信息处理方针与条款，可使会员通过连接界面进行查看。\n1.商号及代表人姓名\n2.营业场所地址包括会员投诉处理的地址\n3.电话号码，电子邮件地址\n4.营业证号\n5.通信销售业申报编号\n6.个人信息处理方针\n7.服务使用条款\n \n第4条 条款的效力及变更\n\u2460\t公司将本条款的内容发布于游戏服务内或其连接界面以供会员查看。此时，对于本条款内容中的服务中断、撤回认购、退款、合同解除、公司免责事项等重要内容，以粗体、颜色、符号等进行明确标示或通过另外的连接界面等进行处理，以便于会员查看。\n\u2461\t公司修订条款时，标明适用日期及修订内容、修订理由等，至少从适用日的7日前起发布于游戏服务内或其连接界面，向会员公布。但是，当变更的内容不利于会员或为重大事项变更时，则在适用日的30日前按与正文相同的方法进行公布，并按第28条 第1款的方法向会员进行通知。此时，对修订前的内容与修订后的内容进行明确比较以便于会员了解。\n\u2462\t公司修订条款时，在公布修订条款后确认会员是否同意修订条款的适用。公司进行第2款的公布或通知时，也一并公布或通知关于若未表示同意或拒绝则视作同意的内容，截至本条款施行日，若会员未表示拒绝，则可视作其同意修订条款。会员不同意修订条款时，公司或会员可解除服务使用合同。\n\u2463\t公司采取措施以支持会员与公司就本条款的内容进行询问及答复。\n\u2464\t公司可在不违反《电子商务等中的消费者保护相关法》、《条款管制相关法》、《游戏产业振兴相关法》、《信息通信网使用促进及信息保护等相关法》、《内容产业振兴法》等相关法令的范围内修订本条款。\n \n第5条 使用合同的签订及适用\n\u2460\t使用合同的签订流程为，想要成为会员的人员以下称为“入会申请者”同意本条款的内容后，提交服务使用申请，公司对该申请予以准许。\n\u2461\t公司原则上准许入会申请者的申请。但是，对于符合以下任意一项的使用申请，公司可拒绝。\n1.虚假填写使用申请书内容或不满足使用申请条 件\n2.在公司不提供服务或未决定提供服务的国家以非正常或间接的方法提交使用申请\n3.以《游戏产业振兴相关法》等现行法令禁止的行为为目的提交使用申请\n4.以危害社会治安或公序良俗为目的或者以危害公司利益为目的进行申请\n5.意图将服务使用于不正当用途\n6.意图以追求营利为目的而使用服务\n7.通过公司限制使用服务的移动设备、程序等提交使用申请\n8.因其他与各项相当的事由而被判断不适合准许\n\u2462\t在符合以下任意一项的情况下，在该事由消除之前，公司可保留准许。\n1.公司的设备无余裕或难以支持特定移动设备或存在技术性障碍\n2.存在服务或结算方式的障碍等技术上的障碍\n3.因其他与上述各项相当的事由而被判断难以对使用申请予以准许\n\u2463\t会员完成条款同意程序以及输入使用服务所需的信息后，若不存在保留准许或拒绝事项，则应即时提供服务。但是，当事后确认第2款中的事项时，可根据本条款的规定采取限制使用或解除合同的措施。\n\u2464\t公司为了用户的便利，可提供关于游戏服务的临时会员功能。当在使用临时会员功能的过程中出现以下各项情况时，可能会发生账户信息被删除或无法确认记录的问题，通过临时会员功能使用的游戏服务的账户信息可能无法在之后进行绑定或转移。此时，公司不保障账户信息的复原，不负有对此进行补偿及损失赔偿的责任。但是，公司故意或因重大过失而造成的情况除外。\n1.变更移动设备\n2.对移动设备进行改造或重置\n3.在移动设备中删除应用程序等内容的全部或一部分\n \n第6条 条款外准则\n对于本条款未规定的事项和本条款的解释，以《电子商务等中的消费者保护相关法》、《条款管制相关法》、《游戏产业振兴相关法》、《信息通信网使用促进及信息保护等相关法》、《内容产业振兴法》等相关法令或商业惯例为准。\n \n第7条 运营政策\n\u2460\t可将条款的适用所需的事项和条款中规定具体范围进行委任的事项定为游戏服务运营政策以下称为“运营政策”。\n\u2461\t公司在游戏服务内或其连接界面发布运营政策的内容以供会员查看。\n\u2462\t修订运营政策时，按照第4条 第2款的程序进行。但是，当修订内容符合以下任意一项时，按第2款的方法进行事先公布。\n 1.修订对条款中规定具体范围进行委任的事项\n 2.修订对与会员的权利、义务无关的事项\n 3.修订运营政策的内容与条款规定的内容无根本性差异，在会员可预测的范围内对运营政策\n \n第8条 个人信息的保护及使用\n\u2460\t公司根据相关法令规定努力保护会员的个人信息，对于个人信息的保护及使用，以相关法令及公司的个人信息处理方针为准。但是，公司提供的服务以外的绑定服务不适用公司的个人信息处理方针。\n\u2461\t鉴于服务的特性，可能会公开与会员的个人信息无关的昵称、角色照片、状态信息等自我介绍的内容。\n\u2462\t除有关国家机关等根据相关法令提出要求的情况外，未经本人同意，公司不会将会员的个人信息提供给他人。\n\u2463\t对于因会员的归责事由而泄露的会员的个人信息或账户信息等引起的损失，公司不承担责任。\n \n第9条 公司的义务\n\u2460\t公司秉持诚信原则遵守相关法令及本条款规定的权利的行使及义务的履行。\n\u2461\t公司为保护个人信息包括信用信息以确保会员安全地使用服务，应具备安保系统，并公布并遵守个人信息处理方针。除本条款及个人信息处理方针规定的情况外，公司不得向第三方公开或提供会员的个人信息。\n\u2462\t当在为提供持续、稳定的服务而进行的改善作业中产生设备障碍或数据等丢失、损坏时，若无自然灾害、紧急事态或以当前技术无法解决的障碍或缺陷等不得已的事由，则公司立即尽最大努力进行维修或复原。\n \n第10条 会员的义务\n\u2460\t当会员进行与公司提供的服务的使用相关的以下各项行为时，可采取公司内部规定中的账户措施。\n1.\t进行使用申请或变更会员信息时填写虚假内容或使用他人信息的行为\n2.\t疑似通过非公司提供的服务或非正常的方法进行或试图进行游戏信息账号、角色、道具、游戏币等的获取、使用、买卖、赠送、转让的行为\n3.\t冒充公司职员或运营者或盗用他人名义发帖或发送邮件的行为，冒充他人或虚称与他人的关系的行为\n4.\t盗用他人的信用卡、有/无线电话、银行账户等购买内容的行为，不正当使用其他会员的账号及密码的行为\n5.\t擅自收集、保存、发布或传播其他会员的个人信息的行为\n6.\t进行或诱导进行赌博等投机行为的行为，对淫秽、低俗的信息进行交流、发布或提供淫秽网站链接的行为，向他人发送或传播引发羞耻感、厌恶感或恐惧感的语言、声音、文字、图片、照片或视频的行为等不健康地使用服务的行为\n7.\t擅自将服务使用于营利、营业、广告、宣传、政治活动、选举运动等原用途以外的用途的行为\n8.\t擅自对使用公司的服务所获取的信息进行复制、传播、散布或将其使用于商业用途的行为，恶意利用已知或未知的漏洞使用服务的行为\n9.\t欺瞒他人获取利益的行为，对他人造成与公司的服务使用相关的危害的行为\n10.\t侵害公司或他人的知识产权或肖像权的行为，损害他人名誉或对他人造成损失的行为\n11.\t故意发送、发布、传播或使用法令禁止发送或发布的信息计算机程序或以妨碍、破坏计算机软件、硬件或电子通信设备的正常运转为目的研发的病毒、计算机代码、文件、程序等的行为\n12.\t未经公司特别授权变更应用程序或在应用程序上追加、插入其他程序，或者对服务器进行非法入侵或反向分析，或者泄露或变更源代码或程序数据，或者构建另外的服务器，或者任意变更、盗用网站的一部分以冒充公司的行为\n13.\t对符合第11项至第12项的软件、应用程序等进行或试图进行使用、传播的行为\n14.\t支付金钱等代价要求他人进行游戏等代练等的行为\n15.\t其他违反相关法令或违背公序良俗等社会观念的行为\n\u2461\t会员账户及移动设备的管理责任由会员承担，不得允许他人使用。对于因移动设备管理不善或允许他人使用而造成的损失，公司不承担责任。\n\u2462\t会员应设置并管理结算密码功能等的安全措施，以防止在各公开市场中的不正当结算。对于因会员的疏忽而导致的损失，公司不承担责任。\n\u2463 公司可规定以下各项行为的具体内容，会员应当遵守。\n1.会员的账户名称、角色名称、公会名称、其他游戏内使用的名称\n2.聊天内容和方法\n3.留言板等服务使用方法\n4.合作服务政策等其他所需事项\n \n第11条 提供服务\n\u2460\t公司即时向根据第5条 的规定完成使用合同的会员提供服务。但是，对于部分服务，可根据公司需要从指定的日期起提供服务。\n\u2461\t公司向会员提供服务时，包括本条款规定的服务在内，可同时提供其他附加服务。\n\u2462\t公司可区分会员等级，细分使用时间、使用次数、提供服务的范围等，分等级供会员使用。";
                if (index == 1)
                    return
                        "\n\n第12条 使用服务\n\u2460\t游戏服务在根据公司营业方针规定的时间段内提供。公司在游戏服务内或公布事项中以适当的方法说明服务提供时间。若无特别标示或公布，则基本上为24小时提供。\n\u2461\t不论第1款的规定，在以下各项情况下，公司可暂停全部或部分服务。此时，公司事先在应用程序的初始界面或游戏服务内公布暂停事由和时间。但是，当存在无法事先公布的不得已状况时，可事后公布。\n1.\t系统定期检查、服务器的增设及更换、网络的不稳定等系统运营所需的情况\n2.\t停电、服务设备障碍、服务使用暴涨、基础通信运营商的设备维修或检查等导致无法提供正常服务的情况\n3.\t发生战争、事变、自然灾害或与之相当的国家紧急事态等公司无法控制的状况的情况\n\u2462\t公司利用移动设备专用程序或网络提供服务。会员可下载并安装应用程序或利用网络免费或付费使用服务。\n\u2463\t对于收费内容，支付相应服务标明的费用才能进行使用。通过网络下载应用程序或使用服务时，可能会产生相应移动通信公司规定的另外的费用。\n\u2464\t对于通过下载并安装的应用程序或网络服务进行使用的服务，根据移动设备或移动通信公司的特性进行提供，移动设备变更、号码变更或海外漫游时，游戏服务的全部或部分功能可能无法使用，此时公司不承担责任。\n\u2465\t通过下载并安装的应用程序或网络进行使用的服务支持后台操作。此时，根据移动设备或移动通信公司的特性，可能会产生追加费用，对于与之相关的事项，公司不承担责任。\n\u2469 不论第1款的规定，若相关法令、商家团体自律遵守规约等以特定时间或方法禁止或限制服务的提供，则服务可能不被提供，对于与之相关的事项，公司不承担责任。\n \n第13条 合作服务\n\u2460\t合作服务是可与使用其他移动平台Kakao等的其他会员一起使用的服务。\n\u2461\t使用服务之前，会员需同意包括移动平台的个人简介在内的服务的提供所需的个人信息的提供及使用。若不同意，则服务的使用可能会存在限制。\n\u2462\t公司可通过合作服务提供多项服务。加入多个服务的会员想要停止使用服务时，需根据加入的服务单独进行解除退出会员申请。\n\u2463\t合作服务是利用该服务的会员信息进行提供的服务，因此，当会员丧失各合作服务的会员资格或退出会员时，可能无法正常提供服务。\n\u2464\t删除安装的应用程序时，会员的账户信息可能会被删除，请事先确认之后再进行删除。\n \n第14条 社区服务\n\u2460\t社区服务是指公司为促进用户们自由交换意见、增进友谊而提供的留言板等的服务。\n\u2461\t会员可绑定合作服务账户或通过其他公司提供的方法使用社区服务。\n\u2462\t为确保服务的顺利运营，会员加入社区服务时，可能会向管理层公开会员信息。\n\u2463\t在社区服务与合作服务绑定的情况下，当会员丧失各合作服务的会员资格或退出会员时，可能无法正常提供社区服务。\n\u2464\t公司可将保护会员权益以及提供健全的社区服务所需的事项纳入运营政策内，或通过另外的政策作出规定，会员有义务遵守相关规定。公司以发布于服务或社区服务内或提供连接界面的方法向会员公布运营政策或另外的政策的内容，以供会员查看。\n \n第15条 服务的变更及中止\n\u2460\t公司可根据顺利提供服务所需的运营商或技术上的需求变更服务，变更前在服务内公布相应内容。但是，当需要进行修改漏洞、错误或紧急更新等不得已的变更时，或不属于重大变更时，可事后公布。\n\u2461\t当因营业转让、分立及合并等引起的营业的废止、游戏提供合同的结束、服务收益的明显恶化等经营上的重大事由而难以继续提供服务时，可中断全部服务。此时，在中断日期的30日前通过游戏服务初始界面或其连接界面公布中断日期、中断事由、补偿条 件等，并按第28条 第1款的方法向会员进行通知。\n\n第16条 信息的收集等\n\u2460\t公司可储存及保管会员之间的聊天等包括用户在服务内进行的纸条 、悄悄话等通信内容内容，该信息仅由公司保有。公司仅可在为了会员间的纠纷调解、民愿处理或游戏秩序的维持的情况下阅览该信息，第三方仅可在根据法令被授权的情况下可阅览该信息。\n\u2461\t公司或第三方根据第1款需阅览聊天等信息时，公司事先将阅览事由及范围告知相应会员。但是，当为了进行第10条 第1款中的禁止行为的调查、处理、确认或对该行为引起的危害进行补救而需要阅览该信息时，可事后告知。\n\u2462\t公司为了服务的顺利、稳定的运营以及质量的改善，可收集、运用除会员的个人信息以外的会员的移动设备信息设置、规格、操作系统版本、采用的通信公司的信息等。\n\u2463\t公司可以改善服务以及向会员介绍服务等为目的要求会员提供追加信息。对于该要求，会员可允许也可拒绝，公司在提出要求时，一并告知会员可拒绝该要求。\n \n第17条 广告的提供\n\u2460\t公司可在服务内刊登与服务的运营相关的广告。另外，仅限同意接收的会员，可以电子邮件、短信服务LMS/SMS、推送消息Push Notification等方法发送广告性信息。此时，会员可随时拒绝接收，当会员拒绝时，公司不发送广告性信息。\n\u2461\t可通过公司提供的服务内的网幅广告或链接等连接他人提供的广告或服务。\n\u2462\t根据第2款连接他人提供的广告或服务时，由于该领域提供的服务不属于公司的服务领域，因此公司不保障可靠性、稳定性等，对于由此引起的会员的损失，公司不承担责任。但是，公司故意或因重大过失导致容易产生损失或未采取防止损失的措施的情况除外。\n \n第18条 著作权\n\u2460\t公司制作的服务内的所有内容的著作权以及其他知识产权归公司所有。\n\u2461\t未经公司或提供商的事先同意，会员不得以复制、发送等方法包括编辑、公布、演出、分发、放映、改编重制等，下同。将使用公司提供的服务所获得的信息中知识产权归公司或提供商所有的信息使用于营利目的或允许他人使用。\n\u2462\t对于与服务内的内容包括角色、图片、音源等直接内容和服务相关信息等间接内容相关的包括会员或其他用户通过服务上传或发送的对话文本在内的交流内容、图片、音频以及所有资料及信息以下称为“用户内容”，会员允许公司以如下方法和条 件进行使用。\n1.\t对该用户内容进行使用、编辑形式的变更及其他变形可以公布、复制、演出、发送、分发、放映、改编重制等任何形式进行使用，不限使用时间和区域。。\n2.\t未经制作用户内容的用户的事先同意，公司不以营利为目的销售、出租、转让用户内容。\n\u2463\t对于未在服务内表现的内容或与服务无关的用户内容一般指留言板等中的帖子等实质上与游戏内的内容无关的发布内容，未经会员的明确同意，公司不进行使用，会员可随时删除这些用户内容，对著作物的权利和责任归会员本人所有。\n\u2464\t对于会员发布或登记的服务内的帖子，当判断符合第10条 第1款中的禁止行为时，公司无需事先通知，可对其进行删除、移动或拒绝登记。\n\u2465\t因发布于公司运营的留言板等中的信息而被侵害法律利益的会员可要求删除该信息或发布澄清内容。此时，公司迅速采取必要的措施，并向申请人发出通知。\n\u2466\t本条 在公司运营服务期间有效，即使退出会员，仍然持续适用。\n \n第19条 使用内容\n\u2460\t在服务内通过收费结算完成支付的内容归属于会员的账户信息，可在登录该账户的移动设备中进行使用。但是，对于临时会员的情况，仅可在下载或安装应用程序的设备中进行使用。\n\u2461\t关于通过收费结算提供的内容的使用期限，若购买时明确标注，则以该使用期限为准。但是，当根据第15条 第2款服务中断时，对于未定期限的内容的使用期限，截至发布服务中断公告时公布的服务的中断日。\n\u2462\t对于兑换为服务内的其他内容或使用内容时消耗的内容以下称为“游戏财物”，可通过收费结算或根据服务的使用无偿提供。使用游戏财物时，优先使用通过收费结算提供的部分。但是，服务中另外指定了使用顺序的情况除外。\n \n第20条 服务使用限制\n\u2460\t会员不得做出违反第10条 中的会员义务的行为，做出相应行为时，公司可采取包括以下各项中的会员的服务使用限制、删除相关信息文字、照片、视频等以及其他措施在内的使用限制措施。关于被采取使用限制措施的会员的具体义务违反事由及程序，根据第21条 第1款，在个别游戏的运营政策中作出规定。\n1.部分权限限制：限制一定时间内聊天限制，游戏信息重置等限制一定权限\n2.角色使用限制：一定时间或永久限制使用会员角色\n3.账户使用限制：一定时间或永久限制使用会员账户\n4.会员使用限制：一定期间或永久限制会员使用游戏服务\n\u2461\t当第1款的使用限制为正当措施时，对于会员因使用限制而遭受的损失，公司不进行赔偿。\n\u2462\t在完成对以下各项问题的调查之前，公司可停止该账户的服务使用。\n1.接到账户被非法入侵或被盗用的正当举报\n2.疑似非法程序使用者、作业场所等违法行为者\n3.因反复退款、商品未支付问题而疑似结算滥用\n4.因其他与上述各项相当的事由而需采取服务使用的临时措施\n\u2463\t完成第3款的调查后，对于通过收费结算提供的内容，按停止的时间延长会员的使用时间或以与之相当的内容等给予补偿。但是，当会员符合第3款各项的事由的情况除外。\n \n第21条 使用限制及提出异议的事由及程序\n\u2460\t对于第20条 第1款中的使用限制措施的具体事由及程序，公司根据违反行为的内容、程度、次数、结果等各种情况，在运营政策中作出规定。\n\u2461\t公司采取第20条 第1款中的使用限制措施时，事先向会员通知以下各事项，并在服务内公布。但是，在不得已的情况下可事后通知。\n1.使用限制事由\n2.使用限制类型及期限\n3.对使用限制的异议申请方法\n\u2462\t会员对公司的使用限制措施不服时，应在自通报日起的15日内以书面文件、电子文件等方法向公司提交描述对公司的使用限制不服的理由的异议申请书。\n\u2463\t公司在自第3款中的异议申请接收日起的15日内以书面文件或电子文件等方法对会员的不服理由作出答复，并采取相应措施。但是，公司难以在15日内作出答复时，向会员通报事由和处理日程。\n \n第22条 结算货款\n\u2460\t关于购买内容的款项的征收与缴纳，原则上以移动通信公司或公开市场商家等规定的政策或方法为准。另外，关于各结算方式的限度，可根据公司、公开市场商家、结算企业规定的政策或政府方针进行设定或调整。\n\u2461\t以外币结算内容的购买款项时，由于汇率及手续费等，实际征收金额可能与服务商店等中标示的价格有所差异。";
                if (index == 2)
                    return
                        "\n\n第23条 撤回认购\n\u2460\t与公司签订关于内容购买合同的会员可在自购买合同日与内容可使用日中较迟的日期起的7日内撤回认购，无需承担手续费、违约金等。\n\u2461\t符合以下各项时，会员不得违反公司意愿，进行第1款中的认购撤回。但是，对于由可分内容构成的购买合同，可分内容中不符合以下各项的剩余部分除外。\n 1.购买后即时使用或适用的内容\n 2.提供追加优惠时，使用了该追加优惠的内容\n 3.存在可将开封行为视作使用或开封时决定效用的内容的开封行为\n\u2462\t对于根据第2款各项规定不可撤回认购的内容，公司将该事实明确标示于便于会员查看的位置，提供该内容的试用商品允许限时使用、提供体验等，或者难以提供试用商品时，提供内容的相关信息，从而防止会员的认购撤回的权利行使受到妨碍。若公司未采取这种措施，不论第2款各项的认购撤回限制事由，会员可撤回认购。\n\u2463\t不论第1款和第2款，当会员购买的收费内容与标示、广告内容不一致或其履行方式与合同内容不一致时，会员可在自该内容的购买日或可使用日起的3个月内，在自得知该事实之日或可得知之日起的30日内撤回认购。\n\u2464\t会员想要撤回认购时，公司可通过公开市场商家确认购买明细。另外，公司为确认会员的正当撤回事由，可通过会员提供的信息与会员联系，要求提供追加凭证。\n\u2465\t根据第1款至第4款的规定进行认购撤回时，公司立即回收会员的收费内容，在3个营业日内退还款项。此时，若公司逾期退款，则对应该逾期时间支付按《电子商务等中的消费者保护相关法》及同法施行令第21条 -3规定的利率计算得出的逾期利息。\n\u2466\t当未成年人在移动设备中签订内容购买合同时，公司向其告知若未经法定代理人的同意，未成年人本人或法定代理人可撤销该合同，当未成年人未经法定代理人签订了购买合同时，未成年人本人或法定代理人可要求公司撤销该合同。但是，当未成年人以法定代理人规定范围内的允许使用的财产购买了内容时，或未成年人通过欺骗手段成功伪装为成年人或谎称经法定代理人同意时，不可撤销。\n\u2467\t关于内容购买合同的当事人是否为未成年人，以进行结算的移动设备、结算执行人信息、结算方式名义人等为依据进行判断。另外，公司为确认是否为正当撤销，可要求其提交能够证明其为未成年人以及法定代理人的文件。\n \n第24条 误缴款的退还\n\u2460\t当产生误缴款时，公司将误缴款退还给会员。但是，对于并非由公司故意或过失导致，而是因会员的过失而产生误缴款的情况，退款所需的实际费用由会员承担。\n\u2461\t收费结算以公开市场商家提供的结算方式为准，结算过程中产生误缴款时，应要求公司或公开市场商家退还。但是，根据公开市场商家的政策、系统，公司也可要求公开市场商家履行所需的退款程序。\n\u2462\t应用程序的下载或网络服务的使用引发的通信费话费、流量话费等可从退款对象中排除。\n\u2463\t关于退款，根据使用服务的移动设备的操作系统类型，按照公开市场商家或公司的退款政策进行。\n\u2464\t会员未进行收费结算，在服务使用中无偿获得的内容或公司通过内部或外部合作项目无偿提供的内容不属于退款对象。\n\u2465\t公司为处理误缴款的退还，可通过会员提供的信息联系会员，可要求提供所需信息。\n \n第25条 合同解除\n\u2460\t会员想要解除合同时，会员本人可利用服务内的菜单或通过客户中心申请退会，完成退会时，会员的游戏信息分数、角色、道具、游戏币等全部被删除，且不可复原。应用程序的删除或合作服务解除绑定等不被视作使用合同的解除。\n\u2461\t当发生会员做出本条款及其运营政策等禁止的行为等无法再维持本合同的重大事由时，公司可提前进行催告，设定期限，中止服务的使用或解除使用合同。\n\u2462\t关于第1款及第2款引起的退款及损失赔偿，按照《内容使用者保护方针》进行处理。\n\u2463\t公司为保护自最近一次使用服务之日起连续1年未使用公司服务的会员以下称为“休眠账户”的个人信息，可解除使用合同，采取销毁会员的个人信息等措施。此时，在措施日的30日前将决定采取解除合同、销毁个人信息等措施的事实以及即将销毁的个人信息等通知给会员。\n \n第26条 损失赔偿\n\u2460\t公司或会员违反本条款而对对方造成损失时，有责任赔偿损失。但是，不存在故意或过失的情况除外。\n\u2461\t公司与个别服务提供者签订合作合同，向会员提供个别服务时，在会员同意个别服务使用条款后，因个别服务提供者的归责事由而造成损失时，对于相关损失，由个别服务提供者承担责任。\n \n第27条 公司免责\n\u2460\t当由于自然灾害或与之相当的不可抗力因素导致无法提供服务时，公司不承担与服务提供相关的责任。\n\u2461\t对于由设备的维修、更换、定期检查、工程等以及其他与之相当的事由造成的损失，公司不承担责任。但是，公司故意或因过失导致的情况除外。\n\u2462\t对于会员故意或因过失导致的服务使用障碍，公司不承担责任。但是，会员有不得已的正当事由的情况除外。\n\u2463\t对于会员发布的与服务相关的信息或资料等的可靠性、准确性等，公司若非故意或无重大过失，则不承担责任。\n\u2464\t对于会员以服务为媒介与其他会员或他人发生的交易或产生的纠纷，公司无介入义务，对由此产生的损失不承担责任。\n\u2465\t对于会员产生的与免费提供的服务的使用相关的损失，公司不承担责任。但是，公司故意或因过失而导致的情况除外。\n\u2466\t对于会员使用服务后未获得或丧失期望的利益的情况，公司不承担责任。\n\u2467\t对于会员的个人信息经验值、等级、道具、游戏币等的损失，公司不承担责任。但是，公司故意或因过失而导致的情况除外。\n\u2468\t对于因会员不负责管理移动设备的密码设置功能、开放市场提供的密码设置功能等而发生的第三方结算。，公司不承担责任。但是，公司故意或因过失而导致的情况除外。\n\u2469\t对于因移动设备的变更、变更手机号码、操作系统OS的升级及变更、海外漫游、通信公司变更等导致内容的全部或部分功能无法使用的情况，公司不承担责任。但是，公司故意或因过失而导致的情况除外。\n\u246a\t对于会员删除公司提供的内容或账户信息的情况，公司不承担责任。但是，公司故意或因过失而导致的情况除外。\n\u246b\t对于使用临时会员服务而产生的损失，公司不承担责任。但是，公司故意或因过失而导致的情况除外。\n \n第28条 通知会员\n\u2460\t公司可通过会员的电子邮件地址、电子备忘录、服务内信息 、LMS/SMS等向会员发送通知。\n\u2461\t公司向全体会员发送通知时，可采取在游戏服务内发布7日以上或通过弹窗进行提示等方法，以此代替第1款的通知。\n \n第29条 审判权与准据法\n\u2460\t本条款受大韩民国法律约束并据此进行解释。当因公司与会员之间产生的纠纷而提起诉讼时，以法令所定程序中的法院为管辖法院。\n \n第30条 解决会员的投诉处理及纠纷\n\u2460\t公司考虑到会员的便利，在游戏服务内或其连接界面中对会员提出意见或投诉的方法进行说明。\n\u2461\t公司从客观角度认可会员提出的意见或投诉的正当性时，迅速在合理期限内对此进行处理。但是，当处理所需时间较长时，在游戏服务内公布需要长时间处理的事由和处理日程，或根据第28条 第1款发送通知。\n\u2462\t当公司与会员之间产生纠纷，由第三方纠纷调解机构进行调解时，公司可据实证明对会员采取的使用限制等措施事项，并遵从调解机构的调解。";
                break;
            default:
                if (index == 0)
                    return
                        "Terms of Service\n\nThes Terms of Service (“Terms”) are a legally binding agreement that governs “you” and “your” use of COOKAPPS.com and/or the games and applications offered by CookApps, Inc. and its affiliates (“COOKAPPS”) and accessed through third party web sites and mobile platforms (collectively, the “Service”). By using or accessing the Service, you agree to be bound by these Terms.\n\n1) Access to COOKAPPS Service\nSubject to your acceptance of these Terms, COOKAPPS grants to you a non-exclusive, non-transferable, revocable limited license to use and display the Service and related software (excluding source and object code) for your personal (or household) non-commercial use by any machine(s) of which you are the primary user. You agree not to use the Service for any other purpose, or to copy or distribute the content of the Service except as specifically allowed in this agreement.\nCOOKAPPS Reserves the right to change these Terms in any way and at any time. However, no amendment to these Terms shall apply to a dispute of which COOKAPPS had actual notice on the date of amendment.\nAny modifications to these Terms will be posted on www.COOKAPPS.com or within the Service. You agree that you will periodically check www.COOKAPPS.com for updates to these Terms. You agree that you will be considered to have been given notice of any modifications once we post them to www.COOKAPPS.com and that your continued use of the Service after such notice shall be deemed an acceptance of any changes.\nCOOKAPPS reserves the right discontinue the Service or to change the content of the Service in any way and at any time, with or without notice to you, without liability.\nYou agree to be bound by any application, forum, or game specific rules published within the Service.\nYour use of the Service is conditioned upon your compliance with these Terms and any use of the Service in violation of these Terms will be regarded as an infringement of COOKAPPS’s copyrights in and to the Service. COOKAPPS reserves the right to terminate your access to the service without notice if you violate these Terms.\nOur services are not directed at children under the age of 13 (or under the age of 16 in European countries). Children are not permitted to use our Service, and we do not knowingly collect any personal information from them. You must be at least 16 years old to access and/or use our website and/or games. If you are a minor over the age of 16, we recommend seeking consent from a parent or legal guardian before accessing and/or using our website or games. If you have not obtained permission from your parent(s) or guardian(s), you should not use our Service.\nYou may stop using our Service at any time and may request that we delete your Account at any time by following the instructions in our Privacy Policy. Unless applicable law requires otherwise, we are not required to provide refunds, benefits, or other compensation if you request deletion of your Account.\n\n2) Ownership of Intellectual Property\nUnless otherwise specified in writing, all materials that are part of the Service are owned, controlled, or licensed by COOKAPPS and are protected by law from unauthorized use. The entire contents of the Service are copyrighted under the United States copyright laws and/or similar laws of other jurisdictions. COOKAPPS, the COOKAPPS logos, and all game names and logos are trademarks of COOKAPPS and may not be used without the express written permission of COOKAPPS.\nYou do not acquire any ownership rights by using the Service, downloading material from or uploading material to the Service, or by purchasing any Subscriptions, Virtual Currency, or Virtual Goods.\nYou agree not to copy, redistribute, publish or otherwise exploit material from the Service, except as expressly permitted herein, without the express prior written permission of COOKAPPS.\nAll comments, feedback, suggestions, ideas, and other submissions (“Ideas”) disclosed, submitted, or offered to COOKAPPS in connection with the use of the Service shall be the exclusive property of COOKAPPS. You agree that unless otherwise prohibited by law COOKAPPS may use, sell, exploit and disclose the Ideas in any manner, without restriction and without compensation to you.\n\n3) In-Game Currencies/Goods\nThe Service may include a virtual, in-game currency (“Virtual Currency”) including, but not limited to coins, cash, or points, that may be purchased from COOKAPPS for “real world” money if you are a legal adult in your country of residence. The Service may also include virtual, in-game digital items (“Virtual Goods”) that may be purchased from COOKAPPS for “real world” money or for Virtual Currency, as well as paid subscriptions for Virtual Currency and/or Virtual Goods (“Subscriptions”) that may be purchased for “real world” money. Regardless of the terminology used, Virtual Currency, Virtual Goods, and Subscriptions may never be redeemed for “real world” money, goods or other items of monetary value from COOKAPPS or any other party.\nPayment for Subscriptions will be charged to your account at the point of purchase and for renewals will be taken within the 24 hours prior to the expiry of the then-current Subscription period. Your Subscription will automatically renew on a monthly-basis unless you turn off auto-renew via your platform settings at least 24 hours before the end of the then-current Subscription period. Subscriptions are linked to your platform account and cannot be transferred between platform accounts. You agree that sales of Subscriptions are final and that cancellation is not permitted during an active Subscription period.\nOther than a limited, personal, revocable, non-transferable, non-sublicenseable license to make use of the Subscriptions and use the Virtual Goods or Virtual Currency within the Service, you have no right or title in or to any such Virtual Goods or Virtual Currency appearing or originating in the Service, or any other attributes associated with use of the Service or stored within the Service.\nCOOKAPPS has the absolute right to manage, regulate, control, modify and/or eliminate such Subscriptions, Virtual Currency, and/or Virtual Goods as it sees fit in its sole discretion, and COOKAPPS shall have no liability to you or anyone for the exercise of such rights. However, if you have an active Subscription such changes will only take effect following the end of the then-current Subscription period, at which date your Subscription will automatically terminate.\nTransfers of Subscriptions, Virtual Currency and Virtual Goods are strictly prohibited except where explicitly authorized within the Service. Outside of the game, you may not buy or sell any Subscriptions, Virtual Currency, and/or Virtual Goods for “real world” money or otherwise exchange items for value. Any attempt to do so is in violation of these Terms and may result in a lifetime ban from the Service offered by COOKAPPS and possible legal action.\nYou agree that all sales of Virtual Goods and Virtual Currency are final. No refunds will be given, except in our sole and absolute discretion. Active Subscriptions cannot be cancelled during the Subscription period. All Virtual Goods and Virtual Currency are forfeited if your account is terminated or suspended for any reason, in COOKAPPS's sole and absolute discretion, or if COOKAPPS discontinues providing the Service.\n\n4) User Content\nThe Service may invite you to chat or participate in blogs, message boards, online forums and other functionality and may provide you with the opportunity to create, submit, post, display, transmit, perform, publish, distribute or broadcast content and materials to COOKAPPS and/or to or via the Service, including, without limitation, text, writings, photographs, graphics, comments, suggestions or personally identifiable information or other material (collectively 'User Content'). Any material you transmit to COOKAPPS will be treated as non-confidential and non-proprietary.\nYou agree that your User Content is wholly original to you and you exclusively own the rights to your User Content, including the right to grant all of the rights and licenses in these Terms without COOKAPPS incurring any third party obligations or liability arising out of its exercise of the rights thereto granted herein by you.\nYou grant to COOKAPPS the unrestricted, unconditional, unlimited, worldwide, irrevocable, perpetual fully-paid and royalty-free right and license to host, use, copy, distribute, reproduce, disclose, sell, resell, sublicense, display, perform, transmit, publish, broadcast, modify, make derivative works from, retitle, reformat, translate, archive, store, cache or otherwise exploit in any manner whatsoever, all or any portion of your User Content to which you have contributed, for any purpose whatsoever, in any and all formats; on or through any and all media, software, formula or medium now known or hereafter known; and with any technology or devices now known or hereafter developed and to advertise, market and promote same.\nCOOKAPPS has no obligation to monitor or enforce any intellectual property rights that may be associated with your User Content, but COOKAPPS does have the right to enforce such rights through any means it sees fit, including bringing and controlling actions on your behalf.\nCOOKAPPS has no obligation to accept, display, review, monitor, or maintain any User Content. We have the right to delete User Content from the Service without notice for any reason at any time. COOKAPPS may move, re-format, edit, alter, distort, remove or refuse to exploit User Content without notice to you and without liability; provided, however, that COOKAPPS reserves the right to treat User Content as content stored at the direction of users for which COOKAPPS will not exercise editorial control except to enforce the rights of third parties and the Content Restrictions set forth below when violations are brought to COOKAPPS's attention.\nYou acknowledge that you do not rely on COOKAPPS to monitor or edit the Service and that the Service may contain content which you find offensive and you hereby waive any objections you might have with respect to viewing such content.";
                if (index == 1)
                    return
                        "\n\n5) Posting on Other Web Sites\nYou are granted a limited revocable license to post images of your personal avatar and/or screen shot from your account, of a puzzle or your in-game home for example, within the Service and any other materials that COOKAPPS specifically gives you notice may be posted on other web sites, on your own personal web site or on a third party web site that permits posting of content at the direction of users provided that such third party web site is not commercially competitive to COOKAPPS, does not criticize or injure COOKAPPS,\ndoes not obtain any rights to such content other than a non-exclusive license to post it at your direction, and does not charge for access to such content or associated products, services or advertising with such content, so long as the web site where the link resides, and all other locations to which such site links, comply with all applicable laws and do not in any way abuse, defame, stalk, threaten or violate the rights of privacy, publicity, intellectual property or other legal rights of others or, in any way, post, publish, distribute, disseminate or facilitate any inappropriate, infringing, defamatory, profane, indecent, obscene, illegal/unlawful or otherwise objectionable information, topic, name or other material (an “Authorized Web Site”). All of COOKAPPS's rights and remedies are expressly reserved, and COOKAPPS may revoke this limited license, in whole or in part, upon notice. Conditions on Posting on Other Web Sites: Without limitation, the following terms and conditions apply to your posting of a copy of your avatar and/or screen shots on an Authorized Web Site:\nYou must a display a prominent link to the Service's homepage in connection with any of your use of Collaborative Content permitted hereunder, including, without limitation, in e-mails you are sending friends; and\nYou agree to include, and not remove or alter, COOKAPPS's trademark, copyright or other proprietary rights notices, as provided by COOKAPPS on the Service and within e-mail page(s), when displaying an avatar or images from a COOKAPPS game, and you agree to comply with usage guidelines that may be provided by COOKAPPS from time to time. You agree that all goodwill that arises in connection with your use of COOKAPPS's trademarks inures exclusively to COOKAPPS, and you agree not to challenge COOKAPPS's ownership or control of any COOKAPPS trademarks, nor use or adopt any trademarks that might be confusingly similar to such COOKAPPS trademarks.\n\n6) Usage Rules\nAs a condition of your use of and access to the Service, you agree to comply with these Usage Rules, which are provided as an example rather than as a limitation, and any application or game specific rules published within the Service.\nYou agree that your use of and conduct on the Service shall be lawful and your User Content will not:\n\ninclude any offensive comments that are connected to race, national origin, gender, sexual preference or physical handicap;\ninclude profanity or any obscene, indecent, pornographic, sexual or otherwise objectionable content or language;\ndefame, libel, ridicule, mock, disparage, threaten, harass, intimidate or abuse anyone;\npromote violence or describe how to perform a violent act\nviolate the contractual, personal, intellectual property or other rights of any party, or promote or constitute illegal activity; or\nbe in violation of these Terms or the game rules of conduct (collectively 'Content Restrictions').\nYou and your activities on the Service will not:\n\nreveal any personal information about another individual, including another person's address, phone number, e-mail address, credit card number or any information that may be used to track, contact or impersonate that individual;\nattempt to impersonate any other party;\ncreate user accounts by automated means or under false pretenses or mislead others as to the origins of your communications;\ntrick, defraud or mislead COOKAPPS and other users, especially in any attempt to learn sensitive account information such as passwords;\nmake improper use of COOKAPPS’s support services or submit false reports of abuse or misconduct;\nengage in any commercial activities, including, without limitation, any attempt to raise money for anyone or advertise or promote a product, service, website, pyramid scheme or other multi-tiered marketing scheme;\ndisparage, tarnish, or otherwise harm, in COOKAPPS's opinion, COOKAPPS and/or the Service;\nviolate these Terms or any local, state, federal or international law, rule or regulation or any other requirements or restrictions posted by COOKAPPS on the Service;\ndisseminate or transmit viruses, worms, Trojan horses, RATs, keyboard loggers, time bombs, spyware, adware, cancelbots or any other malicious or invasive code or program;\nupload or transmit (or attempt to upload or to transmit) viruses, Trojan horses or other material, including excessive use of capital letters and spamming (continuous posting of repetitive text) that interferes with any party's uninterrupted use and enjoyment of the Service and User Content or modifies, impairs, disrupts, alters or interferes with the use, features, functions, operation or maintenance of the Service, the User Content;\ncopy or adapt the Service’s software including but not limited to Flash, PHP, HTML, JavaScript or other code;\nreverse engineer, decompile, reverse assemble, modify or attempt to discover any software (source code or object code) that the Service create to generate web pages or any software or other products or processes accessible through the Service;\nupload or transmit (or attempt to upload or to transmit) any material that acts as a passive or active information collection or transmission mechanism, including, without limitation, clear graphics interchange formats ('gifs'), 1x1 pixels, web bugs, cookies or other similar devices (sometimes referred to as 'spyware,' 'passive collection mechanisms' or 'pcms');\nexcept as may be the result of standard search engine or Internet browser usage, use or launch, develop or distribute any automated system, including, without limitation, any spider, robot (or 'bot'), cheat utility, scraper or offline reader that accesses the Service, or use or launch any unauthorized script or other software;\ncover or obscure any notice, banner or advertisement on the Service;\ndisguise the source of your User Content or other information you submit to the Service or use tools which anonymize your internet protocol address (e.g. anonymous proxy) to access the Service;\ninterfere with or circumvent any security feature of the Service or any feature that restricts or enforces limitations on use of or access to the Service, Collaborative Content or the User Content;\nsell the Service or any part thereof including but not limited to Subscriptions, Virtual Currency, Virtual Goods, user accounts and access to the aforementioned in exchange for real currency or items of monetary value; or\nengage in cheating or any other activity deemed by COOKAPPS to be in conflict with the spirit or intent of the Service.\nCOOKAPPS does not control or endorse the content, messages or information found in User Content portions of the Service or external sites that may be linked to or from the games or their forums and, therefore, COOKAPPS specifically disclaims any responsibility with regard thereto.\n7) Privacy and Protection of Personal Information.\nCOOKAPPS respects the privacy of users of our Service. Information collected from you is subject to the pertinent social network’s policy. By making use of the Service, you may be granting your social network permission to share your e-mail address and any other personally identifiable information with COOKAPPS. Please see COOKAPPS’s Privacy Policy at www.COOKAPPS.com for more information on the collection and use of your information. You acknowledge and agree that this Privacy Policy, including, but not limited to, the manner in which COOKAPPS collects, uses and discloses your personally identifiable information, is incorporated and made part of these Terms. If you do not agree to each and every part of COOKAPPS's Privacy Policy, then you should not make use of the Service or submit any personally identifiable information through the Service. Questions regarding privacy issues should be directed to privacy@COOKAPPS.com.\n\n8) Account Responsibility\nThis Service is offered through various social networks. The Service is only available to persons who are registered members of the social network through which they access the Service and are in compliance with the policies or terms of use/service of that social network. In creating your account with a social network through which you will access the Service (“Account”), you agree to:\n\nprovide true, accurate, current and complete information about yourself (“Registration Data”); and\nmaintain and promptly update the Registration Data to keep it true, accurate, current, and complete.\nUsers that maintain more than one account on a social network may not access this Service from multiple accounts. If you provide any information that is untrue, inaccurate, not current or incomplete, or COOKAPPS has reasonable grounds to suspect that such information is untrue, inaccurate, not current or incomplete, COOKAPPS has the right to suspend or terminate your ability to participate in the Service and refuse any and all current or future use of the Service (or any portion thereof). COOKAPPS reserves the right to terminate any Account that has been inactive for at least 180 consecutive days.\n\n9) Disputes with Others\nWe reserve the right, but have no obligation, to monitor and/or manage disputes between you and other users of the Service. If you have a dispute with other users, you release COOKAPPS and hereby agree to indemnify COOKAPPS from claims, demands, and damages (actual and consequential) of every kind and nature, known and unknown, arising out of or in any way connected with such dispute.";
                if (index == 2)
                    return
                        "\n\n10) Disclaimers; Limitations; Waivers of Liability\nYOU EXPRESSLY AGREE THAT USE OF THE SERVICE IS AT YOUR SOLE RISK AND IS PROVIDED ON AN 'AS IS' BASIS WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF TITLE OR IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE (EXCEPT ONLY TO THE EXTENT PROHIBITED UNDER THE LAWS APPLICABLE TO TERMS OF USE WITH ANY LEGALLY REQUIRED WARRANTY PERIOD TO THE SHORTER OF THIRTY DAYS FROM FIRST USE OR THE MINIMUM PERIOD REQUIRED). WITHOUT LIMITING THE FOREGOING, NEITHER COOKAPPS NOR ITS AFFILIATES OR SUBSIDIARIES, OR ANY OF THEIR DIRECTORS, EMPLOYEES, AGENTS, ATTORNEYS, THIRD-PARTY CONTENT PROVIDERS, DISTRIBUTORS, LICENSEES OR LICENSORS (COLLECTIVELY, “COOKAPPS PARTIES”) WARRANT THAT THE SERVICE WILL BE UNINTERRUPTED OR ERROR-FREE.\nTO THE FULLEST EXTENT PERMITTED BY LAW, THE DISCLAIMERS OF LIABILITY CONTAINED HEREIN APPLY TO ANY AND ALL DAMAGES OR INJURY WHATSOEVER CAUSED BY OR RELATED TO USE OF, OR INABILITY TO USE, THE SERVICE UNDER ANY CAUSE OR ACTION WHATSOEVER OF ANY JURISDICTION, INCLUDING, WITHOUT LIMITATION, ACTIONS FOR BREACH OF WARRANTY, BREACH OF CONTRACT OR TORT AND THAT THE COOKAPPS PARTIES SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES IN ANY WAY WHATSOEVER ARISING OUT OF THE USE OF, OR INABILITY TO USE, THE SERVICE. YOU FURTHER SPECIFICALLY ACKNOWLEDGE THAT THE COOKAPPS PARTIES ARE NOT LIABLE, AND YOU AGREE NOT TO SEEK TO HOLD THE COOKAPPS PARTIES LIABLE, FOR THE CONDUCT OF THIRD PARTIES, INCLUDING OTHER USERS OF THE SERVICE AND OPERATORS OF EXTERNAL SITES, AND THAT THE RISK OF THE SERVICE AND EXTERNAL SITES AND OF INJURY FROM THE FOREGOING RESTS ENTIRELY WITH YOU.\nUNDER NO CIRCUMSTANCES WILL THE COOKAPPS PARTIES BE LIABLE TO YOU FOR MORE THAN THE AMOUNT YOU HAVE PAID COOKAPPS IN THE NINETY (90) DAYS IMMEDIATELY PRECEDING THE DATE ON WHICH YOU FIRST ASSERT ANY SUCH CLAIM.\n11) Indemnification\nYou agree to defend, indemnify and hold harmless the COOKAPPS Parties from and against all claims and expenses, including attorneys' fees and costs, arising out of your use of the Service and/or your breach or alleged breach of any term, condition, obligation, representation or warranty described in these Terms. You agree that the provisions in this paragraph will survive any termination of your account(s) or the Service.\n\n12) Governing Law/Waiver of Injunctive Relief\nThis Agreement and all aspects of the Service shall be governed by and construed in accordance with the internal laws of the Republic of Korea and governing contracts entered into and to be fully performed in the Republic of Korea Seoul Central District Court (i.e., without regard to conflict of laws provisions) regardless of your location. With respect to any disputes or claims not subject to informal dispute resolution or arbitration (as set forth below), you agree not to commence or prosecute any action in connection therewith other than in the Republic of Korea Seoul Central District Court, and you hereby consent to, and waive all defenses of lack of personal jurisdiction and forum non conveniences with respect to, venue and jurisdiction in Seoul, Republic of Korea.\nYou acknowledge that the rights granted and obligations made hereunder to COOKAPPS are of a unique and irreplaceable nature, the loss of which shall irreparably harm COOKAPPS and which cannot be replaced by monetary damages alone so that COOKAPPS shall be entitled to injunctive or other equitable relief (without the obligations of posting any bond or surety) in the event of any breach or anticipatory breach by you. You irrevocably waive all rights to seek injunctive or other equitable relief and agree to limit your claims to claims for monetary damages (if any).\nInformal Negotiations. To expedite resolution and control the cost of any dispute, controversy or claim related to these Terms ('Dispute'), you and COOKAPPS agree to first attempt to negotiate any Dispute (except those Disputes expressly provided below) informally for at least thirty (30) days before initiating any arbitration or court proceeding. Such informal negotiations commence upon written notice from one person to the other. You will send your notice to COOKAPPS Inc., ATTENTION: LEGAL DEPARTMENT.\nBinding Arbitration. If you and COOKAPPS are unable to resolve a Dispute through informal negotiations, either you or COOKAPPS may elect to have the Dispute (except those Disputes expressly excluded below) finally and exclusively resolved by binding arbitration. Any election to arbitrate by one party shall be final and binding on the other. YOU UNDERSTAND THAT ABSENT THIS PROVISION, YOU WOULD HAVE THE RIGHT TO SUE IN COURT AND HAVE A JURY TRIAL. The arbitration shall be commenced and conducted under the Commercial Arbitration Rules of the American Arbitration Association ('AAA') and, where appropriate, the AAA’s Supplementary Procedures for Consumer Related Disputes ('AAA Consumer Rules'), both of which are available at the AAA website www.adr.org. The determination of whether a Dispute is subject to arbitration shall be governed by the Federal Arbitration Act and determined by a court rather than an arbitrator. Your arbitration fees and your share of arbitrator compensation shall be governed by the AAA Rules and, where appropriate, limited by the AAA Consumer Rules. If such costs are determined by the arbitrator to be excessive, COOKAPPS will pay all arbitration fees and expenses. The arbitration may be conducted in person, through the submission of documents, by phone or online. The arbitrator will make a decision in writing, but need not provide a statement of reasons unless requested by a party. The arbitrator must follow applicable law, and any award may be challenged if the arbitrator fails to do so. Except as otherwise provided in this Agreement, you and COOKAPPS may litigate in court to compel arbitration, stay proceedings pending arbitration, or to confirm, modify, vacate or enter judgment on the award entered by the arbitrator.\nRestrictions. You and COOKAPPS agree that any arbitration shall be limited to the Dispute between COOKAPPS and you individually. To the full extent permitted by law, (1) no arbitration shall be joined with any other; (2) there is no right or authority for any Dispute to be arbitrated on a class-action basis or to utilize class action procedures; and (3) there is no right or authority for any Dispute to be brought in a purported representative capacity on behalf of the general public or any other persons.\nExceptions to Informal Negotiations and Arbitration. You and COOKAPPS agree that the following Disputes are not subject to the above provisions concerning informal negotiations and binding arbitration: (1) any Disputes seeking to enforce or protect, or concerning the validity of, any of your or COOKAPPS’s intellectual property rights; (2) any Dispute related to, or arising from, allegations of theft, piracy, invasion of privacy or unauthorized use; and (3) any claim for injunctive relief.\n\n13) Waiver/Severability\nThe failure of COOKAPPS to require or enforce strict performance by you of any provision of these Terms or to exercise any right under them shall not be construed as a waiver or relinquishment of COOKAPPS's right to assert or rely upon any such provision or right in that or any other instance.\nYou and COOKAPPS agree that if any portion of these Terms, except any portion of section 12, is found illegal or unenforceable, in whole or in part by any court of competent jurisdiction, such provision shall, as to such jurisdiction, be ineffective to the extent of such determination of invalidity or unenforceability without affecting the validity or enforceability thereof in any other manner or jurisdiction and without affecting the remaining provisions of the Terms, which shall continue to be in full force and effect. If Section 12 is found to be illegal or unenforceable then neither you nor COOKAPPS will elect to arbitrate any Dispute falling within that portion of Section 12 found to be illegal or unenforceable and such Dispute shall be decided by a court of competent jurisdiction within the Republic of Korea Seoul Central District Court, and you and COOKAPPS agree to submit to the personal jurisdiction of that court.\n\n14) Miscellaneous\nCOOKAPPS operates and controls the Service from its offices in the Republic of Korea. COOKAPPS makes no representation that the Service is appropriate or available in other locations. The information provided on the Service is not intended for distribution to or use by any person or entity in any jurisdiction or country where such distribution or use would be contrary to law or regulation or which would subject COOKAPPS to any registration requirement within such jurisdiction or country. Accordingly, those persons who choose to access the Service from other locations do so on their own initiative and are solely responsible for compliance with local laws, if and to the extent local laws are applicable. By downloading any software, you represent and warrant that you are not located in, under the control of, or a national or resident of, any such country or on any such list. The parties specifically disclaim application of the Convention on Contracts for the International Sale of Goods. These Terms are effective until terminated by either party. You may terminate these Terms by destroying all Service-related materials obtained from the Service, COOKAPPS or any other web site or source. The privileges granted to you under these Terms will terminate immediately and automatically without notice from COOKAPPS if, in our sole discretion, you fail to comply with any term or provision of these Terms. Neither the course of conduct between the parties nor trade practice will act to modify these Terms to any party at any time. You may not assign these Terms without COOKAPPS's prior written consent, whereas COOKAPPS may assign its rights and duties under these terms to any party at any time without notice to you. These Terms contain the entire understanding of you and COOKAPPS, and supersede all prior understandins of the parties hereto relating to the subject matter hereof, and cannot be changed or modified by you except as posted on the Service by COOKAPPS. If any provision of these Terms is found to be illegal or unenforceable, the Terms will be deemed curtailed to the extent necessary to make it legal and enforceable and will remain, as modified, in full force and effect. No waiver by either party of any breach or default hereunder shall be deemed to be a waiver of any preceding or subsequent breach or default. The section headings used herein are for convenience only and shall not be given any legal import. Upon COOKAPPS's request, you will furnish COOKAPPS any documentation, substantiation or releases necessary to verify your compliance with these Terms. You agree that these Terms will not be construed against COOKAPPS by virtue of having drafted them. You hereby waive any and all defenses you may have based on the electronic form of these Terms and the lack of signing by the parties hereto to execute these Terms.\n\n15) Statute of Limitations\nYou and COOKAPPS both agree that regardless of any statute or law to the contrary, any claim or cause of action arising out of or related to use of the Service, Terms or Privacy Policy must be filed within ONE (1) YEAR after such claim or cause of action arose or be forever barred.\n";
                break;
        }

        return "이용약관";
    }


    // public string GetText(int id)
    // {
    //     // try
    //     // {
    //     //     LanguageMetaData data = SpecDataManager.Instance.GetLanguageData(id);
    //     //     return data.desc;
    //     // }
    //     // catch (System.Exception e)
    //     // {
    //     //     Debug.LogWarning(e);
    //     // }
    //     //
    //     // return string.Empty;
    // }

    // public string GetText(string token)
    // {
    //     // try
    //     // {
    //     //     LanguageMetaData data = SpecDataManager.Instance.GetLanguageData(token);
    //     //     return data.desc;
    //     // }
    //     // catch (System.Exception e)
    //     // {
    //     //     Debug.LogWarning(e);
    //     // }
    //     //
    //     // return string.Empty;
    // }

    public void SetText(InputField inputFieldText, string text)
    {
        try
        {
            if (inputFieldText == null)
            {
                Debug.LogError("WARNINIG!!!!!!! uiText is null");
                return;
            }

            if (inputFieldText.textComponent.font != null)
            {
                if (inputFieldText.textComponent.font.name != this.GetFont().name)
                    inputFieldText.textComponent.font = this.GetFont();
            }
            else
            {
                inputFieldText.textComponent.font = this.GetFont();
            }

            inputFieldText.text = text;
        }
        catch (Exception e)
        {
            Debug.LogError(e);
        }
    }



    public string GetSecText()
    {
        switch (this.lan)
        {
            case Language.EN: return "sec";
            case Language.KR: return "초";
            case Language.JP: return "秒";
            case Language.TC: return "秒";
            case Language.SC: return "秒";
            case Language.TH: return "วินาที";
            default: return "sec";
        }
    }

    public string GetExitText()
    {
        switch (lan)
        {
            case Language.EN: return "Are you sure you want to quit the game?";
            case Language.KR: return "종료하시겠습니까?";
            case Language.JP: return "終了しますか？";
            case Language.TC: return "您確定要退出遊戲嗎？";
            case Language.SC: return "您确定要退出游戏吗？";
            case Language.TH: return "คุณแน่ใจหรือว่าต้องการเลิก?";
            default: return "Are you sure you want to quit the game?";
        }
    }

    public string GetCloseText()
    {
        switch (lan)
        {
            case Language.EN: return "CANCEL";
            case Language.KR: return "취소";
            case Language.JP: return "キャンセル";
            case Language.TC: return "取消";
            case Language.SC: return "取消";
            case Language.TH: return "ยกเลิก";
            default: return "CANCEL";
        }
    }

    public string GetConfirmText()
    {
        switch (this.lan)
        {
            case Language.EN: return "CONFIRM";
            case Language.KR: return "확인";
            case Language.JP: return "確認";
            case Language.TC: return "確認";
            case Language.SC: return "确认";
            case Language.FR: return "Confirmer";
            case Language.DE: return "Bestätigen";
            case Language.RU: return "ОК";
            case Language.ES: return "Confirmar";
            case Language.IT: return "Conferma";
            case Language.PT: return "Confirmar";
            case Language.VN: return "OK";
            case Language.ID: return "Konfirmasi";
            case Language.TH: return "ยืนยัน";
            case Language.TR: return "Tamam";

            default: return "CONFIRM";
        }
    }

    public string GetContactUSText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Contact us";
            case Language.KR: return "문의 하기";
            case Language.JP: return "お問い合わせ";
            case Language.TC: return "聯繫我們";
            case Language.SC: return "联系我们";
            case Language.FR: return "Contactez-nous";
            case Language.DE: return "Kontaktieren Sie uns";
            case Language.RU: return "Свяжитесь с нами";
            case Language.ES: return "Contactarnos";
            case Language.IT: return "Contattiamoci";
            case Language.PT: return "Contate-nos";
            case Language.VN: return "Liên lạc với chúng tôi";
            case Language.ID: return "Hubungi kami";
            case Language.TH: return "ติดต่อเรา";
            case Language.TR: return "Bize Ulaşın";
            default: return "Contact us";
        }
    }

    public string GetDuplicatedDeviceText()
    {
        switch (this.lan)
        {
            case Language.EN: return "A connection was detected from another device.";
            case Language.KR: return "다른기기에서 접속이 감지 되었습니다.";
            case Language.JP: return "他の機器からの接続が検出されました。";
            case Language.TC: return "從另一台設備檢測到連接。";
            case Language.SC: return "从另一台设备检测到连接。";
            case Language.FR: return "Une connexion a été détectée à partir d'un autre périphérique";
            case Language.DE: return "Eine Verbindung wurde von einem anderen Gerät entdeckt.";
            case Language.RU: return "Соединение было обнаружено с другого устройства";
            case Language.ES: return "Una conexión fue detectada de otro dispositivo";
            case Language.IT: return "Una connessione è stata rilevata da un altro dispositivo";
            case Language.PT: return "Uma conexão foi detectada, de outro dispositivo.";
            case Language.VN: return "Một kết nối đã được phát hiện từ một thiết bị khác";
            case Language.ID: return "Sebuah koneksi terdeteksi dari perangkat lain";
            case Language.TH: return "การเชื่อมต่อถูกตรวจพบจากอุปกรณ์อื่น";
            case Language.TR: return "Başka bir cihazdan bağlantı algılandı";
            default: return "A connection was detected from another device.";
        }
    }

    public string GetNeedUpdateText()
    {
        switch (this.lan)
        {
            case Language.EN: return "A new version has been released. Please update.";
            case Language.KR: return "새로운 버전이 출시되었습니다. 업데이트 해주세요.";
            case Language.JP: return "新しいバージョンがリリースされました。アップデートしてください。";
            case Language.TC: return "新版本已經發布。請更新。";
            case Language.SC: return "新版本已经发布。请更新。";
            case Language.FR: return "Une nouvelle version a été publiée. Veuillez mettre à jour.";
            case Language.DE: return "Eine neue Version wurde veröffentlicht. Bitte aktualisieren Sie.";
            case Language.RU: return "Вышла новая версия. Обновление.";
            case Language.ES: return "Se ha lanzado una nueva versión. Por favor, actualiza.";
            case Language.IT: return "E' stata pubblicata una nuova versione. Per favore, aggiornare.";
            case Language.PT: return "Uma nova versão tenha sido libertado.Por favor.";
            case Language.VN: return "Một phiên bản mới đã được phát hành. Cập nhật tình hình đi.";
            case Language.ID: return "Sebuah versi baru telah dirilis. Tolong update.";
            case Language.TH: return "รุ่นใหม่ได้ถูกปล่อยออกมาแล้ว โปรดปรับปรุงใหม่ ";
            case Language.TR: return " Yeni bir sürüm yayınlandı. Lütfen güncelle.";
            default: return "A new version has been released. Please update.";
        }
    }

    public string GetNeedNewVersionText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Restart to apply the new data version.";
            case Language.KR: return "신규 데이터 패치를 위해 재시작 합니다.";
            case Language.JP: return "新しいバージョンのデータを適用するため、再起動します";
            case Language.TC: return "將重新開始以套用新版本的資料。";
            case Language.SC: return "为加载新版本的数据，即将重启游戏。";
            case Language.FR: return "Redémarrez pour appliquer la nouvelle version de données.";
            case Language.DE: return "Starten Sie neu, um die neue Version anzuwenden.";
            case Language.RU: return "Перезапустите для применения новой версии данных.";
            case Language.ES: return "Reinicia para aplicar la nueva versión de datos.";
            case Language.IT: return "Riprenda per applicare la nuova versione dei dati.";
            case Language.PT: return "Reiniciar para aplicar a nova versão de dados.";
            case Language.VN: return "Khởi động lại để áp dụng phiên bản dữ liệu mới.";
            case Language.ID: return "Mulai kembali untuk menerapkan versi data baru.";
            case Language.TH: return "เริ่มใหม่เพื่อปรับใช้รุ่นใหม่ของข้อมูล.";
            case Language.TR: return " Yeni veri sürümünü uygulamak için yeniden başlatın.";
            default: return "Restart to apply the new data version.";
        }
    }

    public string GetNeedLoginText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Reconnection is required.";
            case Language.KR: return "재접속이 필요합니다.";
            case Language.JP: return "再接続が必要です。";
            case Language.TC: return "需要重新連接。";
            case Language.SC: return "需要重新连接。";
            case Language.FR: return "Il faut une connexion.";
            case Language.DE: return "Es ist eine Verbindung erforderlich.";
            case Language.RU: return "Необходимо подключение.";
            case Language.ES: return "Se requiere una conexión.";
            case Language.IT: return "E' necessario un collegamento.";
            case Language.PT: return "Reconexão é necessário.";
            case Language.VN: return "Cần phải kết nối lại.";
            case Language.ID: return "Koneksi diperlukan.";
            case Language.TH: return "การเชื่อมต่อต้องใช้ใหม่";
            case Language.TR: return "Tamam";
        }

        return string.Empty;
    }

    public string GetAccountLockedText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Your account has been suspended.";
            case Language.KR: return "계정이 정지되었습니다.";
            case Language.JP: return "アカウントが停止されました。";
            case Language.TC: return "您的帳戶已被暫停。";
            case Language.SC: return "您的帐户已被暂停。";
            case Language.FR: return "Votre compte a été suspendu.";
            case Language.DE: return "Ihr Konto wurde unterbrochen.";
            case Language.RU: return "Ваш аккаунт был приостановлен.";
            case Language.ES: return "Su cuenta ha sido suspendida.";
            case Language.IT: return "Il suo conto è stato sospeso.";
            case Language.PT: return "Sua conta foi suspensa.";
            case Language.VN: return "Tài khoản của anh đã bị đình chỉ.";
            case Language.ID: return "Akunmu telah ditangguhkan.";
            case Language.TH: return "บัญชีของคุณถูกพักการเรียน";
            case Language.TR: return "Hesabınız askıya alındı.";
            default: return "Your account has been suspended.";
        }
    }

    public string GetNeedDownloadFromStoreText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Please download the app from the store.";
            case Language.KR: return "스토어에 정식으로 앱을 다운로드 받아주세요.";
            case Language.JP: return "ストアからアプリをダウンロードしてください。";
            case Language.TC: return "請從商店下載該應用程序。";
            case Language.SC: return "请从商店下载该应用程序。";
            case Language.FR: return "Veuillez télécharger l'application de la boutique.";
            case Language.DE: return "Bitte laden Sie die Anwendung aus dem Shop herunter.";
            case Language.RU: return "Пожалуйста, скачайте приложение из магазина.";
            case Language.ES: return "Por favor, descarguen la aplicación de la tienda.";
            case Language.IT: return "Si prega di scaricare l'applicazione dalla store.";
            case Language.PT: return "Por favor, baixar o aplicativo da loja.";
            case Language.VN: return "Vui lòng tải ứng dụng này từ cửa hàng.";
            case Language.ID: return "Silakan download aplikasi dari toko.";
            case Language.TH: return "โปรดดาวน์โหลดแอพจากร้านค้า";
            case Language.TR: return " Lütfen uygulamayı mağazadan indirin.";
            default: return "Please download the app from the store.";
        }
    }

    public string GetServerCheckText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Sorry. The server is currently being checked.";
            case Language.KR: return "죄송합니다. 현재 서버 점검 중입니다.";
            case Language.JP: return "申し訳ありません。現在のサーバーメンテナンス中です。";
            case Language.TC: return "不好意思 當前正在檢查服務器。";
            case Language.SC: return "不好意思 当前正在检查服务器。";
            case Language.FR: return "Désolé, le serveur est actuellement en cours de vérification.";
            case Language.DE: return "Der Server wird derzeit überprüft.";
            case Language.RU: return "Извините. Сервер в настоящее время проверяется.";
            case Language.ES: return "Lo siento. El servidor está siendo revisado.";
            case Language.IT: return "Lo siento, il server è attualmente in corso di verifica.";
            case Language.PT: return "Desculpe. O servidor está actualmente a ser verificado.";
            case Language.VN: return "Xin lỗi, máy chủ đang được kiểm tra.";
            case Language.ID: return "Maaf, server sedang diperiksa.";
            case Language.TH: return "ขอโทษครับ ตอนนี้เซิร์ฟเวอร์กำลังถูกตรวจสอบอยู่";
            case Language.TR: return "Üzgünüm. Sunucu şu anda kontrol ediliyor.";
            default: return "Sorry. The server is currently being checked.";
        }
    }

    public string GetRootingDetectText()
    {
        switch (this.lan)
        {
            case Language.EN: return "You cannot play on rooted devices.";
            case Language.KR: return "루팅된 기기에서는 플레이 할 수 없습니다.";
            case Language.JP: return "ルーティングされた機器では再生できません。";
            case Language.TC: return "您不能在有根設備上播放。";
            case Language.SC: return "您不能在有根设备上播放。";
            case Language.FR: return "Vous ne pouvez pas jouer sur des dispositifs enracinés.";
            case Language.DE: return "Man kann nicht auf verwurzelten Geräten spielen.";
            case Language.RU: return "Вы не можете играть на укорененных устройствах.";
            case Language.ES: return "No se puede jugar con dispositivos enraizados.";
            case Language.IT: return "Non si può giocare con dispositivi radicati.";
            case Language.PT: return "Você não pode jogar com aos dispositivos.";
            case Language.VN: return "Bạn không thể chơi trên các thiết bị gốc.";
            case Language.ID: return "Kau tak bisa bermain dengan perangkat berakar.";
            case Language.TH: return "คุณไม่สามารถเล่นบนอุปกรณ์ที่มีรากฐานได้";
            case Language.TR: return "Rootlu cihazlarda oyun oynayamazsınız.";
            default: return "You cannot play on rooted devices.";
        }
    }

    public string GetCheatingDetectText()
    {
        switch (this.lan)
        {
            case Language.EN: return "You cannot play on rooted devices.";
            case Language.KR: return "루팅된 기기에서는 플레이 할 수 없습니다.";
            case Language.JP: return "ルーティングされた機器では再生できません。";
            case Language.TC: return "您不能在有根設備上播放。";
            case Language.SC: return "您不能在有根设备上播放。";
            case Language.FR: return "Vous ne pouvez pas jouer sur des dispositifs enracinés.";
            case Language.DE: return "Man kann nicht auf verwurzelten Geräten spielen.";
            case Language.RU: return "Вы не можете играть на укорененных устройствах.";
            case Language.ES: return "No se puede jugar con dispositivos enraizados.";
            case Language.IT: return "Non si può giocare con dispositivi radicati.";
            case Language.PT: return "Você não pode jogar com aos dispositivos.";
            case Language.VN: return "Bạn không thể chơi trên các thiết bị gốc.";
            case Language.ID: return "Kau tak bisa bermain dengan perangkat berakar.";
            case Language.TH: return "คุณไม่สามารถเล่นบนอุปกรณ์ที่มีรากฐานได้";
            case Language.TR: return "Rootlu cihazlarda oyun oynayamazsınız.";
            default: return "Hacking attempt is detected.";
        }
    }

    public string GetTimeCheatingDetectText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Changing device time cheating attempt is detected.";
            case Language.KR: return "기기 시간 변경 시도가 감지되었습니다.";
            case Language.JP: return "機器の時間変化が検知されました。";
            case Language.TC: return "已檢測到嘗試更改設備時間的嘗試。";
            case Language.SC: return "检测到尝试更改设备时间。";
        }

        return string.Empty;
    }

    public string GetTryAgainText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Please try again.";
            case Language.KR: return "다시 시도해 주세요.";
            case Language.JP: return "もう一度やり直してください。";
            case Language.TC: return "請再試一遍。";
            case Language.SC: return "请再试一遍。";
            case Language.TH: return "กรุณาลองอีกครั้ง.";
            default: return "Please try again.";
        }
    }

    public string GetGoogleLoginText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Sign in with Google Play";
            case Language.KR: return "구글 로그인";
            case Language.JP: return "Google Playのアカウントでサインイン";
            case Language.TC: return "在與谷歌播放";
            case Language.SC: return "在与谷歌播放";
            case Language.TH: return "เข้าสู่ระบบ Google";
            default: return "Sign in with Google Play";
        }
    }

    public string GetAppleLoginText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Sign in with Apple";
            case Language.KR: return "애플 로그인";
            case Language.JP: return "アップルでサインイン";
            case Language.TC: return "登錄與蘋果";
            case Language.SC: return "登录与苹果";
            case Language.TH: return "แอปเปิ้ลเข้าสู่ระบบ";
            default: return "Sign in with Apple";
        }
    }
    
    public string GetFacebookLoginText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Sign in with Facebook";
            case Language.KR: return "페이스 북 로그인";
            case Language.JP: return "Facebookログイン";
            case Language.TC: return "臉書登入";
            case Language.SC: return "脸书登录";
            case Language.TH: return "เข้าสู่ระบบเฟสบุ๊ค";
            default: return "Sign in with Facebook";
        }
    }

    public string GetRegionText(string region)
    {
        switch (region)
        {
            case "USA": return GetRegionENText();
            case "KOR": return GetRegionKORText();
            case "VNM": return GetRegionASIAText();
            case "GBR": return GetRegionEUText();
            case "GLOBAL": return GetRegionGLOBALText();
            case "TWN": return GetRegionTWText();
            case "JPN": return GetRegionJPText();
            default: return region;
        }
    }

    public string GetRegionKORText()
    {
        switch (this.lan)
        {
            case Language.EN: return "South Korea";
            case Language.KR: return "대한민국";
            case Language.JP: return "韓国";
            case Language.TC: return "韓國";
            case Language.SC: return "韩国";
            case Language.TH: return "เกาหลี";
            default: return "South Korea";
        }
    }

    public string GetRegionEUText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Europe";
            case Language.KR: return "유럽";
            case Language.JP: return "ヨーロッパ";
            case Language.TC: return "歐洲";
            case Language.SC: return "欧洲";
            case Language.TH: return "ยุโรป";
            default: return "Europe";
        }
    }

    public string GetRegionENText()
    {
        switch (this.lan)
        {
            case Language.EN: return "North America";
            case Language.KR: return "북미";
            case Language.JP: return "北アメリカ";
            case Language.TC: return "北美";
            case Language.SC: return "北美";
            case Language.TH: return "อเมริกาเหนือ";
            default: return "North America";
        }
    }

    public string GetRegionASIAText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Asia";
            case Language.KR: return "아시아";
            case Language.JP: return "アジア";
            case Language.TC: return "亞洲";
            case Language.SC: return "亚洲";
            case Language.TH: return "เอเชีย";
            default: return "Southeast Asia";
        }
    }

    public string GetRegionGLOBALText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Global";
            case Language.KR: return "글로벌";
            case Language.JP: return "グローバル";
            case Language.TC: return "全球";
            case Language.SC: return "全球";
            case Language.TH: return "ทั่วโลก";
            default: return "Global";
        }
    }
    
    public string GetRegionTWText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Taiwan";
            case Language.KR: return "대만";
            case Language.JP: return "台湾";
            case Language.TC: return "台灣";
            case Language.SC: return "台湾";
            case Language.TH: return "ไต้หวัน";
            default: return "Taiwan";
        }
    }
    
    public string GetRegionJPText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Japan";
            case Language.KR: return "일본";
            case Language.JP: return "日本";
            case Language.TC: return "日本";
            case Language.SC: return "日本";
            case Language.TH: return "ญี่ปุ่น";
            default: return "Japan";
        }
    }

    public string GetServerSelectText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Select a server";
            case Language.KR: return "서버 선택";
            case Language.JP: return "サーバーを選択";
            case Language.TC: return "選擇伺服器";
            case Language.SC: return "选择服务器";
            case Language.TH: return "เลือกเซิร์ฟเวอร์";
            default: return "Select a server";
        }
    }

    public string GetServerMainText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Select a server to play the game on.";
            case Language.KR: return "게임을 플레이할 서버를 선택해 주세요.";
            case Language.JP: return "ゲームをプレイするサーバーを選択します。";
            case Language.TC: return "請選擇遊玩的伺服器。";
            case Language.SC: return "请选择游玩的服务器。";
            case Language.TH: return "กรุณาเลือกเซิร์ฟเวอร์ที่จะเล่น";
            default: return "Select a server to play the game on.";
        }
    }


    public string GetServerSubText()
    {
        switch (this.lan)
        {
            case Language.EN: return "(Choose the best server for your network speed)";
            case Language.KR: return "(선택하신 서버에 따라서 네트워크 속도 차이가 있습니다.)";
            case Language.JP: return "（選択したサーバーによってネットワーク速度に違いがあります。）。";
            case Language.TC: return "（根據所選伺服器可能會有網路速度差異。）";
            case Language.SC: return "（根据所选服务器可能会有网络速度差异。）";
            case Language.TH: return "(อาจมีความแตกต่างในความเร็วของเครือข่ายขึ้นอยู่กับเซิร์ฟเวอร์ที่เลือก)";
            default: return "(There are differences in network speed depending on the selected server.)";
        }
    }

    public string GetRecommandServerText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Recommend Server";
            case Language.KR: return "추천서버";
            case Language.JP: return "推奨サーバー";
            case Language.TC: return "推薦伺服器";
            case Language.SC: return "推荐服务器";
            case Language.TH: return "เซิร์ฟเวอร์ที่แนะนำ";
            default: return "Recommend Server";
        }
    }
    
    public string GetNewServerText()
    {
        switch (this.lan)
        {
            case Language.EN: return "New server";
            case Language.KR: return "신규서버";
            case Language.JP: return "新規サーバー";
            case Language.TC: return "新服務器";
            case Language.SC: return "新服务器";
            case Language.TH: return "เซิร์ฟเวอร์ใหม่";
            default: return "New server";
        }
    }

    public string GetHaveAccountText()
    {
        switch (this.lan)
        {
            case Language.EN: return "Hold an account";
            case Language.KR: return "계정보유";
            case Language.JP: return "アカウント保有";
            case Language.TC: return "持有帳號";
            case Language.SC: return "持有账号";
            case Language.TH: return "มีบัญชีอยู่แล้ว";
            default: return "Hold an account";
        }
    }




    public string GetRankingText(int ranking)
    {
        switch (this.lan)
        {
            case Language.EN:
                if (ranking == 1)
                    return ranking + "st";
                else if (ranking == 2)
                    return ranking + "nd";
                else if (ranking == 3)
                    return ranking + "rd";
                else
                    return ranking + "th";
            case Language.KR: return ranking + "위";
            case Language.JP: return ranking + "位";
            case Language.TC: return "第" + ranking + "名";
            case Language.SC: return "第" + ranking + "名";
            default:
                if (ranking == 1)
                    return ranking + "st";
                else if (ranking == 2)
                    return ranking + "nd";
                else if (ranking == 3)
                    return ranking + "rd";
                else
                    return ranking + "th";
        }
    }

    public string GetLeftTimeString(TimeSpan leftTime, bool usingPostFix = false)
    {
        string returnStr = string.Empty;

        if (LanguageManager.Instance.Language == Language.EN)
        {
            if (leftTime.Days > 0)
            {
                returnStr = string.Format("{0:00}d {1:00}h", leftTime.Days, leftTime.Hours);
            }
            else if (leftTime.Hours > 0)
            {
                returnStr = string.Format("{0:00}h {1:00}m", leftTime.Hours, leftTime.Minutes);
            }
            else if (leftTime.Minutes == 0)
            {
                returnStr = string.Format("{0:00}s", leftTime.Seconds);
            }
            else
            {
                returnStr = string.Format("{0:00}m {1:00}s", leftTime.Minutes, leftTime.Seconds);
            }
        }
        else if (LanguageManager.Instance.Language == Language.KR)
        {
            if (leftTime.Days > 0)
            {
                returnStr = string.Format("{0:00}일 {1:00}시간", leftTime.Days, leftTime.Hours);
            }
            else if (leftTime.Hours > 0)
            {
                returnStr = string.Format("{0:00}시간 {1:00}분", leftTime.Hours, leftTime.Minutes);
            }
            else if (leftTime.Minutes == 0)
            {
                returnStr = string.Format("{0:00}초", leftTime.Seconds);
            }
            else
            {
                returnStr = string.Format("{0:00}분 {1:00}초", leftTime.Minutes, leftTime.Seconds);
            }
        }
        else if (LanguageManager.Instance.Language == Language.TC)
        {
            //10天4小時30分鐘20秒
            if (leftTime.Days > 0)
            {
                returnStr = string.Format("{0:00}天 {1:00}小時", leftTime.Days, leftTime.Hours);
            }
            else if (leftTime.Hours > 0)
            {
                returnStr = string.Format("{0:00}小時 {1:00}分", leftTime.Hours, leftTime.Minutes);
            }
            else if (leftTime.Minutes == 0)
            {
                returnStr = string.Format("{0:00}秒", leftTime.Seconds);
            }
            else
            {
                returnStr = string.Format("{0:00}分 {1:00}秒", leftTime.Minutes, leftTime.Seconds);
            }
        }
        else if (LanguageManager.Instance.Language == Language.SC)
        {
            //10天4小时30分钟20秒
            if (leftTime.Days > 0)
            {
                returnStr = string.Format("{0:00}天 {1:00}小时", leftTime.Days, leftTime.Hours);
            }
            else if (leftTime.Hours > 0)
            {
                returnStr = string.Format("{0:00}小时 {1:00}分", leftTime.Hours, leftTime.Minutes);
            }
            else if (leftTime.Minutes == 0)
            {
                returnStr = string.Format("{0:00}秒", leftTime.Seconds);
            }
            else
            {
                returnStr = string.Format("{0:00}分 {1:00}秒", leftTime.Minutes, leftTime.Seconds);
            }
        }
        else if (LanguageManager.Instance.Language == Language.JP)
        {
            //10日4時間30分20秒
            if (leftTime.Days > 0)
            {
                returnStr = string.Format("{0:00}日 {1:00}時間", leftTime.Days, leftTime.Hours);
            }
            else if (leftTime.Hours > 0)
            {
                returnStr = string.Format("{0:00}時間 {1:00}分", leftTime.Hours, leftTime.Minutes);
            }
            else if (leftTime.Minutes == 0)
            {
                returnStr = string.Format("{0:00}秒", leftTime.Seconds);
            }
            else
            {
                returnStr = string.Format("{0:00}分 {1:00}秒", leftTime.Minutes, leftTime.Seconds);
            }
        }
        else
        {
            if (leftTime.Days > 0)
            {
                returnStr = string.Format("{0:00}d {1:00}h", leftTime.Days, leftTime.Hours);
            }
            else if (leftTime.Hours > 0)
            {
                returnStr = string.Format("{0:00}h {1:00}m", leftTime.Hours, leftTime.Minutes);
            }
            else if (leftTime.Minutes == 0)
            {
                returnStr = string.Format("{0:00}s", leftTime.Seconds);
            }
            else
            {
                returnStr = string.Format("{0:00}m {1:00}s", leftTime.Minutes, leftTime.Seconds);
            }
        }

        //if (usingPostFix) returnStr += $" {LanguageManager.Instance.GetText("COMMON_LEFT").ToUpper()}";

        return returnStr;
    }

    public string GetLeftTimeString(long sec, bool usingPostFix = false)
    {
        TimeSpan leftTime = TimeSpan.FromSeconds(sec);

        return GetLeftTimeString(leftTime);
    }

    public int GetLeftTimeHourInt(long sec, bool usingPostFix = false)
    {
        TimeSpan leftTime = TimeSpan.FromSeconds(sec);
        return leftTime.Hours;
    }

    public string GetTime(long sec)
    {
        TimeSpan leftTime = TimeSpan.FromSeconds(sec);

        if (leftTime.Hours > 0)
            return string.Format("{0:00}:{1:00}", leftTime.Hours, leftTime.Minutes);
        else
            return string.Format("{0:00}:{1:00}", leftTime.Minutes, leftTime.Seconds);
    }

    public Language GetRecommand()
    {
        if (Application.systemLanguage == SystemLanguage.Korean)
            return Language.KR;
        if (Application.systemLanguage == SystemLanguage.ChineseTraditional)
            return Language.TC;
        if (Application.systemLanguage == SystemLanguage.ChineseSimplified)
            return Language.SC;
        if (Application.systemLanguage == SystemLanguage.Japanese)
            return Language.JP;
        if (Application.systemLanguage == SystemLanguage.Thai)
            return Language.TH;
        // if (Application.systemLanguage == SystemLanguage.French)
        //     return Language.FR;
        // if (Application.systemLanguage == SystemLanguage.Dutch)
        //     return Language.DE;
        // if (Application.systemLanguage == SystemLanguage.Russian)
        //     return Language.RU;
        // if (Application.systemLanguage == SystemLanguage.Spanish)
        //     return Language.ES;
        // if (Application.systemLanguage == SystemLanguage.Italian)
        //     return Language.IT;
        // if (Application.systemLanguage == SystemLanguage.Portuguese)
        //     return Language.PT;
        // if (Application.systemLanguage == SystemLanguage.Vietnamese)
        //     return Language.VN;

        // if (Application.systemLanguage == SystemLanguage.Turkish)
        //     return Language.TR;
        // if (Application.systemLanguage == SystemLanguage.Indonesian)
        //     return Language.ID;

        return Language.EN;
    }

    public Language GetRecommandAudio()
    {
        if (Application.systemLanguage == SystemLanguage.Korean)
            return Language.KR;

        return Language.JP;
    }


    

    protected override void Awake()
    {
        base.Awake();
        this.lan = (Language)Preference.LoadPreference(Pref.LANGUAGE, (int)this.GetRecommand());
        this.audioLan = (Language)Preference.LoadPreference(Pref.AUDIO_LANGUAGE, (int)this.GetRecommandAudio());
        this.LoadNames();
        this.LoadBadNames();
    }

    // protected IEnumerator Start()
    // {
    //     yield return new WaitUntil(() => DataManager.Instance.IsDataLoaded);
    //     this.lan = (Language)Enum.Parse(typeof(Language), DataManager.Instance.UserData.lan);
    //     Preference.SavePreference(Pref.LANGUAGE, (int)this.lan);
    //
    //     this.audioLan = (Language)Enum.Parse(typeof(Language), DataManager.Instance.UserData.audioLan);
    //     Preference.SavePreference(Pref.AUDIO_LANGUAGE, (int)this.audioLan);
    // }

    [Header("UIText")] [SerializeField] private Font fontKR;
    [SerializeField] private Font fontEN;
    [SerializeField] private Font fontJP;
    [SerializeField] private Font fontCN_SC;
    [SerializeField] private Font fontArial;
    [SerializeField] private Font fontTH;
    [SerializeField] private Font fontRU;

    [Header("TextMeshPro")] [SerializeField]
    private TMP_FontAsset fontKR_TxtMeshPro;

    [SerializeField] private TMP_FontAsset fontEN_TxtMeshPro;
    [SerializeField] private TMP_FontAsset fontJP_TxtMeshPro;
    [SerializeField] private TMP_FontAsset fontCN_SC_TxtMeshPro;
    [SerializeField] private TMP_FontAsset fontArial_TxtMeshPro;
    [SerializeField] private TMP_FontAsset fontTH_TxtMeshPro;
    [SerializeField] private TMP_FontAsset fontRU_TxtMeshPro;


    [SerializeField] private TextAsset nameEnAsset;
    [SerializeField] private TextAsset badEnAsset;
    [SerializeField] private TextAsset badKrAsset;
    private List<string> names;
    private List<string> badNames;

    private Language lan = Language.EN;
    private Language audioLan = Language.JP;

    private void LoadNames()
    {
        StringReader sr = new StringReader(this.nameEnAsset.text);

        this.names = new List<string>();
        string line = sr.ReadLine();
        while (!string.IsNullOrEmpty(line))
        {
            line = sr.ReadLine();
            this.names.Add(line);
        }
    }

    private void LoadBadNames()
    {
        if (this.badNames == null)
        {
            this.badNames = new List<string>();
            if (this.badEnAsset != null)
            {
                StringReader sr = new StringReader(this.badEnAsset.text);

                string line = sr.ReadLine();
                while (!string.IsNullOrEmpty(line))
                {
                    line = sr.ReadLine();
                    this.badNames.Add(line);
                }
            }

            if (this.badKrAsset != null)
            {
                StringReader sr = new StringReader(this.badKrAsset.text);

                string line = sr.ReadLine();
                while (!string.IsNullOrEmpty(line))
                {
                    line = sr.ReadLine();
                    this.badNames.Add(line);
                }
            }
        }
    }
}